[
  {
    "id": "bukhari-2",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 2",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ قَالَ أَخْبَرَنَا مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ رَضِيَ اللَّهُ عَنْهَاأَنَّ الْحَارِثَ بْنَ هِشَامٍ رَضِيَ اللَّهُ عَنْهُ سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ يَأْتِيكَ الْوَحْيُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ وَهُوَ أَشَدُّهُ عَلَيَّ فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ وَأَحْيَانًا يَتَمَثَّلُ لِي الْمَلَكُ رَجُلًا فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ قَالَتْ عَائِشَةُ رَضِيَ اللَّهُ عَنْهَا وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْيُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا",
      "id": "Telah menceritakan kepada kami [Abdullah bin Yusuf] berkata, telah mengabarkan kepada kami [Malik] dari [Hisyam bin 'Urwah] dari [bapaknya] dari [Aisyah] Ibu Kaum Mu'minin, bahwa Al Harits bin Hisyam bertanya kepada Rasulullah shallallahu 'alaihi wasallam: \"Wahai Rasulullah, bagaimana caranya wahyu turun kepada engkau?\" Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Terkadang datang kepadaku seperti suara gemerincing lonceng dan cara ini yang paling berat buatku, lalu terhenti sehingga aku dapat mengerti apa yang disampaikan. Dan terkadang datang Malaikat menyerupai seorang laki-laki lalu berbicara kepadaku maka aku ikuti apa yang diucapkannya\". Aisyah berkata: \"Sungguh aku pernah melihat turunnya wahyu kepada Beliau shallallahu 'alaihi wasallam pada suatu hari yang sangat dingin lalu terhenti, dan aku lihat dahi Beliau mengucurkan keringat.\" ",
      "en": "Has told us [Abdullah bin Yusuf] said, had preached to us [Malik] from [Hisyam bin 'Urwah] from [his father] from [Aisyah] the mother of Mu'minin, that Al Harits bin Hisham asked the Prophet sallallaahu' alaihi wasallam: \"Then the Prophet sallallaahu 'alayhi wasallam replied: \"Sometimes it comes to me like a glimpse of bells and this method is the most severe for me, then stops so that I can understand what is conveyed. And sometimes angels come to resemble a man and then talk to me then I follow what he says\".Aisyah said: \"I really have seen the descending of revelation to her sallallaahu 'alaihi wasallam one very cold day and then stopped, and I saw her forehead sweat.\""
    }
  },
  {
    "id": "muslim-3",
    "book": "Muslim",
    "source": "HR. Muslim, No. 3",
    "narrator": "N/A",
    "text": {
      "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا إِسْمَعِيلُ يَعْنِي ابْنَ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّهُ قَالَإِنَّهُ لَيَمْنَعُنِي أَنْ أُحَدِّثَكُمْ حَدِيثًا كَثِيرًا أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَعَمَّدَ عَلَيَّ كَذِبًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
      "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Ismail] -yaitu Ibnu 'Ulayyah- dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] bahwasanya dia berkata, 'Sesungguhnya sesuatu yang menghalangiku untuk menceritakan hadits yang banyak kepada kalian adalah, bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Barangsiapa yang sengaja melakukan kedustaan atas namaku, maka hendaklah dia menempati tempat duduknya dari neraka'.\"",
      "en": "Having told us [Zuhair bin Harb] had told us [Ismail] - namely Ibn 'Ulamyah - from [Abdul Aziz bin Shuhaib] from [Anas bin Malik] that he said,' really something that prevents me to tell a lot of hadiths to you is, that the Prophet sallallaahu 'alaihi wasallam.sitting from hell '. \""
    }
  },
  {
    "id": "abu-daud-4",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 4",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُسَدَّدُ بْنُ مُسَرْهَدٍ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ وَعَبْدُ الْوَارِثِ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ قَالَ عَنْ حَمَّادٍ قَالَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ وَقَالَ عَنْ عَبْدِ الْوَارِثِ قَالَ أَعُوذُ بِاللَّهِ مِنْ الْخُبُثِ وَالْخَبَائِثِقَالَ أَبُو دَاوُد رَوَاهُ شُعْبَةُ عَنْ عَبْدِ الْعَزِيزِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ وَقَالَ مَرَّةً أَعُوذُ بِاللَّهِ و قَالَ وُهَيْبٌ فَلْيَتَعَوَّذْ بِاللَّهِ حَدَّثَنَا الْحَسَنُ بْنُ عَمْرٍو يَعْنِي السَّدُوسِيَّ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ عَبْدِ الْعَزِيزِ هُوَ ابْنُ صُهَيْبٍ عَنْ أَنَسٍ بِهَذَا الْحَدِيثِ قَالَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ وَقَالَ شُعْبَةُ وَقَالَ مَرَّةً أَعُوذُ بِاللَّهِ",
      "id": "Telah menceritakan kepada kami [Musaddad bin Musarhad] telah menceritakan kepada kami [Hammad bin Zaid] dan [Abdul Warits] dari [Abdul Aziz bin Shuhaib] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam apabila hendak masuk WC -dia (Musaddad) meriwayatkan dari Hammad- beliau mengucapkan: \"Ya Allah, sesungguhnya aku berlindung kepadamu\" -sedangkan yang dia riwayatkan dari Abdul Harits- beliau mengucapkan: \"Aku berlindung kepada Allah dari setan jantan dan setan betina.\" Abu Dawud mengatakan; Syu'bah meriwayatkan dari Abdul Aziz (dengan lafazh); \"Ya Allah, sesungguhnya aku berlindung kepadaMu\", dalam kesempatan lain dia meriwayatkan (dengan lafazh); \"Aku berlindung kepada Allah\", dan Wuhaib menyebutkan; \"Hendaklah dia berlindung kepada Allah.\" Telah menceritakan kepada kami [Al Hasan bin Amru, yakni As Sadusi] telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Abdul Aziz, yaitu Ibnu Shuhaib] dari [Anas] dengan lafazh hadits ini, dia (Syu'bah) meriwayatkan (dari Abdul Aziz dengan lafazh); \"Ya Allah, sesungguhnya aku berlindung kepadaMu.\" Syu'bah mengatakan; Abdul Aziz dalam kesempatan lain meriwayatkan (dengan lafazh); \"Aku berlindung kepada Allah.\"",
      "en": "Having told us [Musaddad bin Musarhad] had told us [Hammad bin Zaid] and [Abdul Warits] from [Abdul Aziz bin Shuhaib] from [Anas] he said;Rasulullah sallallaahu 'alayhi wasallam if he wanted to enter the toilet -he (musaddad) narrated from Hammad - he said: \"O Allah, in fact I take refuge in you\" -Sang what he narrated from Abdul Harits - he said: \"I take refuge in Allah from male demon and female devils.\"Abu Dawud said;Syu'bah narrated from Abdul Aziz (with lafazh);\"O Allah, in fact I take refuge in you\", on another occasion he narrated (with lafazh);\"I take refuge in God\", and Wuhaib mentions;\"He should take refuge in God.\"Has told us [Al Hasan bin Amru, namely as Sadusi] had told us [Waki '] from [Syu'bah] from [Abdul Aziz, namely Ibnu Shuhaib] from [Anas] with this lafazh hadith, he (Syu'bah) narrated (from Abdul Aziz with lafazh);\"O Allah, I really take refuge in you.\"Syu'bah said;Abdul Aziz on another occasion narrated (with lafazh);\"I take refuge in God.\""
    }
  },
  {
    "id": "tirmidzi-5",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 5",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا قُتَيْبَةُ وَهَنَّادٌ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا دَخَلَ الْخَلَاءَ قَالَ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ قَالَ شُعْبَةُ وَقَدْ قَالَ مَرَّةً أُخْرَى أَعُوذُ بِكَ مِنْ الْخُبْثِ وَالْخَبِيثِ أَوْ الْخُبُثِ وَالْخَبَائِثِقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عَلِيٍّ وَزَيْدِ بْنِ أَرْقَمَ وَجَابِرٍ وَابْنِ مَسْعُودٍ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ وَحَدِيثُ زَيْدِ بْنِ أَرْقَمَ فِي إِسْنَادِهِ اضْطِرَابٌ رَوَى هِشَامٌ الدَّسْتُوَائِيُّ وَسَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ فَقَالَ سَعِيدٌ عَنْ الْقَاسِمِ بْنِ عَوْفٍ الشَّيْبَانِيِّ عَنْ زَيْدِ بْنِ أَرْقَمَ و قَالَ هِشَامٌ الدَّسْتُوَائِيُّ عَنْ قَتَادَةَ عَنْ زَيْدِ بْنِ أَرْقَمَ وَرَوَاهُ شُعْبَةُ وَمَعْمَرٌ عَنْ قَتَادَةَ عَنْ النَّضْرِ بْنِ أَنَسٍ فَقَالَ شُعْبَةُ عَنْ زَيْدِ بْنِ أَرْقَمَ وَقَالَ مَعْمَرٌ عَنْ النَّضْرِ بْنِ أَنَسٍ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عِيسَى سَأَلْتُ مُحَمَّدًا عَنْ هَذَا فَقَالَ يُحْتَمَلُ أَنْ يَكُونَ قَتَادَةُ رَوَى عَنْهُمَا جَمِيعًا",
      "id": "telah menceritakan kepada kami [Qutaibah] dan [Hannad] mereka berkata; telah menceritakan kepada kami [Waki'] dari [Syu'bah] dari [Abdul Aziz bin Shuhaib] dari [Anas bin Malik] ia berkata, Nabi Shallahu 'alaihi wa Sallam jika akan masuk WC beliau mengucapkan: \"ALLAHUMMA INNI A'UUDZU BIKA (Ya Allah, sesungguhnya aku berlindung kepada-Mu).\" Syu'bah berkata; \"Dalam waktu lain beliau mengucapkan: \"A'UUDZU BIKA MINAL KHUBTSI WAL KHUBIIS (Aku berlindung kepada-Mu dari setan laki-laki dan setan perempuan) atau AL KHUBUTSI WAL KHABA`ITS (Aku berlindung kepada-Mu dari setan laki-laki dan setan perempuan).\" Abu Isa berkata; \"Dalam bab ini juga ada riwayat dari Ali, Zaid bin Arqam, Jabir dan Ibnu Mas'ud.\" Abu Isa berkata; \"Hadits Anas bin Isa adalah yang paling shahih dan paling baik dalam bab ini. Sedangkan dalam hadits Zaid bin Arqam dalam sanadnya ada kerancuan. Hadits ini juga diriwayatkan oleh Hisyam Ad Dastuwa`i dan Sa'id bin Abu Arubah dari Qatadah. Sa'id menyebutkan dari Al Qasim bin 'Auf Asy Syaibani dari Zaid bin Arqam. Dan Hisyam Ad Dastuwa`i dari Qatadah dari Zaid bin Arqam, sedang Syu'bah dan Ma'mar meriwayatkannya dari Qatadah dari An Nadlr bin Anas. Syu'bah menyebutkan dari Zaid bin Arqam. Ma'mar menyebutkan dari An Nadlr bin Anas dari bapaknya, dari Nabi Shallahu 'alaihi wa Sallam. Abu Isa berkata; \"Aku bertanya kepada Muhammad tentang riwayat tersebut, maka ia menjawab, \"Masih dimungkinkan bahwa Qatadah meriwayatkan dari keduanya.\"",
      "en": "Has told us [Qutaibah] and [Hannad] they said;Has told us [Waki '] from [Syu'bah] from [Abdul Aziz bin Shuhaib] from [Anas bin Malik] he said, the Prophet Shallahu' alaihi wa sallam if he was going to enter the toilet he said: \"Allahumma inni a'uudzu bika (yes Allah, in fact I take refuge in you).\"Syu'bah said;\"In another time he said:\" A'UUDZU BIKA MINAL KHUBTSI WAL KHUBIIS (I CONCERNED TO YOU FROM MU MALE AND DEATH SPIGHTS) or AL KHUBUTSI WAL KHABA`ITS (I CONTRACT TO YOUBin Isa is the most authentic and best in this chapter.Whereas in Zaid bin Arqam's hadith in his sanad there was confusion.This hadith is also narrated by Hisham Ad Dastuwa`i and Sa'id bin Abu Arubah from Qatadah.Sa'id mentioned from Al Qasim bin 'Auf Asy Syaibani from Zaid bin Arqam.And Hisham Ad Dastuwa`i from Qatadah from Zaid bin Arqam, while Syu'bah and Ma'mar narrated it from Qatadah from An Nadlr bin Anas.Syu'bah mentioned from Zaid bin Arqam.Ma'mar mentioned from An Nadlr bin Anas from his father, from the Prophet Shallahu 'Alaihi Wa Sallam.Abu Isa said;\"I asked Muhammad about the history, so he answered,\" It is still possible that Qatadah narrated from the two. \""
    }
  },
  {
    "id": "nasai-6",
    "book": "Nasai",
    "source": "HR. Nasai, No. 6",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ وَعِمْرَانُ بْنُ مُوسَى قَالَا حَدَّثَنَا عَبْدُ الْوَارِثِ قَالَ حَدَّثَنَا شُعَيْبُ بْنُ الْحَبْحَابِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَكْثَرْتُ عَلَيْكُمْ فِي السِّوَاكِ",
      "id": "Telah mengabarkan kepada kami [Humaid bin Mas'adah] dan ['Imran bin Musa] keduanya berkata; telah menceritakan kepada kami [Abdul Warits] berkata; telah menceritakan kepada kami [Syu'aib bin Habhab] dari [Anas bin Malik] dia berkata; bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku sering menganjurkan kalian banyak bersiwak.\"",
      "en": "Has reported to us [Humaid bin Mas'adah] and ['Imran bin Musa] both said;Having told us [Abdul Warits] said;Has told us [Syu'aib bin Habhab] from [Anas bin Malik] he said;that the Prophet sallallaahu 'alayhi wasallam said: \"I often encourage you to be a lot of appeal.\""
    }
  },
  {
    "id": "ibnu-majah-7",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 7",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو عَبْد اللَّهِ قَالَ حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ قَالَ حَدَّثَنَا أَبُو عَلْقَمَةَ نَصْرُ بْنُ عَلْقَمَةَ عَنْ عُمَيْرِ بْنِ الْأَسْوَدِ وَكَثِيرِ بْنِ مُرَّةَ الْحَضْرَمِيِّ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي قَوَّامَةً عَلَى أَمْرِ اللَّهِ لَا يَضُرُّهَا مَنْ خَالَفَهَا",
      "id": "Telah menceritakan kepada kami Abu Abdullah ia berkata; telah menceritakan kepada kami [Hisyam bin 'Ammar] ia berkata; telah menceritakan kepada kami [Yahya bin Hamzah] berkata; telah menceritakan kepada kami [Abu Alqamah Nashr bin Alqamah] dari [Umair Al Aswad] dan [Katsir bin Murrah Al Hadlrami] dari [Abu Hurairah] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Akan senantiasa ada sekelompok dari umatku yang tegar berdiri di atas perintah Allah, tidak akan membahayakan mereka orang yang menyelisihinya.\"",
      "en": "Has told us Abu Abdullah he said;Has told us [Hisham bin 'Ammar] he said;Has told us [Yahya bin Hamzah] said;Has told us [Abu Alqamah Nashr bin Alqamah] from [Umair Al Aswad] and [Katsir bin Murrah Al Hadlrami] from [Abu Hurairah] said;Rasulullah sallallaahu 'alayhi wasallam said: \"There will always be a group of my people who are tough standing on the command of Allah, will not endanger those people who exclude it.\""
    }
  },
  {
    "id": "bukhari-8",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 8",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الْجُعْفِيُّ قَالَ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلَالٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْإِيمَانُ بِضْعٌ وَسِتُّونَ شُعْبَةً وَالْحَيَاءُ شُعْبَةٌ مِنْ الْإِيمَانِ",
      "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad Al Ju'fi] dia berkata, Telah menceritakan kepada kami [Abu 'Amir Al 'Aqadi] yang berkata, bahwa Telah menceritakan kepada kami [Sulaiman bin Bilal] dari [Abdullah bin Dinar] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Iman memiliki lebih dari enam puluh cabang, dan malu adalah bagian dari iman\". ",
      "en": "Has told us [Abdullah bin Muhammad Al Ju'fi] he said, had told us [Abu 'Amir Al' Aqadi] who said that had told us [Sulaiman bin Bilal] from [Abdullah bin Dinar] from [Abu Shalih] from [Abu Hurairah] from the Prophet sallallaahu 'alayhi wasallam, he said"
    }
  },
  {
    "id": "muslim-9",
    "book": "Muslim",
    "source": "HR. Muslim, No. 9",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنِي أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا وَكِيعٌ عَنْ كَهْمَسٍ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ ح و حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ وَهَذَا حَدِيثُهُ حَدَّثَنَا أَبِي حَدَّثَنَا كَهْمَسٌ عَنْ ابْنِ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ قَالَ كَانَ أَوَّلَ مَنْ قَالَ فِي الْقَدَرِ بِالْبَصْرَةِ مَعْبَدٌ الْجُهَنِيُّ فَانْطَلَقْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَاجَّيْنِ أَوْ مُعْتَمِرَيْنِ فَقُلْنَا لَوْ لَقِينَا أَحَدًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْنَاهُ عَمَّا يَقُولُ هَؤُلَاءِ فِي الْقَدَرِ فَوُفِّقَ لَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ الْخَطَّابِ دَاخِلًا الْمَسْجِدَ فَاكْتَنَفْتُهُ أَنَا وَصَاحِبِي أَحَدُنَا عَنْ يَمِينِهِ وَالْآخَرُ عَنْ شِمَالِهِ فَظَنَنْتُ أَنَّ صَاحِبِي سَيَكِلُ الْكَلَامَ إِلَيَّ فَقُلْتُ أَبَا عَبْدِ الرَّحْمَنِ إِنَّهُ قَدْ ظَهَرَ قِبَلَنَا نَاسٌ يَقْرَءُونَ الْقُرْآنَ وَيَتَقَفَّرُونَ الْعِلْمَ وَذَكَرَ مِنْ شَأْنِهِمْ وَأَنَّهُمْ يَزْعُمُونَ أَنْ لَا قَدَرَ وَأَنَّ الْأَمْرَ أُنُفٌ قَالَ فَإِذَا لَقِيتَ أُولَئِكَ فَأَخْبِرْهُمْ أَنِّي بَرِيءٌ مِنْهُمْ وَأَنَّهُمْ بُرَآءُ مِنِّي وَالَّذِي يَحْلِفُ بِهِ عَبْدُ اللَّهِ بْنُ عُمَرَ لَوْ أَنَّ لِأَحَدِهِمْ مِثْلَ أُحُدٍ ذَهَبًا فَأَنْفَقَهُ مَا قَبِلَ اللَّهُ مِنْهُ حَتَّى يُؤْمِنَ بِالْقَدَرِثُمَّ قَالَ حَدَّثَنِي أَبِي عُمَرُ بْنُ الْخَطَّابِ قَالَ بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ شَدِيدُ سَوَادِ الشَّعَرِ لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ حَتَّى جَلَسَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ وَقَالَ يَا مُحَمَّدُ أَخْبِرْنِي عَنْ الْإِسْلَامِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ وَتَصُومَ رَمَضَانَ وَتَحُجَّ الْبَيْتَ إِنْ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا قَالَ صَدَقْتَ قَالَ فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ قَالَ فَأَخْبِرْنِي عَنْ الْإِيمَانِ قَالَ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ قَالَ صَدَقْتَ قَالَ فَأَخْبِرْنِي عَنْ الْإِحْسَانِ قَالَ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ قَالَ فَأَخْبِرْنِي عَنْ السَّاعَةِ قَالَ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ قَالَ فَأَخْبِرْنِي عَنْ أَمَارَتِهَا قَالَ أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ قَالَ ثُمَّ انْطَلَقَ فَلَبِثْتُ مَلِيًّا ثُمَّ قَالَ لِي يَا عُمَرُ أَتَدْرِي مَنْ السَّائِلُ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْحَدَّثَنِي مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ وَأَبُو كَامِلٍ الْجَحْدَرِيُّ وَأَحْمَدُ بْنُ عَبْدَةَ قَالُوا حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ مَطَرٍ الْوَرَّاقِ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ قَالَ لَمَّا تَكَلَّمَ مَعْبَدٌ بِمَا تَكَلَّمَ بِهِ فِي شَأْنِ الْقَدَرِ أَنْكَرْنَا ذَلِكَ قَالَ فَحَجَجْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَجَّةً وَسَاقُوا الْحَدِيثَ بِمَعْنَى حَدِيثِ كَهْمَسٍ وَإِسْنَادِهِ وَفِيهِ بَعْضُ زِيَادَةٍ وَنُقْصَانُ أَحْرُفٍ و حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا عُثْمَانُ بْنُ غِيَاثٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ وَحُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَا لَقِينَا عَبْدَ اللَّهِ بْنَ عُمَرَ فَذَكَرْنَا الْقَدَرَ وَمَا يَقُولُونَ فِيهِ فَاقْتَصَّ الْحَدِيثَ كَنَحْوِ حَدِيثِهِمْ عَنْ عُمَرَ رَضِيَ اللَّهُ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِيهِ شَيْءٌ مِنْ زِيَادَةٍ وَقَدْ نَقَصَ مِنْهُ شَيْئًا و حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ حَدَّثَنَا الْمُعْتَمِرُ عَنْ أَبِيهِ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِنَحْوِ حَدِيثِهِمْ",
      "id": "Telah menceritakan kepadaku [Abu Khaitsamah Zuhair bin Harb] telah menceritakan kepada kami [Waki'] dari [Kahmas] dari [Abdullah bin Buraidah] dari [Yahya bin Ya'mar]. (dalam riwayat lain disebutkan) Dan telah menceritakan kepada kami [Ubaidullah bin Mu'adz al-'Anbari] dan ini haditsnya, telah menceritakan kepada kami [Bapakku] telah menceritakan kepada kami [Kahmas] dari [Ibnu Buraidah] dari [Yahya bin Ya'mar] dia berkata, \"Orang yang pertama kali membahas takdir di Bashrah adalah Ma'bad al-Juhani, maka aku dan Humaid bin Abdurrahman al-Himyari bertolak haji atau umrah, maka kami berkata, 'Seandainya kami bertemu dengan salah seorang sahabat Rasulullah shallallahu 'alaihi wasallam, maka kami akan bertanya kepadanya tentang sesuatu yang mereka katakan berkaitan dengan takdir.' Maka [Abdullah bin Umar] diberikan taufik (oleh Allah) untuk kami, sedangkan dia masuk masjid. Lalu aku dan temanku menghadangnya. Salah seorang dari kami di sebelah kanannya dan yang lain di sebelah kirinya. Lalu aku mengira bahwa temanku akan mewakilkan pembicaraan kepadaku, maka aku berkata, 'Wahai Abu Abdurrahman, sesungguhnya nampak di hadapan kami suatu kaum membaca al-Qur'an dan mencari ilmu lalu mengklaim bahwa tidak ada takdir, dan perkaranya adalah baru (tidak didahului oleh takdir dan ilmu Allah).' Maka [Abdullah bin Umar] menjawab, 'Apabila kamu bertemu orang-orang tersebut, maka kabarkanlah kepada mereka bahwa saya berlepas diri dari mereka, dan bahwa mereka berlepas diri dariku. Dan demi Dzat yang mana hamba Allah bersumpah dengan-Nya, kalau seandainya salah seorang dari kalian menafkahkan emas seperti gunung Uhud, niscaya sedekahnya tidak akan diterima hingga dia beriman kepada takdir baik dan buruk.' Dia berkata, 'Kemudian dia mulai menceritakan hadits seraya berkata, ['Umar bin al-Khaththab] berkata, 'Dahulu kami pernah berada di sisi Rasulullah shallallahu 'alaihi wasallam, lalu datanglah seorang laki-laki yang bajunya sangat putih, rambutnya sangat hitam, tidak tampak padanya bekas-bekas perjalanan. Tidak seorang pun dari kami mengenalnya, hingga dia mendatangi Nabi Shallallahu 'Alaihi Wasalam lalu menyandarkan lututnya pada lutut Nabi Shallallahu 'Alaihi Wasalam, kemudian ia berkata, 'Wahai Muhammad, kabarkanlah kepadaku tentang Islam? ' Rasulullah Shallallahu 'Alaihi Wasalam menjawab: \"Kesaksian bahwa tidak ada tuhan (yang berhak disembah) selain Allah dan bahwa Muhammad adalah hamba dan utusan-Nya, mendirikan shalat, menunaikan zakat, dan puasa Ramadlan, serta haji ke Baitullah jika kamu mampu bepergian kepadanya.' Dia berkata, 'Kamu benar.' Umar berkata, 'Maka kami kaget terhadapnya karena dia menanyakannya dan membenarkannya.' Dia bertanya lagi, 'Kabarkanlah kepadaku tentang iman itu? ' Beliau menjawab: \"Kamu beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, para Rasul-Nya, hari akhir, dan takdir baik dan buruk.\" Dia berkata, 'Kamu benar.' Dia bertanya, 'Kabarkanlah kepadaku tentang ihsan itu? ' Beliau menjawab: \"Kamu menyembah Allah seakan-akan kamu melihat-Nya, maka jika kamu tidak melihat-Nya, maka sesungguhnya Dia melihatmu.\" Dia bertanya lagi, 'Kapankah hari akhir itu? ' Beliau menjawab: \"Tidaklah orang yang ditanya itu lebih mengetahui daripada orang yang bertanya.\" Dia bertanya, 'Lalu kabarkanlah kepadaku tentang tanda-tandanya? ' Beliau menjawab: \"Apabila seorang budak melahirkan (anak) tuan-Nya, dan kamu melihat orang yang tidak beralas kaki, telanjang, miskin, penggembala kambing, namun bermegah-megahan dalam membangun bangunan.\" Kemudian dia bertolak pergi. Maka aku tetap saja heran kemudian beliau berkata; \"Wahai Umar, apakah kamu tahu siapa penanya tersebut?\" Aku menjawab, 'Allah dan Rasul-Nya lebih tahu.' Beliau bersabda: \"Itulah jibril, dia mendatangi kalian untuk mengajarkan kepada kalian tentang pengetahuan agama kalian'.\" Telah menceritakan kepada kami [Muhammad bin Ubaid al-Ghubari] dan [Abu Kamil al-Jahdari] serta [Ahmad bin Abdah] mereka berkata, telah menceritakan kepada kami [Hammad bin Yazid] dari [Mathar al Warraq] dari [Abdullah bin Buraidah] dari [Yahya bin Ya'mar] dia berkata, 'Ketika Ma'bad berkata dengan sesuatu yang dia bicarakan tentang masalah takdir, maka kami mengingkari hal tersebut.' Dia berkata lagi, 'Lalu aku melakukan haji bersama Humaid bin Abdurrahman al-Himyari.' Lalu mereka menyebutkan hadits dengan makna hadits Kahmas. Di dalamnya terdapat sebagian tambahan dan kekurangan huruf.\" Dan telah menceritakan kepada kami [Muhammad bin Hatim] telah menceritakan kepada kami [Yahya bin Sa'id al Qaththan] telah menceritakan kepada kami [Utsman bin Ghiyats] telah menceritakan kepada kami [Abdullah bin Buraidah] dari [Yahya bin Ya'mar] dan [Humaid bin Abdurrahman] keduanya berkata, \"Kami bertemu [Abdullah bin Umar], lalu kami menyebutkan tentang takdir dan pendapat mereka tentangnya, lalu dia mengisahkan hadits tersebut sebagaimana hadits mereka dari [Umar] radlialllahu 'anhuma dari Nabi shallallahu 'alaihi wasallam, dan di dalamnya terdapat suatu tambahan dan pengurangan.\" Dan telah menceritakan kepada kami [Hajjaj bin asy-Sya'ir] telah menceritakan kepada kami [Yunus bin Muhammad] telah menceritakan kepada kami [al-Mu'tamir] dari [Bapaknya] dari [Yahya bin Ya'mar] dari [Ibnu Umar] dari [Umar] dari Nabi shallallahu 'alaihi wasallam dengan semisal hadits mereka.\"",
      "en": "[Translation needed: Telah menceritakan kepadaku [A...]"
    }
  },
  {
    "id": "abu-daud-10",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 10",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ فَارِسٍ حَدَّثَنَا صَفْوَانُ بْنُ عِيسَى عَنْ الْحَسَنِ بْنِ ذَكْوَانَ عَنْ مَرْوَانَ الْأَصْفَرِ قَالَرَأَيْتُ ابْنَ عُمَرَ أَنَاخَ رَاحِلَتَهُ مُسْتَقْبِلَ الْقِبْلَةِ ثُمَّ جَلَسَ يَبُولُ إِلَيْهَا فَقُلْتُ يَا أَبَا عَبْدِ الرَّحْمَنِ أَلَيْسَ قَدْ نُهِيَ عَنْ هَذَا قَالَ بَلَى إِنَّمَا نُهِيَ عَنْ ذَلِكَ فِي الْفَضَاءِ فَإِذَا كَانَ بَيْنَكَ وَبَيْنَ الْقِبْلَةِ شَيْءٌ يَسْتُرُكَ فَلَا بَأْسَ",
      "id": "Telah menceritakan kepada kami [Muhammad bin Yahya bin Faris] telah menceritakan kepada kami [Shafwan bin Isa] dari [Al Hasan bin Dzakwan] dari [Marwan Al Ashfar] dia berkata; Saya pernah melihat [Ibnu Umar] menderumkan untanya menghadap kiblat, lalu dia duduk dan buang air kecil dalam keadaan menghadapnya, lalu saya bertanya; \"wahai Abu Abdurrahman, bukankah hal ini telah dilarang?\" Dia menjawab; \"Benar, akan tetapi hal itu dilarang jika dilakukan di tempat terbuka, apabila antara dirimu dan kiblat ada sesuatu yang menutupimu, maka itu tidaklah mengapa.\"",
      "en": "Having told us [Muhammad bin Yahya bin Faris] had told us [Shafwan bin Isa] from [Al Hasan bin Dzakwan] from [Marwan Al Ashfar] he said;I have seen [Ibn Umar] to run the straw facing the Qibla, then he sat and urinated in a state facing him, then I asked;\"O Abu Abdurrahman, isn't this forbidden?\"He answered;\"Right, but it is prohibited if done in the open, if between you and the Qibla there is something that covers you, then that is not why.\""
    }
  },
  {
    "id": "tirmidzi-11",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 11",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ عَنْ عَمِّهِ وَاسِعِ بْنِ حَبَّانَ عَنْ ابْنِ عُمَرَ قَالَرَقِيتُ يَوْمًا عَلَى بَيْتِ حَفْصَةَ فَرَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى حَاجَتِهِ مُسْتَقْبِلَ الشَّامِ مُسْتَدْبِرَ الْكَعْبَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
      "id": "telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Ubaidullah bin Umar] dari [Muhammad bin Yahya bin Habban] dari pamannya - [Wasi' bin Habban] - dari [Ibnu Umar] ia berkata; \"Suatu hari aku naik ke loteng rumah Hafshah, lalu aku melihat Nabi Shallahu 'alaihi wa Sallam sedang membuang hajat sambil menghadap arah Syam dengan membelakangi Ka'bah.\" Abu Isa berkata; \"Hadits ini derajatnya adalah hasan shahih.\"",
      "en": "Having told us [Hannad] said, had told us [Abdah bin Sulaiman] from [Ubaidullah bin Umar] from [Muhammad bin Yahya bin Habban] from his uncle - [Wasi 'bin Habban] - from [Ibn Umar] he said;\"One day I climbed into the attic of Hafshah's house, then I saw the Prophet Shallahu 'Alaihi wa Sallam was defecating while facing the direction of Sham with his back to the Kaaba.\"Abu Isa said;\"This degree is Hasan Sahih.\""
    }
  },
  {
    "id": "nasai-12",
    "book": "Nasai",
    "source": "HR. Nasai, No. 12",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ عَنْ ابْنِ وَهْبٍ عَنْ حَنْظَلَةَ بْنِ أَبِي سُفْيَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْفِطْرَةُ قَصُّ الْأَظْفَارِ وَأَخْذُ الشَّارِبِ وَحَلْقُ الْعَانَةِ",
      "id": "Telah mengabarkan kepada kami [Harits bin Miskin] telah dibacakan kepadanya dan saya mendengar dari [Ibnu Wahb] dari [Handzalah bin Abu Sufyan] dari [Nafi'] dari [Ibnu Umar] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Termasuk fitrah adalah memotong kuku, memotong kumis, dan mencukur bulu kemaluan.\" ",
      "en": "Has reported to us [Harits Bin Poor] had been read to him and I heard from [Ibn Wahb] from [Handzalah bin Abu Sufyan] from [Nafi '] from [Ibn Umar] that the Prophet sallallaahu' alaihi wasallam said: \"Including fitrah is cutting nails, cutting off a mustache, and shaving pubic hair.\""
    }
  },
  {
    "id": "ibnu-majah-13",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 13",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ فِي بَيْتِهِ أَنَا سَأَلْتُهُ عَنْ سَالِمٍ أَبِي النَّضْرِ ثُمَّ مَرَّ فِي الْحَدِيثِ قَالَ أَوْ زَيْدِ بْنِ أَسْلَمَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا أُلْفِيَنَّ أَحَدَكُمْ مُتَّكِئًا عَلَى أَرِيكَتِهِ يَأْتِيهِ الْأَمْرُ مِمَّا أَمَرْتُ بِهِ أَوْ نَهَيْتُ عَنْهُ فَيَقُولُ لَا أَدْرِي مَا وَجَدْنَا فِي كِتَابِ اللَّهِ اتَّبَعْنَاهُ",
      "id": "Telah menceritakan kepada kami [Nashr bin Ali Al Jahdlami] berkata, telah menceritakan kepada kami [Sufyan bin Uyainah] -aku bertanya kepadanya di rumahnya- dari [Salim Abu Al Nadlr] -kemudian ia membaca sebuah hadits-, ia berkata; atau [Zaid bin Aslam] dari [Ubaidullah bin Abu Rafi'] dari [Bapaknya] berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sungguh, salah seorang dari kalian akan ditemui dalam keadaan duduk bersandaran di tempat duduknya, lalu datang kepadanya perintah dan laranganku, namun ia berkata; 'Aku tidak mengetahui, apa yang kami jumpai dalam kitabullah, maka kami mengikutinya.'\"",
      "en": "Having told us [Nashr bin Ali Al Jahdlami] said, had told us [Sufyan bin Uyainah] -I I asked him at his home -from [Salim Abu Al Nadlr] -then he read a hadith -, he said;or [Zaid bin Aslam] from [Ubaidullah bin Abu Rafi '] from [his father] said;Rasulullah sallallaahu 'alayhi wasallam said: \"Really, one of you will be found in a state of sitting on his seat, then come to him commands and prohibitions, but he said;' I do not know, what we encountered in the book, then we followed him.\""
    }
  },
  {
    "id": "bukhari-14",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 14",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ قَالَ حَدَّثَنَا ابْنُ عُلَيَّةَ عَنْ عَبْدِ الْعَزِيزِ بْنِ صُهَيْبٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ح و حَدَّثَنَا آدَمُ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَالِدِهِ وَوَلَدِهِ وَالنَّاسِ أَجْمَعِينَ",
      "id": "Telah menceritakan kepada kami [Ya'qub bin Ibrahim] berkata, telah menceritakan kepada kami [Ibnu 'Ulayyah] dari [Abdul 'Aziz bin Shuhaib] dari [Anas] dari Nabi shallallahu 'alaihi wasallam Dan telah menceritakan pula kepada kami [Adam] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qotadah] dari [Anas] berkata, Nabi shallallahu 'alaihi wasallam bersabda: \"Tidaklah beriman seorang dari kalian hingga aku lebih dicintainya daripada orang tuanya, anaknya dan dari manusia seluruhnya\". ",
      "en": "Has told us [Ya'qub bin Ibrahim] said, had told us [Ibnu 'Ulayyah] from [Abdul' Aziz bin Shuhaib] from [Anas] from the Prophet sallallaahu 'alayhi wasallam and had told us [Adam] said, had told us [Syu'bah] from [Qotadah] from [Anas]One of you until I love him more than his parents, his son and from his whole human \"."
    }
  },
  {
    "id": "muslim-15",
    "book": "Muslim",
    "source": "HR. Muslim, No. 15",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ أَخْبَرَنَا أَبُو الْأَحْوَصِ ح و حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِي أَيُّوبَ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ دُلَّنِي عَلَى عَمَلٍ أَعْمَلُهُ يُدْنِينِي مِنْ الْجَنَّةِ وَيُبَاعِدُنِي مِنْ النَّارِ قَالَ تَعْبُدُ اللَّهَ لَا تُشْرِكُ بِهِ شَيْئًا وَتُقِيمُ الصَّلَاةَ وَتُؤْتِي الزَّكَاةَ وَتَصِلُ ذَا رَحِمِكَ فَلَمَّا أَدْبَرَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ تَمَسَّكَ بِمَا أُمِرَ بِهِ دَخَلَ الْجَنَّةَوَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ إِنْ تَمَسَّكَ بِهِ",
      "id": "Telah menceritakan kepada kami [Yahya bin Yahya at-Tamimi] telah mengabarkan kepada kami [Abu al-Ahwash]. (dalam riwayat lain disebutkan) Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu al-Ahwash] dari [Abu Ishaq] dari [Musa bin Thalhah] dari [Abu Ayyub] dia berkata, \"Seorang laki-laki mendatangi Nabi shallallahu 'alaihi wasallam, seraya bertanya, 'Tunjukkanlah kepadaku suatu amalan yang mendekatkanku dari surga dan menjauhkanku dari neraka? ' Beliau menjawab: 'Kamu menyembah Allah, tidak mensyirikkan-Nya dengan sesuatu apa pun, mendirikan shalat, menunaikan zakat, menyambung silaturrahim dengan keluarga.\" Ketika dia pamit maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Jika dia berpegang teguh pada sesuatu yang diperintahkan kepadanya niscaya dia masuk surga'.\" Dan dalam suatu riwayat  [Ibnu Abu Syaibah], \"Jika dia berpegang teguh dengannya.\"",
      "en": "Having told us [Yahya bin Yahya At-Tamimi] had reported us [Abu Al-Ahwash].(in another narration mentioned) and has told us [Abu Bakar bin Abu Syaibah] has told us [Abu Al-Ahwash] from [Abu Ishaq] from [Musa bin Talhah] from [Abu Ayyub] he said, \"A man came to the Prophet sallallaahu 'alaihi wasallam, while asking,\" show meWorshiping God, not symbolizing Him with anything, establishing prayer, performing zakat, connecting silaturrahim with family. \"When he said goodbye, the Prophet sallallaahu 'alaihi wasallam said: \"If he holds fast to something that is ordered to him surely he enters heaven'.\"And in a history [Ibn Abu Syaibah], \"If he holds fast to him.\""
    }
  },
  {
    "id": "abu-daud-16",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 16",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الْأَعْلَى حَدَّثَنَا سَعِيدٌ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ حُضَيْنِ بْنِ الْمُنْذِرِ أَبِي سَاسَانَ عَنْ الْمُهَاجِرِ بْنِ قُنْفُذٍ أَنَّهُأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ فَسَلَّمَ عَلَيْهِ فَلَمْ يَرُدَّ عَلَيْهِ حَتَّى تَوَضَّأَ ثُمَّ اعْتَذَرَ إِلَيْهِ فَقَالَ إِنِّي كَرِهْتُ أَنْ أَذْكُرَ اللَّهَ عَزَّ وَجَلَّ إِلَّا عَلَى طُهْرٍ أَوْ قَالَ عَلَى طَهَارَةٍ",
      "id": "Telah menceritakan kepada kami [Muhammad bin al Mutsanna] telah menceritakan kepada kami [Abdul A'la] telah menceritakan kepada kami [Sa'id] dari [Qatadah] dari [Al Hasan] dari [Hudhain bin Al Mundzir Abi Sasan] dari [Al Muhajir bin Qunfudz] Bahwasanya dia pernah menemui Nabi shallallahu 'alaihi wasallam ketika beliau sedang buang air kecil, lalu dia mengucapkan salam kepada Nabi, namun beliau tidak menjawab salamnya hingga berwudhu, kemudian beliau meminta maaf seraya bersabda: \"Sesungguhnya aku tidak suka menyebut Nama Allah Ta'ala kecuali dalam keadaan suci.\"",
      "en": "Has told us [Muhammad bin Al Mutsanna] had told us [Abdul A'la] had told us [Sa'id] from [Qatadah] from [Al Hasan] from [Hudhain bin Al Mundzir Abi Sasan] from [Al Muhajir bin Qunfudz] that he had met the Prophet.ablution, then he apologized as he said: \"Indeed, I do not like to mention the name of Allah Ta'ala except in a holy state.\""
    }
  },
  {
    "id": "tirmidzi-17",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 17",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا هَنَّادٌ وَقُتَيْبَةُ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ قَالَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَتِهِ فَقَالَ الْتَمِسْ لِي ثَلَاثَةَ أَحْجَارٍ قَالَ فَأَتَيْتُهُ بِحَجَرَيْنِ وَرَوْثَةٍ فَأَخَذَ الْحَجَرَيْنِ وَأَلْقَى الرَّوْثَةَ وَقَالَ إِنَّهَا رِكْسٌقَالَ أَبُو عِيسَى وَهَكَذَا رَوَى قَيْسُ بْنُ الرَّبِيعِ هَذَا الْحَدِيثَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ نَحْوَ حَدِيثِ إِسْرَائِيلَ وَرَوَى مَعْمَرٌ وَعَمَّارُ بْنُ رُزَيْقٍ عَنْ أَبِي إِسْحَقَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ وَرَوَى زُهَيْرٌ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ وَرَوَى زَكَرِيَّا بْنُ أَبِي زَائِدَةَ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ عَنْ عَبْدِ اللَّهِ وَهَذَا حَدِيثٌ فِيهِ اضْطِرَابٌ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ الْعَبْدِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ قَالَ سَأَلْتُ أَبَا عُبَيْدَةَ بْنَ عَبْدِ اللَّهِ هَلْ تَذْكُرُ مِنْ عَبْدِ اللَّهِ شَيْئًا قَالَ لَا قَالَ أَبُو عِيسَى سَأَلْتُ عَبْدَ اللَّهِ بْنَ عَبْدِ الرَّحْمَنِ أَيُّ الرِّوَايَاتِ فِي هَذَا الْحَدِيثِ عَنْ أَبِي إِسْحَقَ أَصَحُّ فَلَمْ يَقْضِ فِيهِ بِشَيْءٍ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا فَلَمْ يَقْضِ فِيهِ بِشَيْءٍ وَكَأَنَّهُ رَأَى حَدِيثَ زُهَيْرٍ عَنْ أَبِي إِسْحَقَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْأَسْوَدِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ أَشْبَهَ وَوَضَعَهُ فِي كِتَابِ الْجَامِعِ قَالَ أَبُو عِيسَى وَأَصَحُّ شَيْءٍ فِي هَذَا عِنْدِي حَدِيثُ إِسْرَائِيلَ وَقَيْسٍ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي عُبَيْدَةَ عَنْ عَبْدِ اللَّهِ لِأَنَّ إِسْرَائِيلَ أَثْبَتُ وَأَحْفَظُ لِحَدِيثِ أَبِي إِسْحَقَ مِنْ هَؤُلَاءِ وَتَابَعَهُ عَلَى ذَلِكَ قَيْسُ بْنُ الرَّبِيعِ قَالَ أَبُو عِيسَى و سَمِعْت أَبَا مُوسَى مُحَمَّدَ بْنَ الْمُثَنَّى يَقُولُ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ مَهْدِيٍّ يَقُولُ مَا فَاتَنِي الَّذِي فَاتَنِي مِنْ حَدِيثِ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي إِسْحَقَ إِلَّا لِمَا اتَّكَلْتُ بِهِ عَلَى إِسْرَائِيلَ لِأَنَّهُ كَانَ يَأْتِي بِهِ أَتَمَّ قَالَ أَبُو عِيسَى وَزُهَيْرٌ فِي أَبِي إِسْحَقَ لَيْسَ بِذَاكَ لِأَنَّ سَمَاعَهُ مِنْهُ بِآخِرَةٍ قَالَ و سَمِعْت أَحْمَدَ بْنَ الْحَسَنِ التِّرْمِذِيَّ يَقُولُ سَمِعْتُ أَحْمَدَ بْنَ حَنْبَلٍ يَقُولُ إِذَا سَمِعْتَ الْحَدِيثَ عَنْ زَائِدَةَ وَزُهَيْرٍ فَلَا تُبَالِي أَنْ لَا تَسْمَعَهُ مِنْ غَيْرِهِمَا إِلَّا حَدِيثَ أَبِي إِسْحَقَ وَأَبُو إِسْحَقَ اسْمُهُ عَمْرُو بْنُ عَبْدِ اللَّهِ السَّبِيعِيُّ الْهَمْدَانِيُّ وَأَبُو عُبَيْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ لَمْ يَسْمَعْ مِنْ أَبِيهِ وَلَا يُعْرَفُ اسْمُهُ",
      "id": "telah menceritakan kepada kami [Hannad] dan [Qutaibah] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Isra'il] dari [Abu Ishaq] dari [Abu Ubaidah] dari [Abdullah] ia berkata, Nabi Shallahu 'alaihi wa Sallam keluar untuk buang hajat, beliau lalu bersabda: \" Carikanlah tiga buah batu untukku, \" Abu Ubaid berkata; \"Maka aku pun membawakan beliau dua batu dan satu kotoran binatang yang telah kering, beliau hanya mengambil dua batu dan melemparkan kotoran binatang tersebut kemudian bersabda: \"Sesungguhnya kotoran binatang itu najis.\" Abu Isa berkata; \"Seperti inilah [Qais bin Ar Rabi'] meriwayatkan hadits ini dari [Abu Ishaq], dari [Abu Ubaidah], dari [Abdullah] sebagaimana hadits riwayat Israil. [Ma'mar] dan ['Ammar bin Ruzaiq] juga meriwayatkan dari [Abu Ishaq], dari [Alqamah], dari [Abdullah]. [Zuhair] meriwayatkan dari [Abu Ishaq], dari [Abdurrahman Ibnul Aswad], dari bapaknya - [Al Aswad bin Yazid] -, dari [Abdullah]. Namun hadits ini ada kekacauan di dalamnya. Telah menceritakan kepada kami Muhammad bin Basysyar Al Abdi berkata, telah menceritakan kepada kami Muhammad bin Ja'far berkata, telah menceritakan kepada kami Syu'bah dari 'Amru bin Murrah ia berkata; \"Apakah engkau mengingat sesuatu dari Abdullah?\" ia menjawab, \"Tidak.\" Abu Isa berkata; \"Aku bertanya kepada Abdullah bin Abdurrahman; riwayat manakah yang paling shahih dalam hadits Abu Ishaq ini?\" namun ia tidak menjawab dengan sesuatu pun. Dan aku juga bertanya kepada Muhammad, namun ia juga tidak memberikan menjawab apapun.\" Seakan-akan ia melihat bahwa hadits Zuhair dari Abu Ishaq, dari Abdurrahman Ibnul Aswad, dari bapaknya, dari Abdullah mempunyai kemiripan, lalu ia meletakkannya dalam kitab Al Jami'.\" Abu Isa berkata; \"Dalam bab ini menurutku yang paling shahih adalah hadits Israil dan Qais dari Abu Ishaq, dari Abu Ubaidah, dari Abdullah. Sebab Israil adalah seorang yang lebih kuat dan hafal dengan hadits Abu Ishaq dari yang lainnya. Hal itu diperkuat oleh Qais bin Ar Rabi'.\" Abu Isa berkata; \"Aku mendengar Abu Musa Muhammad Ibnul Mutsanna berkata; aku mendengar Abdurrahman bin Mahdi berkata; \"Tidaklah hilang dariku sebagaimana hilang dariku dari hadits Sufyan Ats Tsauri, dari Abu Ishaq kecuali sesuatu yang aku pegang atas Israil, karena ia meriwayatkan dengan sesuatu yang lebih sempurna.\" Abu Isa berkata; \"Riwayat Zuhair dari Abu Ishaq tidaklah demikian, karena ia mendengarnya disaat-saat akhir.\" Ia berkata; \"Aku mendengar Ahmad Ibnul Hasan At Turmudzi berkata; \"Aku mendengar Ahmad bin Hanbal mengatakan; \"Apabila engkau mendengar hadits dari Za`idah dan Zuhair maka mantaplah, meskipun engkau tidak mendengarnya dari yang lain, kecuali hadits dari Abu Ishaq, sedang Abu Ishaq namanya adalah 'Amru bin Abdullah As Sabi'i Al Hamdani, dan Abu Ubaidah bin Abdullah bin Mas'ud tidak mendengar dari bapaknya, dan namanya juga tidak dikenal.\"",
      "en": "Has told us [Hannad] and [Qutaibah] both of them said;Has told us [Waki '] from [Isra'il] from [Abu Ishaq] from [Abu Ubaidah] from [Abdullah] he said, the Prophet Shallahu' alaihi wa sallam came out to defecate, he then said: \"Look three stones for me,\" Abu Ubaid said;\"So I brought him two stones and one dry animal dirt, he only took two stones and threw the animal dirt and then said:\" Indeed, the animal dirt is unclean. \"Abu Isa said;\" This is [Qais bin Ar Rabi '] narrated this hadith from [Abu Ishaq], from [Abu Ubaidah], from [Abdullah] like the hadith of the issue.[Ma'mar] and ['Ammar bin Ruzaiq] also narrated from [Abu Ishaq], from [Alqamah], from [Abdullah].[Zuhair] narrated from [Abu Ishaq], from [Abdurrahman Ibnul Aswad], from his father - [Al Aswad bin Yazid] -, from [Abdullah].But this hadith has a chaos in it.Has told us Muhammad bin Basysyar Al Abdi said, having told us Muhammad bin Ja'far said, having told us Syu'bah from 'Amru bin Murrah he said;\"Do you remember something from Abdullah?\"He replied, \"No.\"Abu Isa said;\"I asked Abdullah bin Abdurrahman; which history is the most authentic in this Hadith Abu Ishaq?\"But he didn't answer with something.And I also asked Muhammad, but he also did not give anything. \"As if he saw that Zuhair's hadith from Abu Ishaq, from Abdurrahman Ibnul Aswad, from his father, from Abdullah had similarities, then he put it in the book of Al Jami '.\"Abu Isa said;\"In this chapter, in my opinion the most authentic is the hadith of Israel and Qais from Abu Ishaq, from Abu Ubaidah, from Abdullah. Because Israel is a stronger and more memorized person with Abu Ishaq's hadith from the others. It was strengthened by Qais bin Ar Rabi '.\"Abu Isa said;\"I heard Abu Musa Muhammad Ibnul Mutsanna said; I heard Abdurrahman bin Mahdi said;\" It was not lost from me as lost from me from the hadith of Sufyan Ats Tsauri, from Abu Ishaq except something I was holding on Israel, because he narrated with something more perfect. \"Abu Isa said;\"said; \"I heard Ahmad Ibnul Hasan at Turmudzi said;\"I heard Ahmad bin Hanbal saying;\" If you hear the hadith from Za`idah and Zuhair then it is great, even though you do not hear it from the others, except the hadith from Abu Ishaq, while Abu Ishaq is the name 'Amru bin Abdullah as Sabi'i Al Hamdani, and Abu Ubaidah bin Abdullah bin Mas'ud did not hear from his father, and his name was also not known."
    }
  },
  {
    "id": "nasai-18",
    "book": "Nasai",
    "source": "HR. Nasai, No. 18",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ أَنْبَأَنَا عِيسَى بْنُ يُونُسَ قَالَ أَنْبَأَنَا الْأَعْمَشُ عَنْ شَقِيقٍ عَنْ حُذَيْفَةَ قَالَكُنْتُ أَمْشِي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْتَهَى إِلَى سُبَاطَةِ قَوْمٍ فَبَالَ قَائِمًا فَتَنَحَّيْتُ عَنْهُ فَدَعَانِي وَكُنْتُ عِنْدَ عَقِبَيْهِ حَتَّى فَرَغَ ثُمَّ تَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ",
      "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dia berkata; Telah memberitakan kepada kami [Isa bin Yunus] berkata; Telah memberitakan kepada kami [Al A'masy] dari [Syaqiq] dari [Hudzaifah] dia berkata: \"Aku pernah berjalan bersama Rasulullah shallallahu 'alaihi wasallam. Ketika sampai di tempat pembuangan sampah suatu kaum, beliau kencing sambil berdiri, maka aku segera menjauh darinya. Beliau kemudian memanggilku, dan aku di belakangnya hingga beliau selesai. Beliau lalu berwudlu dan mengusap kedua sepatunya (khuf).\"",
      "en": "Has reported to us [Ishaq bin Ibrahim] he said;Having reported us [Isa bin Yunus] said;Has reported to us [Al A'masy] from [Syaqiq] from [Hudzaifah] he said: \"I once walked with the Prophet sallallaahu 'alaihi wasallam. When he arrived at the landfill of a people, he peed while standing, then I immediately moved away from him. He then called me, and I was behind him until he was finished."
    }
  },
  {
    "id": "ibnu-majah-19",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 19",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ الْخَلَّادِ الْبَاهِلِيُّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ ابْنِ عَجْلَانَ أَنْبَأَنَا عَوْنُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَإِذَا حَدَّثْتُكُمْ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَظُنُّوا بِرَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّذِي هُوَ أَهْنَاهُ وَأَهْدَاهُ وَأَتْقَاهُ",
      "id": "Telah menceritakan kepada kami [Abu Bakr bin Al Khallad Al Bahili] berkata, telah menceritakan kepada kami [Yahya bin Sa'id] dari [Ibnu 'Ajlan] berkata, telah memberitahukan kepada kami ['Aun bin Abdullah] dari [Abdullah bin Mas'ud] ia berkata; \" Jika aku bacakan kepada kalian sebuah hadits dari Rasulullah, maka anggaplah bahwa Rasulullah yang menyampaikannya, dia yang memberi petunjuk dan dia yang berwasiat takwa.\"",
      "en": "Has told us [Abu Bakr bin Al Khalrad Al Bahili] said, had told us [Yahya bin Sa'id] from [Ibnu 'Ajlan] said, had told us [' Aun bin Abdullah] from [Abdullah bin Mas'ud] he said;\"If I read to you a hadith from the Messenger of Allah, then assume that the Messenger of Allah delivered it, he gave instructions and he was a piety.\""
    }
  },
  {
    "id": "bukhari-20",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 20",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثٌ مَنْ كُنَّ فِيهِ وَجَدَ حَلَاوَةَ الْإِيمَانِ مَنْ كَانَ اللَّهُ وَرَسُولُهُ أَحَبَّ إِلَيْهِ مِمَّا سِوَاهُمَا وَمَنْ أَحَبَّ عَبْدًا لَا يُحِبُّهُ إِلَّا لِلَّهِ عَزَّ وَجَلَّ وَمَنْ يَكْرَهُ أَنْ يَعُودَ فِي الْكُفْرِ بَعْدَ إِذْ أَنْقَذَهُ اللَّهُ مِنْهُ كَمَا يَكْرَهُ أَنْ يُلْقَى فِي النَّارِ",
      "id": "Telah menceritakan kepada kami [Sulaiman bin Harb] berkata, telah menceritakan kepada kami [Syu'bah] dari [Qotadah] dari [Anas bin Malik] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tiga (perkara) yang apabila ada pada diri seseorang, ia akan mendapatkan manisnya iman: Allah dan Rasul-Nya lebih dicintainya dari selain keduanya. Dan siapa yang bila mencintai seseorang, dia tidak mencintai orang itu kecuali karena Allah 'azza wajalla. Dan siapa yang benci kembali kepada kekufuran seperti dia benci bila dilempar ke neraka\". ",
      "en": "Has told us [Sulaiman bin Harb] said, had told us [Syu'bah] from [Qotadah] from [Anas bin Malik] from the Prophet sallallaahu 'alaihi wasallam, he said: \"Three (cases) which if there is in a person, he will get the sweetness of faith: Allah and His MessengerHate back to kufr like he hates when thrown into hell \"."
    }
  },
  {
    "id": "muslim-21",
    "book": "Muslim",
    "source": "HR. Muslim, No. 21",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي حَدَّثَنَا عَاصِمٌ وَهُوَ ابْنُ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَ قَالَ عَبْدُ اللَّهِقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ وَإِقَامِ الصَّلَاةِ وَإِيتَاءِ الزَّكَاةِ وَحَجِّ الْبَيْتِ وَصَوْمِ رَمَضَانَ",
      "id": "Telah menceritakan kepada kami [Ubaidullah bin Mu'adz] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Ashim] -yaitu Ibnu Muhammad bin Zaid bin Abdullah bin Umar- dari [bapaknya] dia berkata; [Abdullah] berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Islam dibangun atas lima dasar: Yaitu persaksian bahwa tidak ada tuhan (yang berhak disembah) melainkan Allah, bahwa Muhammad adalah hamba dan Rasul-Nya, mendirikan shalat, menunaikan zakat, berhaji ke Baitullah, dan berpuasa Ramadlan.\"",
      "en": "Has told us [Ubaidullah bin Mu'adz] Has told us [my father] had told us [Ashim] - that is, Ibn Muhammad bin Zaid bin Abdullah bin Umar - from [his father] he said;[Abdullah] said, \"Rasulullah sallallaahu 'alaihi wasallam said:\" Islam was built on the five basis: namely the testimony that there is no God (who has the right to be worshiped) but Allah, that Muhammad is His servant and His Messenger, establishing prayer, performing zakat, pilgrimage to Baitullah, and fasting in Ramadan. \""
    }
  },
  {
    "id": "abu-daud-22",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 22",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا حَجَّاجٌ عَنْ ابْنِ جُرَيْجٍ عَنْ حُكَيْمَةَ بِنْتِ أُمَيْمَةَ بِنْتِ رُقَيْقَةَ عَنْ أُمِّهَا أَنَّهَا قَالَتْكَانَ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدَحٌ مِنْ عِيدَانٍ تَحْتَ سَرِيرِهِ يَبُولُ فِيهِ بِاللَّيْلِ",
      "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami [Hajjaj] dari [Ibnu Juraij] dari [Hukaimah binti Umaimah binti Ruqaiqah] dari [Ibunya] bahwasanya dia berkata; Nabi shallallahu 'alaihi wasallam memiliki bejana dari pelepah kurma (yang beliau letakkan) di bawah ranjangnya, yang beliau gunakan untuk buang air kecil pada waktu malam hari. ",
      "en": "Having told us [Muhammad bin Isa] had told us [Hajjajar] from [Ibn Juraj] from [Hukaimah binti Umaimah bint Ruqaiqah] from [his mother] that he said;Prophet sallallaahu 'alayhi wasallam has a vessel from the palm fronds (which he put) under his bed, which he used to urinate at night."
    }
  },
  {
    "id": "tirmidzi-23",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 23",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ عِنْدَ كُلِّ صَلَاةٍ وَلَأَخَّرْتُ صَلَاةَ الْعِشَاءِ إِلَى ثُلُثِ اللَّيْلِقَالَ فَكَانَ زَيْدُ بْنُ خَالِدٍ يَشْهَدُ الصَّلَوَاتِ فِي الْمَسْجِدِ وَسِوَاكُهُ عَلَى أُذُنِهِ مَوْضِعَ الْقَلَمِ مِنْ أُذُنِ الْكَاتِبِ لَا يَقُومُ إِلَى الصَّلَاةِ إِلَّا أُسْتَنَّ ثُمَّ رَدَّهُ إِلَى مَوْضِعِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
      "id": "telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Muhammad bin Ishaq] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Zaid bin Khalid Al Juhani] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Seandainya tidak memberatkan ummatku niscaya aku akan perintahkan mereka bersiwak setiap kali akan shalat, dan aku juga akan akhirkan shalat Isya hingga sepertiga malam.\" Ia berkata; \"Zaid bin Khalid menghadiri shalat di masjid, sementara siwaknya berada di telinganya seperti pena yang selalu berada di telinga seorang penulis, ia tidak bangkit menegakkan shalat hingga ia melakukan siwak terlebih dahulu. Setelah itu ia meletakkannya kembali pada tempatnya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih.\"",
      "en": "Having told us [Hannad] said, had told us [Abdah bin Sulaiman] from [Muhammad bin Ishaq] from [Muhammad bin Ibrahim] from [Abu Salamah] from [Zaid bin Khalid Al Juhani] he said;I heard the Prophet sallallaahu 'alaihi wasallam said: \"If it is not burdensome for my people, surely I will order them to be convicted every time I pray, and I will also end the evening prayer for a third of the night.\"He said;\"Zaid bin Khalid attended the prayer at the mosque, while his siw was in his ear like a pen who was always in the ears of a writer, he did not rise to uphold the prayer until he did siwak first. After that he put it back in his place.\"Abu Isa said;\"This hadith is the degree of Hasan Sahih.\""
    }
  },
  {
    "id": "nasai-24",
    "book": "Nasai",
    "source": "HR. Nasai, No. 24",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ قَالَ أَنْبَأَنَا أَبُو إِسْمَعِيلَ وَهُوَ الْقَنَّادُ قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي قَتَادَةَ حَدَّثَهُ عَنْ أَبِيهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا بَالَ أَحَدُكُمْ فَلَا يَأْخُذْ ذَكَرَهُ بِيَمِينِهِ",
      "id": "Telah mengabarkan kepada kami [Yahya bin Durusta] dia berkata; Telah memberitakan kepada kami [Abu Ismail yaitu Al Qannad] berkata; telah menceritakan kepadaku [Yahya bin Abu katsir] bahwa [Abdullah bin Abu Qatadah] telah menceritakan kepadanya dari [Ayahnya], bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian buang air kecil, jangan menyentuh kemaluannya dengan tangan kanannya.\"",
      "en": "Has reported to us [Yahya bin Durusta] he said;Has reported us [Abu Ismail, Al Qannad] said;Has told me [Yahya bin Abu Kathir] that [Abdullah bin Abu Qatadah] had told him from [his father], that the Prophet sallallaahu 'alaihi wasallam said: \"If one of you urinates, don't touch his cock with his right hand.\""
    }
  },
  {
    "id": "ibnu-majah-25",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 25",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا غُنْدَرٌ عَنْ شُعْبَةَ ح و حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَقُلْنَا لِزَيْدِ بْنِ أَرْقَمَ حَدِّثْنَا عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كَبِرْنَا وَنَسِينَا وَالْحَدِيثُ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَدِيدٌ",
      "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Ghundar] dari [Syu'bah]. Dan dari jalur lain; Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdurrahman bin Mahdiy] berkata, telah menceritakan kepada kami [Syu'bah] dari ['Amru bin Murrah] dari [Abdurrahman bin Abu Laila] ia berkata; Kami berkata kepada [Zaid bin Arqam]; \"ceritakanlah kepada kami hadits dari Rasulullah shallallahu 'alaihi wasallam, \" ia berkata; \" Kami telah menjadi tua dan pelupa, sedangkan hadits Rasulullah shallallahu 'alaihi wasallam itu sangat keras (berat).\" ",
      "en": "Having told us [Abu Bakr bin Abu Syaibah] said, had told us [Ghundar] from [Syu'bah].And from other paths;Having told us [Muhammad bin Basysyar] had told us [Abdurrahman bin Mahdiy] said, had told us [Syu'bah] from ['Amru bin Murrah] from [Abdurrahman bin Abu Laila] he said;We say to [Zaid bin Arqam];\"Tell us the hadith of the Prophet sallallaahu 'alaihi wasallam,\" he said;\"We have become old and forgetful, while the hadith of the Prophet sallallaahu 'alaihi wasallam is very hard (heavy).\""
    }
  },
  {
    "id": "bukhari-26",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 26",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو الْيَمَانِ قَالَ أَخْبَرَنَا شُعَيْبٌ عَنْ الزُّهْرِيِّ قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ سَعْدٍ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْطَى رَهْطًا وَسَعْدٌ جَالِسٌ فَتَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا هُوَ أَعْجَبُهُمْ إِلَيَّ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا لَكَ عَنْ فُلَانٍ فَوَاللَّهِ إِنِّي لَأَرَاهُ مُؤْمِنًا فَقَالَ أَوْ مُسْلِمًا فَسَكَتُّ قَلِيلًا ثُمَّ غَلَبَنِي مَا أَعْلَمُ مِنْهُ فَعُدْتُ لِمَقَالَتِي فَقُلْتُ مَا لَكَ عَنْ فُلَانٍ فَوَاللَّهِ إِنِّي لَأَرَاهُ مُؤْمِنًا فَقَالَ أَوْ مُسْلِمًا ثُمَّ غَلَبَنِي مَا أَعْلَمُ مِنْهُ فَعُدْتُ لِمَقَالَتِي وَعَادَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ يَا سَعْدُ إِنِّي لَأُعْطِي الرَّجُلَ وَغَيْرُهُ أَحَبُّ إِلَيَّ مِنْهُ خَشْيَةَ أَنْ يَكُبَّهُ اللَّهُ فِي النَّارِوَرَوَاهُ يُونُسُ وَصَالِحٌ وَمَعْمَرٌ وَابْنُ أَخِي الزُّهْرِيِّ عَنْ الزُّهْرِيِّ",
      "id": "Telah menceritakan kepada kami [Abu Al Yaman] berkata, telah mengabarkan kepada kami [Syu'aib] dari [Az Zuhri] berkata, telah mengabarkan kepadaku ['Amir bin Sa'd bin Abu Waqash] dari [Sa'd], bahwa Rasulullah shallallahu 'alaihi wasallam memberikan makanan kepada beberapa orang dan saat itu Sa'd sedang duduk. Tetapi Beliau tidak memberi makanan tersebut kepada seorang laki-laki, padahal orang tersebut yang paling berkesan bagiku diantara mereka yang ada, maka aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam: \"Wahai Rasulullah, bagaimana dengan si fulan? Sungguh aku melihat dia sebagai seorang mu'min.\" Nabi shallallahu 'alaihi wasallam membalas: \"atau dia muslim?\" Kemudian aku terdiam sejenak, dan aku terdorong untuk lebih memastikan apa yang dimaksud Beliau shallallahu 'alaihi wasallam, maka aku ulangi ucapanku: \"Wahai Rasulullah, bagaimana dengan si fulan? Sungguh aku memandangnya sebagai seorang mu'min.\" Nabi shallallahu 'alaihi wasallam membalas: \"atau dia muslim?\" Lalu aku terdorong lagi untuk lebih memastikan apa yang dimaksudnya hingga aku ulangi lagi pertanyaanku. Lalu Nabi shallallahu 'alaihi wasallam bersabda: \"Wahai Sa'd, sesungguhnya aku juga akan memberi kepada orang tersebut. Namun aku lebih suka memberi kepada yang lainnya dari pada memberi kepada dia, karena aku takut kalau Allah akan mencampakkannya ke neraka\". [Yunus], [Shalih], [Ma'mar] dan [keponakan Az Zuhri], telah meriwayatkan dari [Az Zuhri] ",
      "en": "Has told us [Abu Al Yemen] said, having preached to us [Syu'aib] from [Az Zuhri] said, having preached to me ['Amir bin Sa'd bin Abu Waqash] from [Sa'd], that the Prophet sallallaahu' alayhi wasallam gave food to several people and at that time Sa'd was sitting.But he did not give the food to a man, even though the person was the most memorable for me, so I asked the Prophet sallallaahu 'alayhi wasallam: \"O Messenger of Allah, what about the fulan? Really I see him as a mu'min.\"The Prophet sallallaahu 'alaihi wasallam replied: \"Or he is Muslim?\"Then I was silent for a moment, and I was encouraged to make sure what he meant sallallaahu 'alaihi wasallam, so I repeat my words: \"O Messenger of Allah, what about the fulan? Really I see him as a mu'min.\"The Prophet sallallaahu 'alaihi wasallam replied: \"Or he is Muslim?\"Then I was pushed again to make sure what he meant until I repeat my question again.Then the Prophet sallallaahu 'alaihi wasallam said: \"O sa'd, in fact I will also give to that person. But I prefer to give to others than giving to him, because I am afraid that God will dump it to hell\".[Yunus], [Shalih], [Ma'mar] and [Niece Az Zuhri], have narrated from [Az Zuhri]"
    }
  },
  {
    "id": "muslim-27",
    "book": "Muslim",
    "source": "HR. Muslim, No. 27",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ وَكِيعٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ عَنْ زَكَرِيَّاءَ بْنِ إِسْحَقَ قَالَ حَدَّثَنِي يَحْيَى بْنُ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ عَنْ أَبِي مَعْبَدٍ عَنْ ابْنِ عَبَّاسٍ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ أَبُو بَكْرٍ رُبَّمَا قَالَ وَكِيعٌ عَنْ ابْنِ عَبَّاسٍ أَنَّ مُعَاذًا قَالَبَعَثَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّكَ تَأْتِي قَوْمًا مِنْ أَهْلِ الْكِتَابِ فَادْعُهُمْ إِلَى شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ فَأَعْلِمْهُمْ أَنَّ اللَّهَ افْتَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ فَأَعْلِمْهُمْ أَنَّ اللَّهَ افْتَرَضَ عَلَيْهِمْ صَدَقَةً تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ فَتُرَدُّ فِي فُقَرَائِهِمْ فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ بَيْنَهَا وَبَيْنَ اللَّهِ حِجَابٌحَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَقَ ح و حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا أَبُو عَاصِمٍ عَنْ زَكَرِيَّاءَ بْنِ إِسْحَقَ عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ عَنْ أَبِي مَعْبَدٍ عَنْ ابْنِ عَبَّاسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُعَاذًا إِلَى الْيَمَنِ فَقَالَ إِنَّكَ سَتَأْتِي قَوْمًا بِمِثْلِ حَدِيثِ وَكِيعٍ",
      "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Abu Kuraib], dan [Ishaq bin Ibrahim] semuanya dari [Waki'], [Abu Bakar] berkata, telah menceritakan kepada kami [Waki'] dari [Zakariya bin Ishaq] dia berkata, telah menceritakan kepadaku [Yahya bin Abdullah bin Shaifi] dari [Abu Ma'bad] dari [Ibnu Abbas] dari [Mu'adz bin Jabal], Abu Bakar berkata, \"Barangkali, \" Waki' berkata, dari Ibnu Abbas, bahwa Mu'adz berkata, \"Rasulullah shallallahu 'alaihi wasallam mengutusku. Beliau bersabda: \"Sesungguhnya kamu akan mendatangi suatu kaum dari Ahli Kitab, maka ajaklah mereka kepada persaksian bahwa tidak ada tuhan (yang berhak disembah) selain Allah, dan bahwa aku adalah utusan Allah. Jika mereka mentaatimu untuk hal tersebut, maka beritahukanlah kepada mereka bahwa Allah telah mewajibkan kepada mereka shalat lima waktu pada setiap siang dan malam. Jika mereka mentaatimu untuk hal tersebut maka beritahukanlah kepada mereka bahwa Allah telah mewajibkan kepada mereka sedekah yang diambil dari orang kaya mereka lalu dibagikan kepada orang-orang fakir di antara mereka. Jika mereka mentaatimu untuk hal tersebut maka kamu jauhilah harta mulia mereka. Takutlah kamu terhadap doa orang yang terzhalimi, karena tidak ada penghalang antara dia dan Allah'.\" Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Bisyr bin as-Sari] telah menceritakan kepada kami [Zakariya' bin Ishaq]. (dalam riwayat lain disebutkan) Dan telah menceritakan kepada kami [Abd bin Humaid] telah menceritakan kepada kami [Abu Ashim] dari [Zakariya' bin Ishaq] dari [Yahya bin Abdullah bin Shaifi] dari [Abu Ma'bad] dari [Ibnu Abbas], bahwa Nabi shallallahu 'alaihi wasallam mengutus Mu'adz ke Yaman, maka beliau bersabda: \"Sesungguhnya kamu akan mendatangi suatu kaum.\" Sebagaimana hadits Waki'.",
      "en": "Has told us [Abu Bakr bin Abu Syaibah] and [Abu Kuraib], and [Ishaq bin Ibrahim] everything from [Waki '], [Abu Bakr] said, had told us [Waki'] from [Zakariya bin Ishaq] he said, had told me [Yahya bin Abdullah bin Shaifi] from [Abu Ma'bad] from [ibnu abbas] from [mu'adz bin jabal]\"Perhaps,\" Waki ​​'said, from Ibn Abbas, that Mu'adz said, \"Rasulullah sallallaahu' alaihi wasallam sent me. He said:\" Surely you will go to a people from the book expert, then invite them to the testimony that there is no God (who is entitled to be worshiped) other than God, and that I am God's messenger.If they obey you for this, then tell them that God has required them to pray five times a day every day and night.If they obey you for this, tell them that God has required them to alms taken from their rich people and then distributed to the poor among them.If they obey you for this then you stay away from their noble property.Afraid of you with the prayers of the wrongdoing people, because there is no obstacle between him and Allah '. \"Has told us [Ibn Abu Umar] had told us [Bisyr bin As-Sari] had told us [Zakariya' bin Ishaq] (in another narration mentioned) and had told us [Abd Bin Humaid]bin Shaifi] from [Abu Ma'bad] from [Ibn Abbas], that the Prophet sallallaahu 'alaihi wasallam sent Mu'adz to Yemen, then he said: \"Indeed you will go to a people.\""
    }
  },
  {
    "id": "abu-daud-28",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 28",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَمْرُو بْنُ مُحَمَّدٍ النَّاقِدُ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا إِسْرَائِيلُ عَنْ يُوسُفَ بْنِ أَبِي بُرْدَةَ عَنْ أَبِيهِ حَدَّثَتْنِي عَائِشَةُ رَضِيَ اللَّهُ عَنْهَاأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا خَرَجَ مِنْ الْغَائِطِ قَالَ غُفْرَانَكَ",
      "id": "Telah menceritakan kepada kami [Amru bin Muhammad An Naqid] telah menceritakan kepada kami [Hasyim bin Al Qasim] telah menceritakan kepada kami [Isra`il] dari [Yusuf bin Abu Burdah] dari [Ayahnya] telah menceritakan kepada saya [Aisyah] radliallahu 'anha bahwasanya Rasulullah shallallahu 'alaihi wasallam apabila keluar dari WC, beliau mengucapkan: \"GHUFRAANAKA (Aku mohon ampunanMu).\"",
      "en": "Having told us [Amru bin Muhammad An Naqid] had told us [Hasyim bin Al Qasim] had told us [Isra`il] from [Yusuf bin Abu Burdah] from [his father] had told me [Aisyah] Radliallahu 'Anha that the Prophet sallallaahu \""
    }
  },
  {
    "id": "tirmidzi-29",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 29",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ إِسْرَائِيلَ عَنْ عَامِرِ بْنِ شَقِيقٍ عَنْ أَبِي وَائِلٍ عَنْ عُثْمَانَ بْنِ عَفَّانَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخَلِّلُ لِحْيَتَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ و قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ حَدِيثُ عَامِرِ بْنِ شَقِيقٍ عَنْ أَبِي وَائِلٍ عَنْ عُثْمَانَ قَالَ أَبُو عِيسَى و قَالَ بِهَذَا أَكْثَرُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ بَعْدَهُمْ رَأَوْا تَخْلِيلَ اللِّحْيَةِ وَبِهِ يَقُولُ الشَّافِعِيُّ و قَالَ أَحْمَدُ إِنْ سَهَا عَنْ تَخْلِيلِ اللِّحْيَةِ فَهُوَ جَائِزٌ و قَالَ إِسْحَقُ إِنْ تَرَكَهُ نَاسِيًا أَوْ مُتَأَوِّلًا أَجْزَأَهُ وَإِنْ تَرَكَهُ عَامِدًا أَعَادَ",
      "id": "telah menceritakan kepada kami [Yahya bin Musa] berkata, telah menceritakan kepada kami [Abdurrazaq] dari [Israil] dari ['Amir bin Syaqiq] dari [Abu Wa`il] dari [Utsman bin 'Affan] bahwa Nabi shallallahu 'alaihi wasallam menyela-nyela jenggotnya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih.\" Muhammad bin Isma'il berkata; \"Hadits yang paling shahih dalam bab ini adalah hadits 'Amir bin Syaqiq, dari Abu Wa`il dari Utsman.\" Abu Isa berkata; \"Pendapat ini banyak diambil kebanyakan ahlul ilmi dari para sahabat Nabi shallallahu 'alaihi wasallam dan orang yang sesudah mereka mengatakan demikian. Pendapat ini juga diambil oleh Imam Syafi'i. Imam Ahmad berkata; \"Jika ia lupa menyela-nyela jenggot, maka itu tidaklah mengapa.\" Sementara Ishaq berkata; \"Jika ia meninggalkannya karena lupa atau karena takwil, maka hal itu sah baginya. Namun jika meninggalkannya dengan sengaja maka ia harus mengulanginya.\"",
      "en": "had told us [Yahya bin Musa] said, had told us [Abdurrazaq] from [Israel] from ['Amir bin Syaqiq] from [Abu Wa`il] from [Uthman bin' Affan] that the Prophet sallallaahu 'alaihi wasallam interrupted his bend. \"The most authentic in this chapter is the hadith 'Amir bin Syaqiq, from Abu Wa`il from Uthman. \"Abu Isa said;\" This opinion is mostly taken by most of the friends of the Prophet sallallaahu' alaihi wasallam and people after they say so.This opinion was also taken by Imam Shafi'i.Imam Ahmad said;\"If he forgot to interrupt the beard, then that is not why.\"While Ishaq said;\"If he leaves him because he forgets or because of takwil, then it is legitimate for him. But if you leave it intentionally then he must repeat it.\""
    }
  },
  {
    "id": "nasai-30",
    "book": "Nasai",
    "source": "HR. Nasai, No. 30",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ عَنْ أَبِي مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ الرَّحْمَنِ ابْنِ حَسَنَةَ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي يَدِهِ كَهَيْئَةِ الدَّرَقَةِ فَوَضَعَهَا ثُمَّ جَلَسَ خَلْفَهَا فَبَالَ إِلَيْهَا فَقَالَ بَعْضُ الْقَوْمِ انْظُرُوا يَبُولُ كَمَا تَبُولُ الْمَرْأَةُ فَسَمِعَهُ فَقَالَ أَوَ مَا عَلِمْتَ مَا أَصَابَ صَاحِبُ بَنِي إِسْرَائِيلَ كَانُوا إِذَا أَصَابَهُمْ شَيْءٌ مِنْ الْبَوْلِ قَرَضُوهُ بِالْمَقَارِيضِ فَنَهَاهُمْ صَاحِبُهُمْ فَعُذِّبَ فِي قَبْرِهِ",
      "id": "Telah mengabarkan kepada kami [Hannad bin As Sariy] dari [Abu Mu'awiyah] dari [Al 'Amasy] dari [Zaid bin Wahab] dari [Abdurrahman bin Hasanah] dia berkata, \" Rasulullah shallallahu 'alaihi wasallam pernah menemui kami, dan di tangan beliau ada sesuatu yang mirip perisai dari kulit. Beliau lalu meletakkannya dan duduk di belakangnya, kemudian buang air kecil ke arah perisai tersebut. Sebagian orang berkomentar, 'Lihatlah, beliau buang air kecil seperti perempuan! ' Ketika Rasulullah shallallahu 'alaihi wasallam mendengar ucapan tersebut, beliau berkata, 'Apakah kalian tidak tahu apa yang menimpa seorang Bani Israil?! Apabila seorang dari mereka terkena air kencing, mereka menggunting kain yang terkena kencing tadi, lalu temannya melarang mereka melakukan demikian, sehingga ia disiksa di kuburnya.\" ",
      "en": "Has preached to us [Hannad bin as Sariy] from [Abu Mu'awiyah] from [Al 'amasy] from [Zaid bin Wahab] from [Abdurrahman bin Hasanah] he said, \"Rasulullah sallallaahu' alaihi wasallam once met us, and in his hands there was something similar to a shield of the skin.'Look, he urinates like a woman!' When the Prophet sallallaahu 'alaihi wasallam heard, he said,' do you not know what happened to a Children of Israel?!"
    }
  },
  {
    "id": "ibnu-majah-31",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 31",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ وَإِسْمَعِيلُ بْنُ مُوسَى قَالَا حَدَّثَنَا شَرِيكٌ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَكْذِبُوا عَلَيَّ فَإِنَّ الْكَذِبَ عَلَيَّ يُولِجُ النَّارَ",
      "id": "Telah menceritakan kepada kami [Abdullah bin 'Amir bin Zurarah] dan [Isma'il bin Musa] keduanya berkata; telah menceritakan kepada kami [Syarik] dari [Manshur] dari [Rib'i bin Hirasy] dari [Ali] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Janganlah kalian berdusta atas namaku, karena sesungguhnya dusta atas namaku akan memasukkan ke dalam neraka.\"",
      "en": "Had told us [Abdullah bin 'Amir bin Zurarah] and [Isma'il bin Musa] both said;Has told us [Syarik] from [Manshur] from [Rib'i bin Hirasy] from [Ali] he said;Rasulullah sallallaahu 'alayhi wasallam said: \"Do not lie on my name, because actually a lie on my name will put in hell.\""
    }
  },
  {
    "id": "bukhari-32",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 32",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا سُلَيْمَانُ أَبُو الرَّبِيعِ قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ قَالَ حَدَّثَنَا نَافِعُ بْنُ مَالِكِ بْنِ أَبِي عَامِرٍ أَبُو سُهَيْلٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ آيَةُ الْمُنَافِقِ ثَلَاثٌ إِذَا حَدَّثَ كَذَبَ وَإِذَا وَعَدَ أَخْلَفَ وَإِذَا اؤْتُمِنَ خَانَ",
      "id": "Telah menceritakan kepada kami [Sulaiman Abu ar Rabi'] berkata, telah menceritakan kepada kami [Isma'il bin Ja'far] berkata, telah menceritakan kepada kami [Nafi' bin Malik bin Abu 'Amir Abu Suhail] dari [bapaknya] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tanda-tanda munafiq ada tiga; jika berbicara dusta, jika berjanji mengingkari dan jika diberi amanat dia khianat\". ",
      "en": "Having told us [Sulaiman Abu Ar Rabi '] said, having told us [Isma'il bin Ja'far] said, had told us [Nafi' bin Malik bin Abu 'Amir Abu Suhail] from [his father's father] from [Abu Hurairah] from the Prophet sallallaahu' alayhi wasallam, he said: \"signs of munafiqkhianat \"."
    }
  },
  {
    "id": "muslim-33",
    "book": "Muslim",
    "source": "HR. Muslim, No. 33",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِىُّ مَالِكُ بْنُ عَبْدِ الْوَاحِدِ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ عَنْ شُعْبَةَ عَنْ وَاقِدِ بْنِ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَيُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ فَإِذَا فَعَلُوا عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلَّا بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ",
      "id": "Telah menceritakan kepada kami [Abu Ghassan al-Misma'i Malik bin Abdul Wahid] telah menceritakan kepada kami [Abdul Malik bin ash-Shabbah] dari [Syu'bah] dari [Waqid bin Muhammad bin Zaid bin Abdullah bin Umar] dari [bapaknya] dari [Abdullah bin Umar] beliau bersabda: \"Aku diperintahkan untuk memerangi manusia hingga mereka bersaksi bahwa tidak ada tuhan (yang berhak disembah) melainkan Allah dan bahwa Muhammad utusan Allah, mereka mendirikan shalat, dan menunaikan zakat. Maka apabila mereka melakukan hal tersebut, maka sungguh mereka telah menjaga harta dan jiwanya dari (seranganku), kecuali disebabkan hak Islam. Dan hisab mereka diserahkan kepada Allah.\"",
      "en": "Had told us [Abu Ghassan Al-Misma'i Malik bin Abdul Wahid] had told us [Abdul Malik bin Ash-Shabbah] from [Syu'bah] from [Waqid bin Muhammad bin Zaid bin Abdullah bin Umar] from [his father] from [Abdullah bin Umar]And that Muhammad is the messenger of Allah, they established prayer, and fulfilled zakat."
    }
  },
  {
    "id": "abu-daud-34",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 34",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَقَ حَدَّثَنَا أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُنَهَانَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَتَمَسَّحَ بِعَظْمٍ أَوْ بَعْرٍ",
      "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] telah menceritakan kepada kami [Rauh bin Ubadah] telah menceritakan kepada kami [Zakariyya bin Ishaq] telah menceritakan kepada kami [Abu Az Zubair] bahwa dia pernah mendengar [Jabir bin Abdullah] berkata; Rasulullah shallallahu 'alaihi wasallam melarang kami untuk beristinja dengan kotoran binatang. ",
      "en": "Has told us [Ahmad bin Muhammad bin Hanbal] had told us [Rauh bin Ubadah] had told us [Zakariyya bin Ishaq] had told us [Abu Az Zubair] that he had heard [Jabir bin Abdullah] said;Rasulullah sallallaahu 'alaihi wasallam forbade us from culay with animal dirt."
    }
  },
  {
    "id": "tirmidzi-35",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 35",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ سِنَانِ بْنِ رَبِيعَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَبِي أُمَامَةَ قَالَتَوَضَّأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَقَالَ الْأُذُنَانِ مِنْ الرَّأْسِقَالَ أَبُو عِيسَى قَالَ قُتَيْبَةُ قَالَ حَمَّادٌ لَا أَدْرِي هَذَا مِنْ قَوْلِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوْ مِنْ قَوْلِ أَبِي أُمَامَةَ قَالَ وَفِي الْبَاب عَنْ أَنَسٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِذَاكَ الْقَائِمِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ بَعْدَهُمْ أَنَّ الْأُذُنَيْنِ مِنْ الرَّأْسِ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ مَا أَقْبَلَ مِنْ الْأُذُنَيْنِ فَمِنْ الْوَجْهِ وَمَا أَدْبَرَ فَمِنْ الرَّأْسِ قَالَ إِسْحَقُ وَأَخْتَارُ أَنْ يَمْسَحَ مُقَدَّمَهُمَا مَعَ الْوَجْهِ وَمُؤَخَّرَهُمَا مَعَ رَأْسِهِ و قَالَ الشَّافِعِيُّ هُمَا سُنَّةٌ عَلَى حِيَالِهِمَا يَمْسَحُهُمَا بِمَاءٍ جَدِيدٍ",
      "id": "telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Hammad bin Zaid] dari [Sinan bin Rabi'ah] dari [Syahr bin Hausyab] dari [Abu Umamah] ia berkata; Nabi shallallahu 'alaihi wasallam berwudlu, beliau membasuh wajahnya tiga kali, dan kedua tangannya tiga kali, lalu mengusap kepalanya seraya bersabda: \"Kedua telinga adalah termasuk bagian dari kepala.\" Abu Isa berkata; Qutaibah berkata; bahwa Hammad berkata; \"Aku tidak tahu apakah ini perkataan Nabi shallallahu 'alaihi wasallam atau dari Abu Umamah.\" Abu Isa berkata; \"Dalam bab ini ada juga hadits dari Anas, \" ia berkata lagi, \"Hadits ini sanadnya tidak sesuai dengan susunannya.\" Dan hadits ini diamalkan oleh kebanyakan ahli ilmu dari para sahabat Nabi shallallahu 'alaihi wasallam dan orang-orang setelah mereka, bahwa kedua telinga termasuk bagian dari kepala. Pendapat ini diambil juga oleh Sufyan Ats Tsauri, Ibnul Mubarak, Syafi'i, Ahmad dan Ishaq. Sementara ulama lain berpendapat, bahwa telinga bagian depan adalah termasuk wajah, sementara telinga bagian belakang adalah termasuk kepala. Ishaq berkata; \"Aku memilih mengusap bagian depannya bersama wajah dan bagian belakangnya bersama kepala.\" Sedangkan Syafi'i berkata; \"Keduanya adalah sunnah, bahwasanya beliau mengusap keduanya dengan air yang baru.\"",
      "en": "Having told us [Qutaibah] said, had told us [Hammad bin Zaid] from [Sinan bin Rabi'ah] from [Syahr bin Hausyab] from [Abu Umamah] he said;The Prophet sallallaahu 'alaihi wasallam ablution, he washed his face three times, and his hands three times, then rubbed his head as he said: \"Both ears are part of the head.\"Abu Isa said;Qutaibah said;that Hammad said;\"I don't know whether this is the words of the Prophet sallallaahu 'alaihi wasallam or from Abu Umamah.\"Abu Isa said;\"In this chapter there is also a hadith from Anas,\" he said again, \"This hadith is not in accordance with the arrangement.\"And this hadith is practiced by most science experts from the companions of the Prophet sallallaahu 'alaihi wasallam and people after them, that both ears are part of the head.This opinion was also taken by Sufyan Ats Tsauri, Ibnul Mubarak, Syafi'i, Ahmad and Ishaq.While other scholars argue, that the front ear is included in the face, while the rear ear is included in the head.Ishaq said;\"I chose to rub the front with his face and back with his head.\"While Syafi'i said;\"Both of them are sunnah, that he rubbed both of them with new water.\""
    }
  },
  {
    "id": "nasai-36",
    "book": "Nasai",
    "source": "HR. Nasai, No. 36",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الْأَشْعَثِ بْنِ عَبْدِ الْمَلِكِ عَنْ الْحَسَنِ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَبُولَنَّ أَحَدُكُمْ فِي مُسْتَحَمِّهِ فَإِنَّ عَامَّةَ الْوَسْوَاسِ مِنْهُ",
      "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dia berkata; telah memberitakan kepada kami [Ibnu Al Mubarak] dari [Ma'mar] dari [Al Asy'ats bin Abdul Malik] dari [Al Hasan] dari [Abdullah bin Mughaffal] dari Rasulullah shallallahu 'alaihi wasallam, beliau bersabda: \" Jangan kalian buang air kecil di tempat pemandian, karena kebanyakan rasa was-was itu berasal darinya.\"",
      "en": "Has reported to us [Ali bin Hujr] he said;Has reported us [Ibn Al Mubarak] from [Ma'mar] from [Al Asy'ats bin Abdul Malik] from [Al Hasan] from [Abdullah bin Mughaffal] from the Prophet sallallaahu 'alaihi wasallam, he said: \"Don't you urinate at the bath, because most of the anxiety comes from it.\""
    }
  },
  {
    "id": "ibnu-majah-37",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 37",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ مُطَرِّفٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ",
      "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Ali bin Mushir] dari [Mutharrif] dari ['Athiyyah] dari [Abu Sa'id] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Barangsiapa berdusta atas namaku dengan sengaja, maka hendaklah ia menyiapkan tempat duduknya di neraka.\"",
      "en": "Having told us [Suwaid bin Sa'id] said, had told us [Ali Bin Mushir] from [Mutharrif] from ['Athiyyah] from [Abu Sa'id] he said;Rasulullah sallallaahu 'alayhi wasallam said: \"Whoever lies on my name intentionally, so he should prepare his seat in hell.\""
    }
  },
  {
    "id": "bukhari-38",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 38",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَبْدُ السَّلَامِ بْنُ مُطَهَّرٍ قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ عَنْ مَعْنِ بْنِ مُحَمَّدٍ الْغِفَارِيِّ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الدِّينَ يُسْرٌ وَلَنْ يُشَادَّ الدِّينَ أَحَدٌ إِلَّا غَلَبَهُ فَسَدِّدُوا وَقَارِبُوا وَأَبْشِرُوا وَاسْتَعِينُوا بِالْغَدْوَةِ وَالرَّوْحَةِ وَشَيْءٍ مِنْ الدُّلْجَةِ",
      "id": "Telah menceritakan kepada kami [Abdus Salam bin Muthahhar] berkata, telah menceritakan kepada kami [Umar bin Ali] dari [Ma'an bin Muhammad Al Ghifari] dari [Sa'id bin Abu Sa'id Al Maqburi] dari [Abu Hurairah] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya agama itu mudah, dan tidaklah seseorang mempersulit agama kecuali dia akan dikalahkan (semakin berat dan sulit). Maka berlakulah lurus kalian, mendekatlah (kepada yang benar) dan berilah kabar gembira dan minta tolonglah dengan Al Ghadwah (berangkat di awal pagi) dan ar-ruhah (berangkat setelah zhuhur) dan sesuatu dari ad-duljah ((berangkat di waktu malam) \". ",
      "en": "Has told us [Abdus Salam bin Mutahhar] said, had told us [Umar bin Ali] from [Ma'an bin Muhammad Al Ghifari] from [Sa'id bin Abu Sa'id Al Maqburi] from [Abu Hurairah] that the Prophet sallallaahu 'alaihi wasallam said: \"(to the right) and give good news and ask for help with Al Ghadwah (departing in the early morning) and Ar-Ruhah (departing after zhuhur) and something from Ad-Duljah ((leaving at night) \"."
    }
  },
  {
    "id": "muslim-39",
    "book": "Muslim",
    "source": "HR. Muslim, No. 39",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ قَالَ حَدَّثَنِي أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ عَنْ مَالِكِ بْنِ مِغْوَلٍ عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسِيرٍ قَالَ فَنَفِدَتْ أَزْوَادُ الْقَوْمِ قَالَ حَتَّى هَمَّ بِنَحْرِ بَعْضِ حَمَائِلِهِمْ قَالَ فَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ لَوْ جَمَعْتَ مَا بَقِيَ مِنْ أَزْوَادِ الْقَوْمِ فَدَعَوْتَ اللَّهَ عَلَيْهَا قَالَ فَفَعَلَ قَالَ فَجَاءَ ذُو الْبُرِّ بِبُرِّهِ وَذُو التَّمْرِ بِتَمْرِهِ قَالَ وَقَالَ مُجَاهِدٌ وَذُو النَّوَاةِ بِنَوَاهُ قُلْتُ وَمَا كَانُوا يَصْنَعُونَ بِالنَّوَى قَالَ كَانُوا يَمُصُّونَهُ وَيَشْرَبُونَ عَلَيْهِ الْمَاءَ قَالَ فَدَعَا عَلَيْهَا حَتَّى مَلَأَ الْقَوْمُ أَزْوِدَتَهُمْ قَالَ فَقَالَ عِنْدَ ذَلِكَ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي رَسُولُ اللَّهِ لَا يَلْقَى اللَّهَ بِهِمَا عَبْدٌ غَيْرَ شَاكٍّ فِيهِمَا إِلَّا دَخَلَ الْجَنَّةَ",
      "id": "Telah menceritakan kepada kami [Abu Bakar bin an-Nadlar bin Abu an-Nadlar] dia berkata, telah menceritakan kepada kami [Abu an-Nadlar Hasyim bin al-Qasim] telah menceritakan kepada kami [Ubaidullah al-Asyja'i] dari [Malik bin Mighwal] dari [Thalhah bin Musharrif] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, \"Kami bersama Nabi shallallahu 'alaihi wasallam dalam suatu perjalanan\". Lalu dia berkata, 'maka bekal kaum tersebut habis.' Selanjutnya dia berkata, \"Hingga mereka berkeinginan untuk menyembelih sebagian hewan kendaraan mereka.\" Perawi berkata, \"Maka Umar berkata, 'Wahai Rasulullah, kalau seandainya kamu mengumpulkan sebagian dari bekal kaum lalu kamu berdoa kepada Allah atasnya (niscaya itu baik).\" Perawi berkata, \"Lalu beliau melakukannya.\" Perawi berkata, \"Lalu pemilik gandum datang dengan membawa gandumnya, pemilik kurma datang dengan membawa kurmanya.\" Perawi berkata, \"Dan Mujahid berkata, 'Dan pemilik biji-bijian dengan biji-bijian mereka.\" Aku berkata, \"Apa yang mereka perbuat dengan biji-bijian tersebut?\" dia menjawab, \"Mereka mengisap dan meminum air padanya.\" Dia berkata, \"Lalu Rasulullah memanggil mereka hingga mereka dapat memenuhi wadah perbekalan mereka.\" Perawi berkata, \"Maka Rasulullah berdoa ketika itu: 'Saya bersaksi bahwa tidak ada tuhan (yang berhak disembah) selain Allah dan bahwa saya adalah utusan Allah, tidaklah seorang hamba bertemu Allah dengan berpegang teguh padanya tanpa ada keraguan niscaya dia masuk surga'.\"",
      "en": "Has told us [Abu Bakar bin An-Nadlar bin Abu An-Nadlar] he said, had told us [Abu An-Nadlar Hasyim bin Al-Qasim] had told us [Ubaidullah al-Asyja'i] from [Malik bin Mighwal] from [Thalhah bin Musharrif] from [Abu Shalih] from [Abu Hurairah]a trip \".Then he said, 'So the provision of the people is up.'Next he said, \"Until they want to slaughter some of their vehicle animals.\"The narrator said, \"then Umar said, 'O Messenger of Allah, if you gather some of the provisions of the people and then you pray to God (surely it is good).\"The narrator said, \"Then he did it.\"The narrator said, \"Then the owner of the wheat came with his wheat, the dates owner came with his dates.\"The narrator said, \"And Mujahid said, 'And the owner of the grains with their grains.\"I said, \"What do they do with these seeds?\"He replied, \"They sucked and drank water to him.\"He said, \"Then the Messenger of Allah called them so they could fulfill their supplies.\"The narrator said, \"The Messenger of Allah prayed at that time: 'I testified that there was no God (who had the right to be worshiped) other than God and that I was a messenger of God, not a servant met God by holding fast to him without any doubts he would enter heaven'.\""
    }
  },
  {
    "id": "abu-daud-40",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 40",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ أَخْبَرَنَا مُعَاوِيَةُ بْنُ هِشَامٍ عَنْ يُونُسَ بْنِ الْحَارِثِ عَنْ إِبْرَاهِيمَ بْنِ أَبِي مَيْمُونَةَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَزَلَتْ هَذِهِ الْآيَةُ فِي أَهْلِ قُبَاءٍ{ فِيهِ رِجَالٌ يُحِبُّونَ أَنْ يَتَطَهَّرُوا }قَالَ كَانُوا يَسْتَنْجُونَ بِالْمَاءِ فَنَزَلَتْ فِيهِمْ هَذِهِ الْآيَةُ",
      "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] telah mengabarkan kepada kami [Mu'awiyah bin Hisyam] dari [Yunus bin Al Harits] dari [Ibrahim bin Abi Maimunah] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, dia berkata; Ayat ini turun berkaitan dengan penduduk Quba, \"Di dalamnya ada orang-orang yang ingin membersihkan diri.\" Abu hurairah berkata; \"Mereka beristinja dengan air, maka ayat ini turun berkaitan dengan mereka.\"",
      "en": "Has told us [Muhammad bin Al 'Ala] Has reported to us [Mu'awiyah bin Hisham] from [Yunus bin Al Harits] from [Ibrahim bin Abi Maimunah] from [Abu Shalih] from [Abu Hurairah] from the Prophet sallallaahu' alayhi wasallam, he said;This verse comes down with regard to the population of Quba, \"In it there are people who want to clean themselves.\"Abu Hurairah said;\"They are cursing with water, so this verse comes down with regard to them.\""
    }
  },
  {
    "id": "tirmidzi-41",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 41",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ رَافِعٍ قَالَا حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ ثَابِتِ بْنِ ثَوْبَانَ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْفَضْلِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ هُرْمُزَ هُوَ الْأَعْرَجُ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ مَرَّتَيْنِ مَرَّتَيْنِقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ جَابِرٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ ثَوْبَانَ عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ وَهُوَ إِسْنَادٌ حَسَنٌ صَحِيحٌ قَالَ أَبُو عِيسَى وَقَدْ رَوَى هَمَّامٌ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ ثَلَاثًا ثَلَاثًا",
      "id": "telah menceritakan kepada kami [Abu Kuraib] dan [Muhammad bin Rafi'] mereka berkata; telah menceritakan kepada kami [Zaid bin Hubab] dari [Abdurrahman bin Tsabit bin Tsauban] berkata; telah menceritakan kepadaku [Abdullah Ibnul Fadll] dari [Abdurrahman bin Hurmuz] -yaitu Al A'raj- dari [Abu Hurairah] berkata; \" Nabi shallallahu 'alaihi wasallam berwudlu dua kali dua kali.\" Abu Isa berkata; \"Dalam bab ini ada juga hadits dari Jabir.\" Abu Isa berkata lagi, \"Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari hadits Ibnu Tsauban dari Abdullah bin Al Fadll, dan sanadnya hasan shahih.\" Abu Isa berkata; \" [Hammam] telah meriwayatkan dari ['Amir Al Ahwal], dari ['Atho`], dari [Abu Hurairah], bahwa Nabi shallallahu 'alaihi wasallam berwudlu tiga kali tiga kali.\"",
      "en": "Has told us [Abu Kuraib] and [Muhammad bin Rafi '] they said;Has told us [Zaid bin Hubab] from [Abdurrahman bin Tsabit bin Tsauban] said;Has told me [Abdullah Ibnul Fadll] from [Abdurrahman bin Hurmuz] - that is Al A'raj - from [Abu Hurairah] said;\"Prophet sallallaahu 'alaihi wasallam ablution twice twice.\"Abu Isa said;\"In this chapter there is also a hadith from Jabir.\"Abu Isa said again, \"This hadith is Hasan Gharib, we don't know it except from the hadith of Ibn Tsauban from Abdullah bin Al Fadll, and Hasan Sahih's sanad.\"Abu Isa said;\"[Hammam] has narrated from ['Amir Al Ahwal], from [' Atho '], from [Abu Hurairah], that the Prophet sallallaahu' alaihi wasallam ablution three times three times.\""
    }
  },
  {
    "id": "nasai-42",
    "book": "Nasai",
    "source": "HR. Nasai, No. 42",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ عَنْ زُهَيْرٍ عَنْ أَبِي إِسْحَقَ قَالَ لَيْسَ أَبُو عُبَيْدَةَ ذَكَرَهُ وَلَكِنْ عَبْدُ الرَّحْمَنِ بْنُ الْأَسْوَدِ عَنْ أَبِيهِ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ يَقُولُأَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْغَائِطَ وَأَمَرَنِي أَنْ آتِيَهُ بِثَلَاثَةِ أَحْجَارٍ فَوَجَدْتُ حَجَرَيْنِ وَالْتَمَسْتُ الثَّالِثَ فَلَمْ أَجِدْهُ فَأَخَذْتُ رَوْثَةً فَأَتَيْتُ بِهِنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخَذَ الْحَجَرَيْنِ وَأَلْقَى الرَّوْثَةَ وَقَالَ هَذِهِ رِكْسٌقَالَ أَبُو عَبْد الرَّحْمَنِ الرِّكْسُ طَعَامُ الْجِنِّ",
      "id": "Telah mengabarkan kepada kami [Ahmad bin Sulaiman] dia berkata; telah memberitakan kepada kami [Abu Nu'aim] dari [Zuhair] dari [Abu Ishaq] dia berkata; bukan Abu Ubaidah yang disebutkan tapi [Abdurrahman bin Al Aswad] dari [Ayahnya] bahwasannya dia mendengar [Abdullah] berkata, \" Rasulullah shallallahu 'alaihi wasallam pergi untuk buang air besar, lalu beliau menyuruhku membawa tiga batu. Tetapi aku hanya mendapatkan dua batu, dan aku berusaha mencari yang ketiga, namun aku tidak mendapatkannya. Lalu aku mengambil kotoran hewan yang kering dan aku bawa ke Rasulullah shallallahu 'alaihi wasallam Beliau hanya mengambil dua batu dan membuang kotoran, lalu bersabda, 'Ini adalah riks (najis).\" Abu Abdurrahman berkata; \"Ar riks adalah makanan jin\"",
      "en": "Has reported to us [Ahmad bin Sulaiman] he said;Has reported us [Abu Nu'aim] from [Zuhair] from [Abu Ishaq] he said;Not Abu Ubaidah mentioned but [Abdurrahman bin Al Aswad] from [his father] that he heard [Abdullah] said, \"Rasulullah sallallaahu 'alaihi wasallam went to defecate, then he told me to bring three stones. But I only got two stones, and I tried to find the third, but I did not get it.Wasallam he only took two stones and threw dirt, then said, 'This is a riks (unclean). \"Abu Abdurrahman said;\"Ar Riks is Jin's food\""
    }
  },
  {
    "id": "ibnu-majah-43",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 43",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ بِشْرِ بْنِ مَنْصُورٍ وَإِسْحَقُ بْنُ إِبْرَاهِيمَ السَّوَّاقُ قَالَا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ عَنْ ضَمْرَةَ بْنِ حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو السُّلَمِيِّ أَنَّهُ سَمِعَ الْعِرْبَاضَ بْنَ سَارِيَةَ يَقُولُوَعَظَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَوْعِظَةً ذَرَفَتْ مِنْهَا الْعُيُونُ وَوَجِلَتْ مِنْهَا الْقُلُوبُ فَقُلْنَا يَا رَسُولَ اللَّهِ إِنَّ هَذِهِ لَمَوْعِظَةُ مُوَدِّعٍ فَمَاذَا تَعْهَدُ إِلَيْنَا قَالَ قَدْ تَرَكْتُكُمْ عَلَى الْبَيْضَاءِ لَيْلُهَا كَنَهَارِهَا لَا يَزِيغُ عَنْهَا بَعْدِي إِلَّا هَالِكٌ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلَافًا كَثِيرًا فَعَلَيْكُمْ بِمَا عَرَفْتُمْ مِنْ سُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيِّينَ عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ وَعَلَيْكُمْ بِالطَّاعَةِ وَإِنْ عَبْدًا حَبَشِيًّا فَإِنَّمَا الْمُؤْمِنُ كَالْجَمَلِ الْأَنِفِ حَيْثُمَا قِيدَ انْقَادَحَدَّثَنَا يَحْيَى بْنُ حَكِيمٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ الْمِسْمَعِيُّ حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو عَنْ الْعِرْبَاضِ بْنِ سَارِيَةَ قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الصُّبْحِ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ فَوَعَظَنَا مَوْعِظَةً بَلِيغَةً فَذَكَرَ نَحْوَهُ",
      "id": "Telah menceritakan kepada kami [Isma'il bin Bisyr bin Manshur] dan [Ishaq bin Ibrahim As Sawwaq] keduanya berkata; telah menceritakan kepada kami [Abdurrahman bin Mahdi] dari [Mu'awiyah bin Shalih] dari [Dlamrah bin Habib] dari [Abdurrahman bin 'Amru As Sulami] bahwasanya ia mendengar ['Irbadl bin Sariyah] berkata; Rasulullah shallallahu 'alaihi wasallam memberi kami satu nasehat yang membuat air mata mengalir dan hati menjadi gemetar. Maka kami berkata kepada beliau; \"Ya Rasulullah, sesungguhnya ini merupakan nasihat perpisahan, lalu apa yang engkau wasiatkan kepada kami?\" Rasulullah shallallahu 'alaihi wasallam bersabda: \" Aku telah tinggalkan untuk kalian petunjuk yang terang, malamnya seperti siang. Tidak ada yang berpaling darinya setelahku melainkan ia akan binasa. Barangsiapa di antara kalian hidup, maka ia akan melihat banyaknya perselisihan. Maka kalian wajib berpegang teguh dengan apa yang kalian ketahui dari sunnahku, dan sunnah para Khulafaur Rasyidin yang mendapat petunjukk, gigitlah sunnah-sunnah itu dengan gigi geraham. Hendaklah kalian taat meski kepada seorang budak Habasyi. Orang mukmin itu seperti seekor unta jinak, di mana saja dia diikat dia akan menurutinya.\" Telah menceritakan kepada kami [Yahya bin Hakim] berkata, telah menceritakan kepada kami [Abdul Malik bin Ash Shabbah Al Misma'i] berkata, telah menceritakan kepada kami [Tsaur bin Yazid] dari [Khalid bin Ma'dan] dari [Abdurrahman bin 'Amru] dari ['Irbadl bin Sariyah] ia berkata; \"Rasulullah shallallahu 'alaihi wasallam mengimami kami pada shalat subuh, kemudian Beliau berpaling kepada kami dan memberi nasehat yang sangat menyentuh.\" Lalu ia menyebutkan sebagaimana dalam hadits di atas. ",
      "en": "Has told us [Isma'il bin Bisyr bin Manshur] and [Ishaq bin Ibrahim as Sawwaq] both said;Has told us [Abdurrahman bin Mahdi] from [Mu'awiyah bin Salih] from [Dlamrah bin Habib] from [Abdurrahman bin 'Amru as Sulami] that he heard [' irbadl bin sariyah] said;Rasulullah sallallaahu 'alaihi wasallam gave us one advice that made tears flow and the heart trembled.Then we said to him;\"O Messenger of Allah, in fact this is a farewell advice, so what do you say to us?\"Rasulullah sallallaahu 'alayhi wasallam said: \"I have left for you bright instructions, the night is like daytime. Nobody turned away from him after I will perish. Whoever is among you lives, then he will see the many disputes.Groin. Let you obey even to a habasyi slave.Has told us [Yahya bin Hakim] said, having told us [Abdul Malik bin Ash Shabbah Al Misma'i] said, had told us [Tsaur bin Yazid] from [Khalid bin Ma'dan] from [Abdurrahman bin 'Amru] from [' Irbadl bin Sariyah] he said;\"Rasulullah sallallaahu 'alaihi wasallam led us to the dawn prayer, then he turned to us and gave a very touching advice.\"Then he mentioned as in the hadith above."
    }
  },
  {
    "id": "bukhari-44",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 44",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا إِسْمَاعِيلُ قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ عَنْ أَبِيهِ أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ يَقُولُجَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَهْلِ نَجْدٍ ثَائِرَ الرَّأْسِ يُسْمَعُ دَوِيُّ صَوْتِهِ وَلَا يُفْقَهُ مَا يَقُولُ حَتَّى دَنَا فَإِذَا هُوَ يَسْأَلُ عَنْ الْإِسْلَامِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ فَقَالَ هَلْ عَلَيَّ غَيْرُهَا قَالَ لَا إِلَّا أَنْ تَطَوَّعَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَصِيَامُ رَمَضَانَ قَالَ هَلْ عَلَيَّ غَيْرُهُ قَالَ لَا إِلَّا أَنْ تَطَوَّعَ قَالَ وَذَكَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الزَّكَاةَ قَالَ هَلْ عَلَيَّ غَيْرُهَا قَالَ لَا إِلَّا أَنْ تَطَوَّعَ قَالَ فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ وَاللَّهِ لَا أَزِيدُ عَلَى هَذَا وَلَا أَنْقُصُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَفْلَحَ إِنْ صَدَقَ",
      "id": "Telah menceritakan kepada kami [Isma'il] Telah menceritakan kepadaku [Malik bin Anas] dari pamannya - [Abu Suhail bin Malik] - dari [bapaknya], bahwa dia mendengar [Thalhah bin 'Ubaidullah] berkata: Telah datang kepada Rasulullah shallallahu 'alaihi wasallam seorang dari penduduk Najed dalam keadaan kepalanya penuh debu dengan suaranya yang keras terdengar, namun tidak dapat dimengerti apa maksud yang diucapkannya, hingga mendekat (kepada Nabi shallallahu 'alaihi wasallam) kemudian dia bertanya tentang Islam, maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Shalat lima kali dalam sehari semalam\". Kata orang itu: \"apakah ada lagi selainnya buatku\". Nabi shallallahu 'alaihi wasallam menjawab: \"Tidak ada kecuali yang thathawu' (sunnat) \". Rasulullah shallallahu 'alaihi wasallam berkata: \"Dan puasa Ramadlan\". Orang itu bertanya lagi: \"Apakah ada lagi selainnya buatku\". Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak ada kecuali yang thathawu' (sunnat) \". Lalu Rasulullah shallallahu 'alaihi wasallam menyebut: \"Zakat\": Kata orang itu: \"apakah ada lagi selainnya buatku\". Rasulullah shallallahu 'alaihi wasallam menjawab: \"Tidak ada kecuali yang thathawu' (sunnat) \". Thalhah bin 'Ubaidullah berkata: Lalu orang itu pergi sambil berkata: \"Demi Allah, aku tidak akan menambah atau menguranginya\". Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dia akan beruntung jika jujur menepatinya\". ",
      "en": "Having told us [Isma'il] had told me [Malik bin Anas] from his uncle - [Abu Suhail bin Malik] - From [his father], that he heard [Thalhah bin 'Ubaidullah] said: Has come to the Prophet sallallaahu' alayhi wasallam a from the resident of Najed in his head full of dustsallallaahu 'alayhi wasallam) then he asked about Islam, then the Prophet sallallaahu' alaihi wasallam replied: \"Prayer five times a day and night\".The person said: \"Is there any more besides him\".The Prophet sallallaahu 'alaihi wasallam replied: \"Nothing except that that that' (sunnat)\".Rasulullah sallallaahu 'alaihi wasallam said: \"And Ramadlan Fasting\".The person asked again: \"Is there any more besides him\".Rasulullah sallallaahu 'alaihi wasallam replied: \"Nothing except that that that' (sunnat)\".Then the Prophet sallallaahu 'alaihi wasallam said: \"zakat\": that person said: \"Is there any more besides for me\".Rasulullah sallallaahu 'alaihi wasallam replied: \"Nothing except that that that' (sunnat)\".Thalhah bin 'Ubaidullah said: Then the person left while saying: \"By Allah, I will not add or reduce it\".So the Prophet sallallaahu 'alayhi wasallam said: \"He will be lucky if honestly adds to it\"."
    }
  },
  {
    "id": "muslim-45",
    "book": "Muslim",
    "source": "HR. Muslim, No. 45",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي حَصِينٍ وَالْأَشْعَثِ بْنِ سُلَيْمٍ أَنَّهُمَا سَمِعَا الْأَسْوَدَ بْنَ هِلَالٍ يُحَدِّثُ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا مُعَاذُ أَتَدْرِي مَا حَقُّ اللَّهِ عَلَى الْعِبَادِ قَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ أَنْ يُعْبَدَ اللَّهُ وَلَا يُشْرَكَ بِهِ شَيْءٌ قَالَ أَتَدْرِي مَا حَقُّهُمْ عَلَيْهِ إِذَا فَعَلُوا ذَلِكَ فَقَالَ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ أَنْ لَا يُعَذِّبَهُمْحَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّاءَ حَدَّثَنَا حُسَيْنٌ عَنْ زَائِدَةَ عَنْ أَبِي حَصِينٍ عَنْ الْأَسْوَدِ بْنِ هِلَالٍ قَالَ سَمِعْتُ مُعَاذًا يَقُولُا دَعَانِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَجَبْتُهُ فَقَالَ هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَلَى النَّاسِ نَحْوَ حَدِيثِهِمْ",
      "id": "Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar], [Ibnu al-Mutsanna] berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abu Hushain] dan [al-Asy'ats bin Sulaim] bahwa keduanya mendengar [al-Aswad bin Hilal] menceritakan dari [Mu'adz bin Jabal] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Wahai Mu'adz, apakah kamu mengetahui apa hak Allah atas hamba?\" Mu'adz menjawab, 'Allah dan Rasul-Nya lebih mengetahui.' Beliau bersabda: \"Yaitu Allah disembah tanpa dengan tidak menyekutukan-Nya dengan sesuatu pun.\" Beliau lalu bersabda lagi: \"Lalu apa hak manusia atas Allah jika mereka melakukan itu?\" Mu'adz menjawab, \"Allah dan Rasul-Nya lebih tahu.\" Beliau lalu bersabda: \"Allah tidak akan menyiksanya.\" Telah menceritakan kepada kami [al Qasim bin Zakariya] telah menceritakan kepada kami [Husain] dari [Zaidah] dari [Abu Hushain] dari [al Aswad bin Hilal] ia berkata; aku mendengar [Mua'dz] berkata, \"Rasulullah shallallahu 'alaihi wasallam memanggilku, lalu aku menjawabnya. Beliau bertanya: \"Apa hak Allah atas manusia…seperti hadits mereka.\"",
      "en": "Has told us [Muhammad bin Al-Mutsanna] and [Ibnu Basysyar], [Ibn al-Mutsanna] said, had told us [Muhammad bin Ja'far] had told us [Syu'bah] from [Abu Hushain] and [al-Asy'ats bin Sulaim] that both of them heard [al-aswad bin Hilal]sallallaahu 'alayhi wasallam said: \"O mu'adz, do you know what the right of Allah to the servant?\"He said: \"that is, God is unrequited by not associating Him with something.\"Aswad bin Hilal] he said;He asked: \"What is God's right to humans ... like their hadith.\""
    }
  },
  {
    "id": "abu-daud-46",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 46",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى حَدَّثَنَا عَنْبَسَةُ بْنُ عَبْدِ الْوَاحِدِ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْتَنُّ وَعِنْدَهُ رَجُلَانِ أَحَدُهُمَا أَكْبَرُ مِنْ الْآخَرِ فَأَوْحَى اللَّهُ إِلَيْهِ فِي فَضْلِ السِّوَاكِ أَنْ كَبِّرْ أَعْطِ السِّوَاكَ أَكْبَرَهُمَاقَالَ أَحْمَدُ هُوَ ابْنُ حَزْمٍ قَالَ لَنَا أَبُو سَعِيدٍ هُوَ ابْنُ الْأَعْرَابِيِّ هَذَا مِمَّا تَفَرَّدَ بِهِ أَهْلُ الْمَدِينَةِ",
      "id": "Telah menceritakan kepada kami [Muhammad bin Isa] telah menceritakan kepada kami ['Anbasah bin Abdul Wahid] dari [Hisyam bin 'Urwah] dari [Ayahnya] dari [Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersiwak sementara di sisi beliau ada dua orang laki-laki yang satu lebih tua daripada yang lain, maka Allah mewahyukan kepada beliau tentang keutamaan bersiwak, untuk memberikan siwak kepada orang yang lebih tua dari keduanya. Ahmad yakni Ibnu Hazm menerangkan; Abu Said yakni Al A'rabi berkata kepada kami; Ini termasuk di antara hadits yang hanya diriwayatkan oleh ahli Madinah.",
      "en": "Having told us [Muhammad bin Isa] had told us ['Anbasah bin Abdul Wahid] from [Hisham bin' Urwah] from [his father] from [Aisyah] he said;Rasulullah sallallaahu 'alayhi wasallam berswhed while on his side there were two men who were one older than the other, so God ignored him about the virtue of being confined, to give siwak to people who were older than both.Ahmad, Ibn Hazm, explained;Abu Said, Al A'rabi, said to us;This is among the hadiths that are only narrated by Medina experts."
    }
  },
  {
    "id": "tirmidzi-47",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 47",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَلَا أَدُلُّكُمْ عَلَى مَا يَمْحُو اللَّهُ بِهِ الْخَطَايَا وَيَرْفَعُ بِهِ الدَّرَجَاتِ قَالُوا بَلَى يَا رَسُولَ اللَّهِ قَالَ إِسْبَاغُ الْوُضُوءِ عَلَى الْمَكَارِهِ وَكَثْرَةُ الْخُطَا إِلَى الْمَسَاجِدِ وَانْتِظَارُ الصَّلَاةِ بَعْدَ الصَّلَاةِ فَذَلِكُمْ الرِّبَاطُو حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ نَحْوَهُ و قَالَ قُتَيْبَةُ فِي حَدِيثِهِ فَذَلِكُمْ الرِّبَاطُ فَذَلِكُمْ الرِّبَاطُ فَذَلِكُمْ الرِّبَاطُ ثَلَاثًا قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عَلِيٍّ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَابْنِ عَبَّاسٍ وَعَبِيدَةَ وَيُقَالُ عُبَيْدَةُ بْنُ عَمْرٍو وَعَائِشَةَ وَعَبْدِ الرَّحْمَنِ بْنِ عَائِشٍ الْحَضْرَمِيِّ وَأَنَسٍ قَالَ أَبُو عِيسَى وَحَدِيثُ أَبِي هُرَيْرَةَ فِي هَذَا الْبَابِ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَلَاءُ بْنُ عَبْدِ الرَّحْمَنِ هُوَ ابْنُ يَعْقُوبَ الْجُهَنِيُّ الْحُرَقِيُّ وَهُوَ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ",
      "id": "telah menceritakan kepada kami [Ali bin Hujr] berkata, telah mengabarkan kepada kami [Isma'il bin Ja'far] dari [Al 'Ala` bin Abdurrahman] dari [Bapaknya] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \" Maukah aku tunjukkan kepada kalian sesuatu yang dapat menghapus kesalahan dan menaikkan derajat?\" para sahabat menjawab, \"Tentu, wahai Rasulullah.\" Beliau bersabda: \"Menyempurnakan shalat disaat yang tidak disukai, memperbanyak langkah menuju masjid dan menunggu shalat setelah shalat. Dan itulah ribath.\" Telah menceritakan kepada kami [Qutaibah] berkata, telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al 'Ala`] sebagaimana hadits tersebut. Qutaibah menyebutkan dalam haditsnya, \"Itulah ribath, itulah ribath, itulah ribath.\" Tiga kali. Abu Isa berkata; \"Dalam bab ini juga ada riwayat dari Ali, Abdullah bin 'Amru, Ibnu Abbas dan Abidah, disebut juga Ubaidah bin Amru, Aisyah, Abdurrahman bin 'A`isy Al Hadlrami, dan Anas.\" Abu Isa berkata; \"Dan hadits Abu Hurairah dalam bab ini adalah hadits yang paling baik dan derajatnya shahih.\" Dan Al 'Ala` bin Abdurrahman adalah Ibnu Ya'qub Al Juhani Al Huraqi, ia adalah seorang yang dapat dipercaya menurut ahli hadits.\"",
      "en": "Has told us [Ali bin Hujr] said, having preached to us [Isma'il bin Ja'far] from [al 'ala` bin Abdurrahman] from [his father] from [Abu Hurairah] that the Prophet sallallaahu' alaihi wasallam said: \"Will I show you something that can erase mistakes and raise degrees?\"The friends answered, \"Of course, O Messenger of Allah.\"He said: \"Perfect prayers at dislikes, multiply steps towards the mosque and wait for prayers after prayer. And that is ribath.\"Having told us [Qutaibah] said, had told us [Abdul Aziz bin Muhammad] from [al 'ala`] as the hadith.Qutaibah mentioned in his hadith, \"That's Ribath, that's Ribath, that's Ribath.\"Three times.Abu Isa said;\"In this chapter there is also a history of Ali, Abdullah bin 'Amru, Ibn Abbas and Abidah, also called Ubaidah bin Amru, Aisyah, Abdurrahman bin' A`isy Al Hadllami, and Anas.\"Abu Isa said;\"And Abu Hurairah's hadith in this chapter is the best hadith and authentic degree.\"And Al 'Ala' bin Abdurrahman is Ibn Ya'qub Al Juhani Al Huraqi, he is a trusted person according to the hadith expert. \""
    }
  },
  {
    "id": "nasai-48",
    "book": "Nasai",
    "source": "HR. Nasai, No. 48",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ عَنْ أَيُّوبَ عَنْ يِحْيَى بْنِ أَبِى كَثِيرٍ عَنْ ابْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَتَنَفَّسَ فِي الْإِنَاءِ وَأَنْ يَمَسَّ ذَكَرَهُ بِيَمِينِهِ وَأَنْ يَسْتَطِيبَ بِيَمِينِهِ",
      "id": "Telah mengabarkan kepada kami [Abdullah bin Muhammad bin Abdurrahman] dia berkata; telah menceritakan kepada kami [Abdul Wahab] dari [Ayyub] dari [Yahya bin Abu Katsir] dari [Ibnu Abu Qatadah] dari [Ayahnya] bahwa Rasulullah shallallahu 'alaihi wasallam melarang (seseorang) bernafas ditempat air minum, menyentuh kemaluan dengan tangan kanannya, dan bersuci dengan tangan kanannya. ",
      "en": "Has reported to us [Abdullah bin Muhammad bin Abdurrahman] he said;Has told us [Abdul Wahab] from [Ayyub] from [Yahya bin Abu Kathir] from [Ibn Abu Qatadah] from [his father] that the Prophet sallallaahu 'alaihi wasallam forbids (someone) to breathe in a drinking water, touching the genitals with his right hand, and purifying with his right hand."
    }
  },
  {
    "id": "ibnu-majah-49",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 49",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ الْحَنَّاطُ عَنْ أَبِي زَيْدٍ عَنْ أَبِي الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَى اللَّهُ أَنْ يَقْبَلَ عَمَلَ صَاحِبِ بِدْعَةٍ حَتَّى يَدَعَ بِدْعَتَهُ",
      "id": "Telah menceritakan kepada kami [Abdullah bin Sa'id] berkata, telah menceritakan kepada kami [Bisyr bin Manshur Al Hannath] dari [Abu Zaid] dari [Abu Al Mughirah] dari [Abdullah bin Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Allah enggan menerima amalan pelaku bid'ah hingga ia meninggalkan kebid'ahannya.\"",
      "en": "Having told us [Abdullah bin Sa'id] said, had told us [Bisyr bin Manshur Al Hannath] from [Abu Zaid] from [Abu Al Mughirah] from [Abdullah bin Abbas] he said;Rasulullah sallallaahu 'alayhi wasallam said: \"Allah is reluctant to accept the practice of the perpetrators of heresy until he leaves his midday.\""
    }
  },
  {
    "id": "bukhari-50",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 50",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا زَكَرِيَّاءُ عَنْ عَامِرٍ قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ الْحَلَالُ بَيِّنٌ وَالْحَرَامُ بَيِّنٌ وَبَيْنَهُمَا مُشَبَّهَاتٌ لَا يَعْلَمُهَا كَثِيرٌ مِنْ النَّاسِ فَمَنْ اتَّقَى الْمُشَبَّهَاتِ اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ وَمَنْ وَقَعَ فِي الشُّبُهَاتِ كَرَاعٍ يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يُوَاقِعَهُ أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى أَلَا إِنَّ حِمَى اللَّهِ فِي أَرْضِهِ مَحَارِمُهُ أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إِذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ وَإِذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ أَلَا وَهِيَ الْقَلْبُ",
      "id": "Telah menceritakan kepada kami [Abu Nu'aim] Telah menceritakan kepada kami [Zakaria] dari ['Amir] berkata; aku mendengar [An Nu'man bin Basyir] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Yang halal sudah jelas dan yang haram juga sudah jelas. Namun diantara keduanya ada perkara syubhat (samar) yang tidak diketahui oleh banyak orang. Maka barangsiapa yang menjauhi diri dari yang syubhat berarti telah memelihara agamanya dan kehormatannya. Dan barangsiapa yang sampai jatuh (mengerjakan) pada perkara-perkara syubhat, sungguh dia seperti seorang penggembala yang menggembalakan ternaknya di pinggir jurang yang dikhawatirkan akan jatuh ke dalamnya. Ketahuilah bahwa setiap raja memiliki batasan, dan ketahuilah bahwa batasan larangan Allah di bumi-Nya adalah apa-apa yang diharamkan-Nya. Dan ketahuilah pada setiap tubuh ada segumpal darah yang apabila baik maka baiklah tubuh tersebut dan apabila rusak maka rusaklah tubuh tersebut. Ketahuilah, ia adalah hati\". ",
      "en": "Having told us [Abu Nu'aim] had told us [Zakaria] from ['Amir] saying;I heard [an Nu'man bin Basyir] say;I heard the Prophet sallallaahu 'alaihi wasallam said: \"The halal is clear and the haram is also clear. But between the two there are cases of syubhat (vague) that are not known by many people.His livestock is feared to fall into it."
    }
  },
  {
    "id": "muslim-51",
    "book": "Muslim",
    "source": "HR. Muslim, No. 51",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا جَرِيرٌ عَنْ سُهَيْلٍ عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْإِيمَانُ بِضْعٌ وَسَبْعُونَ أَوْ بِضْعٌ وَسِتُّونَ شُعْبَةً فَأَفْضَلُهَا قَوْلُ لَا إِلَهَ إِلَّا اللَّهُ وَأَدْنَاهَا إِمَاطَةُ الْأَذَى عَنْ الطَّرِيقِ وَالْحَيَاءُ شُعْبَةٌ مِنْ الْإِيمَانِ",
      "id": "Telah menceritakan kepada kami [Zuhair bin Harb] telah menceritakan kepada kami [Jarir] dari [Suhail] dari [Abdullah bin Dinar] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Iman itu ada tujuh puluh tiga sampai tujuh puluh sembilan, atau enam puluh tiga sampai enam puluh sembilan cabang. Yang paling utama adalah perkataan, LAA ILAAHA ILLALLAHU (Tidak ada tuhan yang berhak disembah selain Allah). Dan yang paling rendah adalah menyingkirkan gangguan dari jalan. Dan malu itu adalah sebagian dari iman.\"",
      "en": "Has told us [Zuhair bin Harb] had told us [Jarir] from [Suhail] from [Abdullah bin Dinar] from [Abu Shalih] from [Abu Hurairah] he said, \"Rasulullah sallallaahu 'alaihi wasallam said:\" That faith is seventy -three to seventy -nine, or sixty three to sixty nine branches.The most important thing is the words, laa ilaaha illallahu (no God has the right to be worshiped other than Allah).And the lowest is to get rid of interference from the road.And shame is part of faith. \""
    }
  },
  {
    "id": "abu-daud-52",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 52",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ حَدَّثَنَا هَمَّامٌ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ أُمِّ مُحَمَّدٍ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَرْقُدُ مِنْ لَيْلٍ وَلَا نَهَارٍ فَيَسْتَيْقِظُ إِلَّا تَسَوَّكَ قَبْلَ أَنْ يَتَوَضَّأَ",
      "id": "Telah menceritakan kepada kami [Muhammad bin Katsir] telah menceritakan kepada kami [Hammam] dari [Ali bin Zaid] dari [Ummu Muhammad] dari [Aisyah] bahwasanya Nabi shallallahu 'alaihi wasallam tidaklah bangun dari tidurnya baik malam maupun siang, kecuali beliau bersiwak dahulu sebelum beliau berwudhu. ",
      "en": "Having told us [Muhammad bin Kathir] had told us [Hammam] from [Ali bin Zaid] from [Ummu Muhammad] from [Aisyah] that the Prophet sallallaahu 'alaihi wasallam did not wake up from his sleep both at night and noon, unless he was on before he was ablution."
    }
  },
  {
    "id": "tirmidzi-53",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 53",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا سَلَمَةُ بْنُ الْفَضْلِ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ حُمَيْدٍ عَنْ أَنَسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَوَضَّأُ لِكُلِّ صَلَاةٍ طَاهِرًا أَوْ غَيْرَ طَاهِرٍقَالَ قُلْتُ لِأَنَسٍ فَكَيْفَ كُنْتُمْ تَصْنَعُونَ أَنْتُمْ قَالَ كُنَّا نَتَوَضَّأُ وُضُوءًا وَاحِدًا قَالَ أَبُو عِيسَى وَحَدِيثُ حُمَيْدٍ عَنْ أَنَسٍ حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَالْمَشْهُورُ عَنْدَ أَهْلِ الْحَدِيثِ حَدِيثُ عَمْرِو بْنِ عَامِرٍ الْأَنْصَارِيِّ عَنْ أَنَسٍ وَقَدْ كَانَ بَعْضُ أَهْلِ الْعِلْمِ يَرَى الْوُضُوءَ لِكُلِّ صَلَاةٍ اسْتِحْبَابًا لَا عَلَى الْوُجُوبِ",
      "id": "telah menceritakan kepada kami [Muhammad bin Humaid Ar Razi] berkata, telah menceritakan kepada kami [Salamah Ibnul Fadll] dari [Muhammad bin Ishaq] dari [Humaid] dari [Anas] berkata; \"Nabi shallallahu 'alaihi wasallam selalu berwudlu ketika akan shalat, baik dalam keadaan suci atau tidak.\" Humaid berkata; Aku berkata kepada Anas; \"Lalu bagaimana dengan kalian, apa yang kalian lakukan?\" ia menjawab, \"Kami hanya berwudlu sekali.\" Abu Isa berkata; \"Hadits Humaid dari Anas derajatnya hasan gharib dari sisi ini. Tetapi yang mashur menurut ahli hadits adalah hadits 'Amru bin 'Amir Al Anshari. Dan sebagian ahli ilmu berpendapat bahwa wudlu setiap akan melakukan shalat adalah dianjurkan, bukan diwajibkan.",
      "en": "Having told us [Muhammad bin Humaid Ar Razi] said, had told us [Salamah Ibnul Fadll] from [Muhammad bin Ishaq] from [Humaid] from [Anas] said;\"Prophet sallallaahu 'alaihi wasallam always ablution when praying, whether in a holy state or not.\"Humaid said;I said to Anas;\"Then what about you guys, what are you doing?\"He replied, \"We are only very ablution.\"Abu Isa said;\"Humaid's hadith from Anas degrees Hasan Gharib from this side. But what Mashur according to the Hadith expert is the hadith 'Amru bin' Amir Al Anshari. And some experts are of the opinion that each word will pray is recommended, not required."
    }
  },
  {
    "id": "nasai-54",
    "book": "Nasai",
    "source": "HR. Nasai, No. 54",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا قُتَيْبَةُ قَالَ حَدَّثَنَا عَبِيدَةُ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَنَسٍ قَالَبَالَ أَعْرَابِيُّ فِي الْمَسْجِدِ فَأَمَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِدَلْوٍ مِنْ مَاءٍ فَصُبَّ عَلَيْهِ",
      "id": "Telah mengabarkan kepada kami [Qutaibah] dia berkata; telah menceritakan kepada kami [Ubaidah] dari [Yahya bin Sa'id] dari [Anas bin Malik] dia berkata; \"Seorang Badui buang air kecil di masjid, lalu Rasulullah shallallahu 'alaihi wasallam menyuruh untuk mengambil seember air dan disiramkannya.\"",
      "en": "Has reported to us [Qutaibah] he said;had told us [Ubaidah] from [Yahya bin Sa'id] from [Anas bin Malik] he said;\"A Bedouin urinating in the mosque, then the Prophet sallallaahu 'alaihi wasallam told to take a bucket of water and splash it.\""
    }
  },
  {
    "id": "ibnu-majah-55",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 55",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ حَدَّثَنَا ابْنُ أَبِي الرِّجَالِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو الْأَوْزَاعِيِّ عَنْ عَبْدَةَ بْنِ أَبِي لُبَابَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَمْ يَزَلْ أَمْرُ بَنِي إِسْرَائِيلَ مُعْتَدِلًا حَتَّى نَشَأَ فِيهِمْ الْمُوَلَّدُونَ أَبْنَاءُ سَبَايَا الْأُمَمِ فَقَالُوا بِالرَّأْيِ فَضَلُّوا وَأَضَلُّوا",
      "id": "Telah menceritakan kepada kami [Suwaid bin Sa'id] berkata, telah menceritakan kepada kami [Ibnu Abu Ar Rijal] dari [Abdurrahman bin 'Amru Al Auza'i] dari ['Abdah bin Abu Lubabah] dari [Abdullah bin 'Amru bin Al 'Ash] ia berkata; Aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \" Urusan bani Isra`il masih tetap stabil hingga muncul keturunan-keturunan yang lahir dari para tawanan. Mereka berpendapat dengan menggunakan logika sehingga mereka sesat dan menyesatkan.\"",
      "en": "Having told us [Suwaid bin Sa'id] said, had told us [Ibn Abu Ar Rijal] from [Abdurrahman bin 'Amru Al Auza'i] from [' Abdah bin Abu Lubabah] from [Abdullah bin 'Amru bin Al' Ash] he said;I heard the Prophet sallallaahu 'alaihi wasallam said: \"The affairs of the Children of Isra`il are still stable until they appear descendants born from prisoners. They argue by using logic so that they are misguided and misleading.\""
    }
  },
  {
    "id": "bukhari-56",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 56",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو النُّعْمَانِ قَالَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ زِيَادِ بْنِ عِلَاقَةَ قَالَ سَمِعْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ يَقُولُيَوْمَ مَاتَ الْمُغِيرَةُ بْنُ شُعْبَةَ قَامَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ عَلَيْكُمْ بِاتِّقَاءِ اللَّهِ وَحْدَهُ لَا شَرِيكَ لَهُ وَالْوَقَارِ وَالسَّكِينَةِ حَتَّى يَأْتِيَكُمْ أَمِيرٌ فَإِنَّمَا يَأْتِيكُمْ الْآنَ ثُمَّ قَالَ اسْتَعْفُوا لِأَمِيرِكُمْ فَإِنَّهُ كَانَ يُحِبُّ الْعَفْوَ ثُمَّ قَالَ أَمَّا بَعْدُ فَإِنِّي أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ أُبَايِعُكَ عَلَى الْإِسْلَامِ فَشَرَطَ عَلَيَّ وَالنُّصْحِ لِكُلِّ مُسْلِمٍ فَبَايَعْتُهُ عَلَى هَذَا وَرَبِّ هَذَا الْمَسْجِدِ إِنِّي لَنَاصِحٌ لَكُمْ ثُمَّ اسْتَغْفَرَ وَنَزَلَ",
      "id": "Telah menceritakan kepada kami [Abu An Nu'man] berkata, telah menceritakan kepada kami [Abu 'Awanah] dari [Ziyad bin 'Alaqah] berkata; saya mendengar [Jarir bin Abdullah] berkata ketika Al Mughirah bin Syu'bah meninggal, sambil berdiri dia memuji Allah dan mensucikan-Nya, berkata: \"Wajib atas kalian bertakwa kepada Allah satu-satunya dan tidak menyekutukannya, dan dengan penuh ketundukan dan ketenangan sampai datang pemimpin pengganti, dan sekarang datang penggantinya, \" kemudian dia berkata: \"Mintakanlah maaf kepada Allah Subhanahu wa Ta'ala buat pemimpin kalian ini (Al Mughirah), karena dia suka memberi maaf.\" Lalu berkata: \"Amma ba'du, sesungguhnya aku mendatangi Nabi shallallahu 'alaihi wasallam kemudian aku berkata: \"Aku membai'at engkau untuk Islam\". Lalu Nabi shallallahu 'alaihi wasallam memberi syarat dan menasehati kepada setiap muslim, maka aku membai'at Beliau untuk perkara itu, dan demi Pemilik Masjid ini, sungguh aku akan selalu memberi nasihat kepada kalian\" Kemudian dia beristighfar lalu turun dari mimbar. ",
      "en": "Having told us [Abu An Nu'man] said, had told us [Abu 'Awaah] from [Ziyad bin' alaqah] saying;I heard [Jarir bin Abdullah] said when Al Mughirah bin Syu'bah died, while standing he praised God and purified Him, said: \"Obligatory for you to be aware of God the only one and not associate it, and with full of submission and calm until the substitute leader came, and now he came,\" then he said: \"Then said: \"Amma ba'du, in fact I went to the Prophet sallallaahu 'alaihi wasallam then I said:\" I ambai'at you for Islam \"."
    }
  },
  {
    "id": "muslim-57",
    "book": "Muslim",
    "source": "HR. Muslim, No. 57",
    "narrator": "N/A",
    "text": {
      "arab": "و حَدَّثَنَا أَبُو الطَّاهِرِ أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ سَرْحٍ الْمِصْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الْخَيْرِ أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ يَقُولُاإِنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْمُسْلِمِينَ خَيْرٌ قَالَ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ",
      "id": "Telah menceritakan kepada kami [Abu ath-Thahir Ahmad bin Amru bin Abdullah bin Amru bin Sarh al-Mishri] telah mengabarkan kepada kami [Ibnu Wahab] dari [Amru bin al-Harits] dari [Yazid bin Abu Habib] dari [Abu al-Khair] bahwa dia mendengar [Abdullah bin Amru bin al-Ash] keduanya berkata, \"Sesungguhnya seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam, \"Muslim yang bagaimana yang paling baik?\" Beliau menjawab: \"Yaitu seorang Muslim yang orang lain merasa aman dari gangguan lisan dan tangannya.\"",
      "en": "Has told us [Abu Ath-Thahir Ahmad bin Amru bin Abdullah bin Amru bin Sarh Al-Mishri] had preached to us [Ibn Wahab] from [Amru bin al-Harits] from [Yazid bin Abu Habib] from [Abu al-Khair] that he heard [Abdullah bin Amru bin al-Ashi]Wasallam, \"What is the best Muslim?\""
    }
  },
  {
    "id": "abu-daud-58",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 58",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ وَالْحَسَنُ بْنُ عَلِيٍّ وَغَيْرُهُمْ قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ الْوَلِيدِ بْنِ كَثِيرٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرِ بْنِ الزُّبَيْرِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الْمَاءِ وَمَا يَنُوبُهُ مِنْ الدَّوَابِّ وَالسِّبَاعِ فَقَالَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَ الْمَاءُ قُلَّتَيْنِ لَمْ يَحْمِلْ الْخَبَثَقَالَ أَبُو دَاوُد وَهَذَا لَفْظُ ابْنُ الْعَلَاءِ و قَالَ عُثْمَانُ وَالْحَسَنُ بْنُ عَلِيٍّ عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ قَالَ أَبُو دَاوُد وَهُوَ الصَّوَابُ حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ ح و حَدَّثَنَا أَبُو كَامِلٍ حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ قَالَ أَبُو كَامِلٍ ابْنُ الزُّبَيْرِ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سُئِلَ عَنْ الْمَاءِ يَكُونُ فِي الْفَلَاةِ فَذَكَرَ مَعْنَاهُ",
      "id": "Telah menceritakan kepada kami [Muhammad bin Al 'Ala] dan [Utsman bin Abi Syaibah] dan [Al Hasan bin Ali] dan yang lainnya, mereka berkata; Telah menceritakan kepada kami [Abu Usamah] dari [Al Walid bin Katsir] dari [Muhammad bin Ja'far bin Az Zubair] dari [Abdullah bin Abdullah bin Umar] dari [Ayahnya], dia berkata; Rasulullah shallallahu 'alaihi wasallam ditanya tentang air dan (lokasi) air yang selalu didatangi binatang melata dan binatang buas, maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila air itu dua qullah, maka ia tidak najis.\" Abu Dawud berkata; Ini adalah lafazh Ibnu Al 'Ala (yakni, di dalam sanadnya terdapat rawi bernama Muhammad bin Ja'far bin Az Zubair). Sedangkan [Utsman] dan [Al Hasan bin Ali] menyebutkan dari [Muhammad bin 'Abbad bin Ja'far] (sebagai ganti Muhammad bin Ja'far bin Az Zubair). Abu Dawud berkata; Itulah yang benar. Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad], dan menurut jalur yang lain; telah menceritakan kepada kami [Abu Kamil] telah menceritakan kepada kami [Yazid, yakni Ibnu Zurai'] dari [Muhammad bin Ishaq] dari [Muhammad bin Ja'far]. Abu Kamil Ibnu Az Zubair berkata; dari [Ubaidillah bin Abdullah bin Umar] dari [Ayahnya] bahwasanya Rasulullah shallallahu 'alaihi wasallam ditanya tentang air di tanah lapang, lalu dia menyebutkan hadits yang semakna dengan yang pertama. ",
      "en": "Has told us [Muhammad bin Al 'ala] and [Uthman bin Abi Syaibah] and [Al Hasan bin Ali] and others, they said;Has told us [Abu Usamah] from [Al Walid bin Kathir] from [Muhammad bin Ja'far bin Az Zubair] from [Abdullah bin Abdullah bin Umar] from [his father], he said;Rasulullah sallallaahu 'alayhi wasallam was asked about water and (location) of water that was always visited by reptiles and wild animals, then the Prophet sallallaahu' alaihi wasallam said: \"If the water is two qullah, then he is not unclean.\"Abu Dawud said;This is Lafazh Ibnu Al 'Ala (ie, in his sanad there is a rawi named Muhammad bin Ja'far bin Az Zubair).Whereas [Uthman] and [Al Hasan bin Ali] mentioned from [Muhammad bin 'Abbad bin Ja'far] (instead of Muhammad bin Ja'far bin Az Zubair).Abu Dawud said;That's right.Having told us [Musa bin Isma'il] had told us [Hammad], and according to other paths;Has told us [Abu Kamil] had told us [Yazid, namely Ibn Zurai '] from [Muhammad bin Ishaq] from [Muhammad bin Ja'far].Abu Kamil Ibnu Az Zubair said;From [Ubaidillah bin Abdullah bin Umar] from [his father] that the Prophet sallallaahu 'alaihi wasallam was asked about water in the field, then he mentioned the hadith that was the first."
    }
  },
  {
    "id": "tirmidzi-59",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 59",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمَحْمُودُ بْنُ غَيْلَانَ قَالَا حَدَّثَنَا أَبُو دَاوُدَ عَنْ شُعْبَةَ عَنْ عَاصِمٍ قَال سَمِعْتُ أَبَا حَاجِبٍ يُحَدِّثُ عَنْ الْحَكَمِ بْنِ عَمْرٍو الْغِفَارِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى أَنْ يَتَوَضَّأَ الرَّجُلُ بِفَضْلِ طَهُورِ الْمَرْأَةِ أَوْ قَالَ بِسُؤْرِهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَأَبُو حَاجِبٍ اسْمُهُ سَوَادَةُ بْنُ عَاصِمٍ و قَالَ مُحَمَّدُ بْنُ بَشَّارٍ فِي حَدِيثِهِ نَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَوَضَّأَ الرَّجُلُ بِفَضْلِ طَهُورِ الْمَرْأَةِ وَلَمْ يَشُكَّ فِيهِ مُحَمَّدُ بْنُ بَشَّارٍ",
      "id": "telah menceritakan kepada kami [Muhammad bin Basysyar] dan [Muhammad bin Ghailan] mereka berkata; telah menceritakan kepada kami [Abu Dawud] dari [Syu'bah] dari ['Ashim] berkata; Aku mendengar [Abu Hajib] menceritakan dari [Al Hakam bin 'Amru Al Ghifari] bahwa Nabi shallallahu 'alaihi wasallam melarang seorang laki-laki berwudlu dengan air sisa bersucinya wanita, atau ia mengatakan; \"Air sisa yang masih di dalam bejananya.\" Abu Isa berkata; \"Ini adalah hadits hasan. Dan Abu Hajib namanya adalah Sawadah bin 'Ashim.\" Muhammad bin Basysyar menyebutkan dalam haditsnya; \"Rasulullah shallallahu 'alaihi wasallam melarang seorang laki-laki berwudlu dengan air sisa bersucinya seorang wanita, \" dan Muhammad bin Basysyar tidak ragu di dalamnya.",
      "en": "Has told us [Muhammad bin Basysyar] and [Muhammad bin Ghailan] they said;Has told us [Abu Dawud] from [Syu'bah] from ['Ashim] said;I heard [Abu Hajib] tell from [Al Hakam bin 'Amru Al Ghifari] that the Prophet sallallaahu' alaihi wasallam forbids a man of ablution with the remaining water of the surname of a woman, or he said;\"The remaining water is still in the bejan.\"Abu Isa said;\"This is Hasan's hadith. And Abu Hajib's name is Sawadah bin 'Ashim.\"Muhammad bin Basysyar mentioned in his hadith;\"Rasulullah sallallaahu 'alayhi wasallam forbade a man of ablution with the remaining water of a woman,\" and Muhammad bin Basysyar did not hesitate in it."
    }
  },
  {
    "id": "nasai-60",
    "book": "Nasai",
    "source": "HR. Nasai, No. 60",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَفْتَحَ الصَّلَاةَ سَكَتَ هُنَيْهَةً فَقُلْتُ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ مَا تَقُولُ فِي سُكُوتِكَ بَيْنَ التَّكْبِيرِ وَالْقِرَاءَةِ قَالَ أَقُولُ اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنْ الدَّنَسِ اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ",
      "id": "Telah mengabarkan kepada kami [Ali bin Hujr] dia berkata; telah menceritakan kepada kami [Jarir] dari [Umarah bin Al Qa'qa] dari [Abu Zur'ah bin Amr bin Jarir] dari [Abu Hurairah] dia berkata; \"Apabila Rasulullah shallallahu 'alaihi wasallam memulai shalat, beliau diam beberapa saat. Aku lalu bertanya kepadanya, 'Ayah dan Ibuku sebagai jaminan wahai Rasulullah shallallahu 'alaihi wasallam, apa yang kamu ucapkan tatkala berdiam antara takbir dan bacaan (Al-Fatihah)? 'Beliau shallallahu 'alaihi wasallam menjawab, 'Aku membaca, \" Ya Allah, jauhkan antara aku dan kesalahanku sebagaimana Engkau jauhkan antara timur dan barat. Ya Allah bersihkan (sucikan) dariku kesalahanku sebagaimana Engkau bersihkan (sucikan) baju yang putih dari kotoran. Ya Allah cucilah (bersihkanlah) aku dari kesalahan-kesalahanku dengan salju, air, dan embun.\" ",
      "en": "Has reported to us [Ali bin Hujr] he said;had told us [jarir] from [ularah bin al qa'qa] from [Abu Zur'ah bin Amr bin Jarir] from [Abu Hurairah] he said;\"If the Prophet sallallaahu 'alaihi wasallam started prayer, he was silent for a few moments. I then asked him,' my father and mother as guaranteed by the Prophet sallallaahu 'alayhi wasallam, what do you say when you stay between takbir and reading (al-fatihah)?'You keep it between the east and west.O God, clean (benered) from me my mistakes as you clean (holy) white clothes from dirt.O Allah, wash (clean) me from my mistakes with snow, water, and dew. \""
    }
  },
  {
    "id": "ibnu-majah-61",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 61",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ حَدَّثَنَا عَلِيُّ بْنُ نِزَارٍ عَنْ أَبِيهِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِنْفَانِ مِنْ هَذِهِ الْأُمَّةِ لَيْسَ لَهُمَا فِي الْإِسْلَامِ نَصِيبٌ الْمُرْجِئَةُ وَالْقَدَرِيَّةُ",
      "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Muhammad bin Fudlail] berkata, telah menceritakan kepada kami [Ali bin Nizar] dari [Bapaknya] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Ada dua golongan dari umat ini yang bukan bagian dari Islam; yaitu Murji`ah dan Qadariyah.\"",
      "en": "Having told us [Ali bin Muhammad] said, having told us [Muhammad bin Fudlail] said, had told us [Ali bin Nizar] from [his father] from [Ikrimah] from [Ibnu Abbas] he said;Rasulullah sallallaahu 'alayhi wasallam said: \"There are two groups of this people who are not part of Islam; namely Murji`ah and Qadariyah.\""
    }
  },
  {
    "id": "bukhari-62",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 62",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ قَالَ حَدَّثَنِي إِبْرَاهِيمُ بْنُ سَعْدٍ عَنْ صَالِحٍ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ بِكِتَابِهِ رَجُلًا وَأَمَرَهُ أَنْ يَدْفَعَهُ إِلَى عَظِيمِ الْبَحْرَيْنِ فَدَفَعَهُ عَظِيمُ الْبَحْرَيْنِ إِلَى كِسْرَى فَلَمَّا قَرَأَهُ مَزَّقَهُفَحَسِبْتُ أَنَّ ابْنَ الْمُسَيَّبِ قَالَ فَدَعَا عَلَيْهِمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُمَزَّقُوا كُلَّ مُمَزَّقٍ",
      "id": "Telah menceritakan kepada kami [Isma'il bin Abdullah] berkata, telah menceritakan kepadaku [Ibrahim bin Sa'd] dari [Shalih] dari [Ibnu Syihab] dari [Ubaidullah bin Abdullah bin Utbah bin Mas'ud] bahwa [Abdullah bin 'Abbas] telah mengabarkannya, bahwa Nabi shallallahu 'alaihi wasallam telah mengutus seseorang dengan membawa surat dan memerintahkan kepadanya untuk memberikan surat tersebut kepada Pemimpin Bahrain. Lalu Pemimpin Bahrain itu memberikannya kepada Kisra. Tatkala dibaca, surat itu dirobeknya. Aku mengira kemudian [Ibnu Musayyab] berkata; lalu Rasulullah shallallahu 'alaihi wasallam berdoa agar mereka (kekuasaannya) dirobek-robek sehancur-hancurnya. ",
      "en": "Having told us [Isma'il bin Abdullah] said, had told me [Ibrahim bin Sa'd] from [Shalih] from [Ibn Syihab] from [Ubaidullah bin Abdullah bin Utbah bin Mas'ud] that [Abdullah bin 'Abbas] had reported it, that the Prophet sallallaahu' alaihi wasallam had sent someone by bringing someone to give the letter to give the letter to the leader.Then the Bahrain leader gave it to Kisra.When he was read, the letter was torn.I thought later [Ibn Musayyab] said;Then the Prophet sallallaahu 'alaihi wasallam prayed that they (his power) were torn apart as crushed."
    }
  },
  {
    "id": "muslim-63",
    "book": "Muslim",
    "source": "HR. Muslim, No. 63",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ قَالَ سَمِعْتُ قَتَادَةَ يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَلَدِهِ وَوَالِدِهِ وَالنَّاسِ أَجْمَعِينَ",
      "id": "Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] dan [Ibnu Basysyar] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dia berkata, saya mendengar [Qatadah] menceritakan hadits dari [Anas bin Malik] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah salah seorang dari kalian beriman hingga aku lebih dia cintai daripada anaknya, orang tuanya dan manusia semuanya.\"",
      "en": "Has told us [Muhammad bin Al-Mutsanna] and [Ibnu Basysyar] both said, had told us [Muhammad bin Ja'far] had told us [Syu'bah] he said, I heard [Qatadah] tell the hadith from [Anas bin Malik] he said, \"Rasulullah sallallaahu 'alaihi wasallam said:\"and all humans. \""
    }
  },
  {
    "id": "abu-daud-64",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 64",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ مُحَمَّدِ بْنِ عَجْلَانَ قَالَ سَمِعْتُ أَبِي يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبُولَنَّ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَلَا يَغْتَسِلُ فِيهِ مِنْ الْجَنَابَةِ",
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Muhammad bin 'Ajlan] dia berkata; Saya mendengar [bapakku] menceritakan hadits dari [Abu Hurairah], dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah salah seorang dari kalian kencing di air yang menggenang dan janganlah dia mandi janabah di tempat tersebut.\"",
      "en": "Having told us [Musaddad] had told us [Yahya] from [Muhammad bin 'Ajlan] he said;I heard [my father] telling the hadith from [Abu Hurairah], he said;Rasulullah sallallaahu 'alayhi wasallam said: \"Don't be one of you urinating in stagnant water and do not take a shower Janabah in that place.\""
    }
  },
  {
    "id": "tirmidzi-65",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 65",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا هَنَّادٌ وَقُتَيْبَةُ وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ قَال سَمِعْتُ مُجَاهِدًا يُحَدِّثُ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَرَّ عَلَى قَبْرَيْنِ فَقَالَ إِنَّهُمَا يُعَذَّبَانِ وَمَا يُعَذَّبَانِ فِي كَبِيرٍ أَمَّا هَذَا فَكَانَ لَا يَسْتَتِرُ مِنْ بَوْلِهِ وَأَمَّا هَذَا فَكَانَ يَمْشِي بِالنَّمِيمَةِقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَأَبِي مُوسَى وَعَبْدِ الرَّحْمَنِ بْنِ حَسَنَةَ وَزَيْدِ بْنِ ثَابِتٍ وَأَبِي بَكْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَرَوَى مَنْصُورٌ هَذَا الْحَدِيثَ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍ وَلَمْ يَذْكُرْ فِيهِ عَنْ طَاوُسٍ وَرِوَايَةُ الْأَعْمَشِ أَصَحُّ قَالَ و سَمِعْت أَبَا بَكْرٍ مُحَمَّدَ بْنَ أَبَانَ الْبَلْخِيَّ مُسْتَمْلِي وَكِيعٍ يَقُولُ سَمِعْتُ وَكِيعًا يَقُولُ الْأَعْمَشُ أَحْفَظُ لِإِسْنَادِ إِبْرَاهِيمَ مِنْ مَنْصُورٍ",
      "id": "telah menceritakan kepada kami [Hannad] dan [Qutaibah] dan [Abu Kuraib] mereka berkata; telah menceritakan kepada kami [Waki'] dari [Al A'masy] ia berkata; aku mendengar [Mujahid] menceritakan dari [Thawus] dari [Ibnu Abbas] berkata; Nabi shallallahu 'alaihi wasallam melewati dua kuburan, kemudian beliau bersabda: \" Keduanya sedang disiksa, dan mereka disiksa bukan karena dosa besar. Yang ini disiksa karena tidak menutup diri ketika kencing, dan yang satu lagi karena mengadu domba.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih.\" Dan [Manshur] meriwayatkan hadits ini dari [Mujahid], dari [Ibnu Abbas], namun dia tidak menyebutkan dari Thawus. Sedangkan hadits riwayat Al A'masy lebih shahih. Ia berkata; \"Aku mendengar Abu Bakr bin Abn Al Balkhi -orang yang minta dibacakan oleh Waki'- berkata; \"Al A'masy lebih hafal dengan sanad Ibrahim daripada Manshur.\"",
      "en": "Has told us [Hannad] and [Qutaibah] and [Abu Kuraib] they said;Has told us [Waki '] from [Al A'masy] he said;I heard [Mujahid] tell from [Thawus] from [Ibn Abbas] saying;The Prophet sallallaahu 'alaihi wasallam passed through two graves, then he said: \"Both of them are being tortured, and they are tortured not because of a big sin. This one is tortured for not closing themselves when urinating, and the other for pitting sheep.\"Abu Isa said;\"This hadith is the degree of Hasan Sahih.\"And [Manshur] narrated this hadith from [Mujahid], from [Ibn Abbas], but he did not mention from Thawus.Whereas the Hadith of Al A'masy's history is more authentic.He said;\"I heard Abu Bakr bin Abn Al Balkhi - a person who asked to be read by Waki'- said;\" Al A'Masy is more memorized with Sanad Ibrahim than Manshur. \""
    }
  },
  {
    "id": "nasai-66",
    "book": "Nasai",
    "source": "HR. Nasai, No. 66",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ قَالَ حَدَّثَنَا خَالِدٌ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي التَّيَّاحِ قَالَ سَمِعْتُ مُطَرِّفًا عَنْ عَبْدِ اللَّهِ بْنِ الْمُغَفَّلِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِقَتْلِ الْكِلَابِ وَرَخَّصَ فِي كَلْبِ الصَّيْدِ وَالْغَنَمِ وَقَالَ إِذَا وَلَغَ الْكَلْبُ فِي الْإِنَاءِ فَاغْسِلُوهُ سَبْعَ مَرَّاتٍ وَعَفِّرُوهُ الثَّامِنَةَ بِالتُّرَابِ",
      "id": "Telah mengabarkan kepada kami [Muhammad bin Abdul A'la As-Shan'ani] dia berkata; telah menceritakan kepada kami [Khalid] telah menceritakan kepada kami [Syu'bah] dari [Abu Tayyah] dia berkata; \"Saya mendengar [Mutharrif] dari [Abdullah bin Mughaffal], bahwa Rasulullah shallallahu 'alaihi wasallam memerintahkan untuk membunuh anjing dan memberi rukhsah (keringanan) pada anjing yang dipakai untuk berburu serta menjaga kambing. Beliau kemudian bersabda, \"Apabila ada anjing yang menjilat bejana kalian, basuhlah tujuh kali dan kedelapan kalinya dilumuri dengan tanah.\"",
      "en": "Has reported to us [Muhammad bin Abdul A'la As-Shan'ani] he said;Having told us [Khalid] had told us [Syu'bah] from [Abu Tayyah] he said;\"I heard [Mutharrif] from [Abdullah bin Mughaffal], that the Prophet sallallaahu 'alaihi wasallam ordered to kill dogs and give rukhsah (relief) to dogs used to hunt and guard goats."
    }
  },
  {
    "id": "ibnu-majah-67",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 67",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ وَأَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ لَا تَدْخُلُوا الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَوَ لَا أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ",
      "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] berkata, telah menceritakan kepada kami [Waki'] dan [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, kalian tidak akan masuk surga hingga kalian beriman, dan kalian tidak akan beriman hingga kalian saling mencintai. Maukah aku tunjukkan kepada kalian suatu amalan jika kalian amalkan maka kalian akan saling mencintai? sebarkanlah salam di antara kalian.\"",
      "en": "Having told us [Abu Bakr bin Abu Syaibah] said, had told us [Waki '] and [Abu Mu'awiyah] from [Al A'masy] from [Abu Shalih] from [Abu Hurairah] he said;Rasulullah sallallaahu 'alayhi wasallam said: \"For the sake of the essence that my soul is in His hands, you will not go to heaven until you believe, and you will not believe until you love each other. Will I show you a practice if you practice then you will love each other? Spread the greetings between you.\""
    }
  },
  {
    "id": "bukhari-68",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 68",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ قَالَ حَدَّثَنَا جَرِيرٌ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ قَالَ كَانَ عَبْدُ اللَّهِيُذَكِّرُ النَّاسَ فِي كُلِّ خَمِيسٍ فَقَالَ لَهُ رَجُلٌ يَا أَبَا عَبْدِ الرَّحْمَنِ لَوَدِدْتُ أَنَّكَ ذَكَّرْتَنَا كُلَّ يَوْمٍ قَالَ أَمَا إِنَّهُ يَمْنَعُنِي مِنْ ذَلِكَ أَنِّي أَكْرَهُ أَنْ أُمِلَّكُمْ وَإِنِّي أَتَخَوَّلُكُمْ بِالْمَوْعِظَةِ كَمَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَخَوَّلُنَا بِهَا مَخَافَةَ السَّآمَةِ عَلَيْنَا",
      "id": "Telah menceritakan kepada kami [Utsman bin Abu Syaibah] berkata, telah menceritakan kepada kami [Jarir] dari [Manshur] dari [Abu Wa'il] berkata; bahwa [Abdullah] memberi pelajaran kepada orang-orang setiap hari Kamis, kemudian seseorang berkata: \"Wahai Abu Abdurrahman, sungguh aku ingin kalau anda memberi pelajaran kepada kami setiap hari\" dia berkata: \"Sungguh aku enggan melakukannya, karena aku takut membuat kalian bosan, dan aku ingin memberi pelajaran kepada kalian sebagaimana Nabi shallallahu 'alaihi wasallam memberi pelajaran kepada kami karena khawatir kebosanan akan menimpa kami\". ",
      "en": "Having told us [Uthman bin Abu Syaibah] said, had told us [Jarir] from [Manshur] from [Abu Wa'il] said;that [Abdullah] gave lessons to people every Thursday, then someone said: \"O Abu Abdurrahman, I really want to give us a lesson every day\" he said: \"Really I am reluctant to do it, because I am afraid to make you bored, and I want to give lessons to you as the Prophet sallallaahu 'alaihi wasallam gave us lessons for worry about boredom."
    }
  },
  {
    "id": "muslim-69",
    "book": "Muslim",
    "source": "HR. Muslim, No. 69",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ جَمِيعًا عَنْ ابْنِ عُيَيْنَةَ قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا سُفْيَانُ عَنْ عَمْرٍو أَنَّهُ سَمِعَ نَافِعَ بْنَ جُبَيْرٍ يُخْبِرُ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُحْسِنْ إِلَى جَارِهِ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَسْكُتْ",
      "id": "Telah menceritakan kepada kami [Zuhair bin Harb] dan [Muhammad bin Abdullah bin Numair] semuanya dari [Ibnu Uyainah] berkata [Numair] telah menceritakan kepada kami [Sufyan] dari [Amru] bahwa dia mendengar [Nafi' bin Jubair] mengabarkan dari [Abu Syuraih al-Khuza'i] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Barangsiapa beriman kepada Allah dan hari akhir hendaklah dia berbuat baik kepada tetangganya. Barangsiapa beriman kepada Allah dan hari akhir hendaklah dia memuliakan tamunya. Dan barangsiapa beriman kepada Allah dan hari akhir hendaklah dia mengucapkan perkataan yang baik atau diam.\"",
      "en": "Has told us [Zuhair bin Harb] and [Muhammad bin Abdullah bin Numair] everything from [Ibn Uyainah] said [numair] had told us [Sufyan] from [Amru] that he heard [Nafi 'bin Jubair] reported from [Abu Syurah al-Khuza'i]He did good to his neighbors."
    }
  },
  {
    "id": "abu-daud-70",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 70",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا يَحْيَى عَنْ سُفْيَانَ حَدَّثَنِي مَنْصُورٌ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ عَنْ عَائِشَةَ قَالَتْكُنْتُ أَغْتَسِلُ أَنَا وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ إِنَاءٍ وَاحِدٍ وَنَحْنُ جُنُبَانِ",
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Yahya] dari [Sufyan] telah menceritakan kepadaku [Manshur] dari [Ibrahim] dari [Al Aswad] dari [Aisyah] dia berkata; \"Saya pernah mandi bersama Rasulullah shallallahu 'alaihi wasallam dari satu bejana dan kami dalam keadaan junub.\"",
      "en": "Having told us [Musaddad] had told us [Yahya] from [Sufyan] having told me [Manshur] from [Ibrahim] from [Al Aswad] from [Aisyah] he said;\"I once took a bath with the Prophet sallallaahu 'alaihi wasallam from a vessel and we were in a state of junub.\""
    }
  },
  {
    "id": "tirmidzi-71",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 71",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ لَا يَقْبَلُ صَلَاةَ أَحَدِكُمْ إِذَا أَحْدَثَ حَتَّى يَتَوَضَّأَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
      "id": "telah menceritakan kepada kami [Mahmud bin Ghailan] berkata, telah menceritakan kepada kami [Abdurrazaq] berkata, telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \" Sesungguhnya Allah tidak akan menerima shalat salah seorang dari kalian jika berhadats hingga ia berwudlu.\" Abu Isa berkata; \"Hadits ini derajatnaya adalah hasan shahih.\"",
      "en": "Having told us [Mahmud bin Ghailan] said, having told us [Abdurrazaq] said, having reported us [Ma'mar] from [Hammam bin Munabbih] from [Abu Hurairah] from the Prophet sallallaahu 'alaihi wasallam, he said: \"Verily Allah will not accept prayer from you if you come up to the face until he comes to law.\"Abu Isa said;\"This hadith is the degree of Hasan Sahih.\""
    }
  },
  {
    "id": "nasai-72",
    "book": "Nasai",
    "source": "HR. Nasai, No. 72",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ قَالَ حَدَّثَنَا يَحْيَى قَالَ حَدَّثَنَا شُعْبَةُ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ جَبْرٍ قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ بِمَكُّوكٍ وَيَغْتَسِلُ بِخَمْسِ مَكَاكِيَّ",
      "id": "Telah mengabarkan kepada kami [Amr bin 'Ali] dia berkata; telah menceritakan kepada kami [Yahya] dia berkata; telah menceritakan kepada kami [Syu'bah] dia berkata; telah menceritakan kepadaku [Abdullah bin Abdullah bin Jabr] dia berkata; saya mendengar [Anas bin Malik] berkata; \"Rasulullah shallallahu 'alaihi wasallam berwudlu dengan menggunakan satu makkuk, dan bila mandi maka beliau menggunakan lima makkuk.\" ",
      "en": "Has reported to us [Amr bin 'Ali] he said;Has told us [Yahya] he said;Has told us [Syu'bah] he said;Has told me [Abdullah bin Abdullah bin Jabr] he said;I heard [Anas bin Malik] say;\"Rasulullah sallallaahu 'alayhi wasallam ablution using one creature, and when bathing then he uses five makkuk.\""
    }
  },
  {
    "id": "ibnu-majah-73",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 73",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ حَدَّثَنَا وَكِيعٌ وَمُحَمَّدُ بْنُ فُضَيْلٍ وَأَبُو مُعَاوِيَةَ ح و حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَمُحَمَّدُ بْنُ عُبَيْدٍ عَنْ الْأَعْمَشِ عَنْ زَيْدِ بْنِ وَهْبٍ قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍحَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ الصَّادِقُ الْمَصْدُوقُ أَنَّهُ يُجْمَعُ خَلْقُ أَحَدِكُمْ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ ثُمَّ يَبْعَثُ اللَّهُ إِلَيْهِ الْمَلَكَ فَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ فَيَقُولُ اكْتُبْ عَمَلَهُ وَأَجَلَهُ وَرِزْقَهُ وَشَقِيٌّ أَمْ سَعِيدٌ فَوَالَّذِي نَفْسِي بِيَدِهِ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا",
      "id": "Telah menceritakan kepada kami [Ali bin Muhammad] berkata, telah menceritakan kepada kami [Waki'] dan [Muhammad bin Fudlail] dan [Abu Mu'awiyah]. Menurut jalur yang lain; Telah menceritakan kepada kami [Ali bin Maimun Ar Raqqi] berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dan [Muhammad bin Ubaid] dari [Al A'masy] dari [Zaid bin Wahhab] ia berkata; [Abdullah bin Mas'ud] berkata; telah menceritakan kepada kami Rasulullah shallallahu 'alaihi wasallam seorang yang jujur lagi dipercaya: \" Penciptaan masing-masing kalian di himpun dalam perut ibu selama empat puluh hari hingga menjadi segumpal darah. Kemudian menjadi segumpal daging seperti itu pula, kemudian Allah mengutus seorang malaikat kepadanya, dia diperintah dengan empat kalimat, kemudian Dia berfirman: 'Tulislah amal, ajal, dan rizkinya serta sengsara atau bahagia.' Demi Dzat yang jiwaku berada di tangan-Nya, sesungguhnya ada salah seorang kalian berbuat dengan amalan penghuni surga hingga tidak ada jarak antara dirinya dengan surga kecuali sehasta, namun catatan telah mendahuluinya hingga ia mengerjakan perbuatan penghuni neraka dan akhirnya masuk neraka. Dan sesungguhnya ada salah seorang kalian melakukan amalan penghuni neraka hingga tidak ada jarak antara dirinya dengan neraka kecuali satu hasta, namun catatan mendahuluinya hingga ia mengerjakan amalan penghuni surga dan akhirnya ia masuk ke surga.\"",
      "en": "Having told us [Ali bin Muhammad] said, had told us [Waki '] and [Muhammad bin Fudlail] and [Abu Mu'awiyah].According to other paths;Having told us [Ali bin Maimun Ar Raqqi] said, had told us [Abu Mu'awiyah] and [Muhammad bin Ubaid] from [Al A'masy] from [Zaid bin Wahhab] he said;[Abdullah bin Mas'ud] said;Has told us the Prophet sallallaahu 'alaihi wasallam a honest person again trusted: \"The creation of each of you is gathered in the mother's stomach for forty days to become a lump of blood.For the sake of my soul in His hands, in fact there is one of you doing with the practice of the inhabitants of heaven until there is no distance between himself and heaven except Sehasta, but the record has preceded him until he does the deeds of the inhabitants of hell and finally enter hell."
    }
  },
  {
    "id": "bukhari-74",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 74",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ حَدَّثَنِي مَالِكٌ عَنْ ابْنِ شِهَابٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ قَالَأَقْبَلْتُ رَاكِبًا عَلَى حِمَارٍ أَتَانٍ وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الِاحْتِلَامَ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي بِمِنًى إِلَى غَيْرِ جِدَارٍ فَمَرَرْتُ بَيْنَ يَدَيْ بَعْضِ الصَّفِّ وَأَرْسَلْتُ الْأَتَانَ تَرْتَعُ فَدَخَلْتُ فِي الصَّفِّ فَلَمْ يُنْكَرْ ذَلِكَ عَلَيَّ",
      "id": "Telah menceritakan kepada kami [Isma'il bin Abu Uwais] berkata, Telah menceritakan kepadaku [Malik] dari [Ibnu Syihab] dari ['Ubaidullah bin Abdullah bin 'Utbah] dari [Abdullah bin 'Abbas] berkata; aku datang dengan menunggang keledai betina, yang saat itu aku hampir menginjak masa baligh, dan Rasulullah sedang shalat di Mina dengan tidak menghadap dinding. Maka aku lewat di depan sebagian shaf kemudian aku melepas keledai betina itu supaya mencari makan sesukanya. Lalu aku masuk kembali di tengah shaf dan tidak ada orang yang menyalahkanku\". ",
      "en": "Having told us [Isma'il bin Abu Uwais] said, had told me [Malik] from [Ibn Syihab] from ['Ubaidullah bin Abdullah bin' Utbah] from [Abdullah bin 'Abbas] said;I came with a female donkey riding, which at that time I almost stepped on the time of baligh, and the Prophet was praying in Mina with not facing the wall.So I passed in front of some of the shaf then I took off the female donkey to look for food as he pleased.Then I re -entered in the middle of the shaf and no one blamed me \"."
    }
  },
  {
    "id": "muslim-75",
    "book": "Muslim",
    "source": "HR. Muslim, No. 75",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ رَأْسُ الْكُفْرِ نَحْوَ الْمَشْرِقِ وَالْفَخْرُ وَالْخُيَلَاءُ فِي أَهْلِ الْخَيْلِ وَالْإِبِلِ الْفَدَّادِينَ أَهْلِ الْوَبَرِ وَالسَّكِينَةُ فِي أَهْلِ الْغَنَمِ",
      "id": "Telah menceritakan kepada kami [Yahya bin Yahya] dia berkata, aku membacakannya di hadapan [Malik]; dari [Abu az-Zinad] dari [al-A'raj] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam berkata, \"Puncak kekafiran berada pada arah timur (daerah kaum majusi), dan kebanggaan dan kesombongan ada pada pemilik kuda dan unta yang menggembala, yaitu kaum Badui, sedangkan ketenangan ada pada penggembala kambing (maksudnya penduduk Yaman).\"",
      "en": "Has told us [Yahya bin Yahya] he said, I read it in front of [Malik];From [Abu Az-Zinad] from [al-A'raj] from [Abu Hurairah] that the Prophet sallallaahu 'alaihi wasallam said, \"The peak of disbelief is in the east (the area of ​​the majusi), and pride and arrogance is in the owner of the horse and the catewax that is herded, the Bedouin, while the peace is in the sheep of the goat (meaning the inhabitants of Yemen)."
    }
  },
  {
    "id": "abu-daud-76",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 76",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ سَعِيدِ بْنِ سَلَمَةَ مِنْ آلِ ابْنِ الْأَزْرَقِ أَنَّ الْمُغِيرَةَ بْنَ أَبِي بُرْدَةَ وَهُوَ مِنْ بَنِي عَبْدِ الدَّارِ أَخْبَرَهُ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ يَقُولُسَأَلَ رَجُلٌ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا نَرْكَبُ الْبَحْرَ وَنَحْمِلُ مَعَنَا الْقَلِيلَ مِنْ الْمَاءِ فَإِنْ تَوَضَّأْنَا بِهِ عَطِشْنَا أَفَنَتَوَضَّأُ بِمَاءِ الْبَحْرِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هُوَ الطَّهُورُ مَاؤُهُ الْحِلُّ مَيْتَتُهُ",
      "id": "Telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik] dari [Shafwan bin Sulaim] dari [Sa'id bin Salamah dari keluarga Ibnu Al Azraq] bahwa [Al Mughirah bin Abi Burdah] -dan ia dari Bani Abd Ad Dar, - mengabarkan kepadanya bahwa dia telah mendengar [Abu Hurairah] berkata; Ada seorang laki-laki bertanya kepada Rasulullah shallallahu 'alaihi wasallam, seraya berkata; \"Wahai Rasulullah, kami naik kapal dan hanya membawa sedikit air, jika kami berwudhu dengannya maka kami akan kehausan, apakah boleh kami berwudhu dengan air laut?\" Maka Rasulullah shallallahu 'alaihi wasallam menjawab: \"Ia (laut) adalah suci airnya dan halal bangkainya.\"",
      "en": "Has told us [Abdullah bin Maslamah] from [Malik] from [Shafwan bin Sulaim] from [Sa'id bin Salamah from the family of Ibn Al Azraq] that [Al Mughirah bin Abi Burdah] - and he from Bani Abd Ad Dar, - reported to him that he had heard [Abu Hurairah] said;There was a man asking the Prophet sallallaahu 'alaihi wasallam, while saying;\"O Messenger of Allah, we boarded a boat and only brought a little water, if we were ablution with him then we would be thirsty, could we be ablution with sea water?\"Then the Prophet sallallaahu 'alayhi wasallam replied: \"He (the sea) is the holy water and halal carcass.\""
    }
  },
  {
    "id": "tirmidzi-77",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 77",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مَنْصُورٍ قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَنْ هِشَامِ بْنِ عُرْوَةَ قَالَ أَخْبَرَنِي أَبِي عَنْ بُسْرَةَ بِنْتِ صَفْوَانَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَسَّ ذَكَرَهُ فَلَا يُصَلِّ حَتَّى يَتَوَضَّأَقَالَ وَفِي الْبَاب عَنْ أُمِّ حَبِيبَةَ وَأَبِي أَيُّوبَ وَأَبِي هُرَيْرَةَ وأَرْوَى ابْنَةِ أُنَيْسٍ وَعَائِشَةَ وَجَابِرٍ وَزَيْدِ بْنِ خَالِدٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ هَكَذَا رَوَاهُ غَيْرُ وَاحِدٍ مِثْلَ هَذَا عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ بُسْرَةَ وَرَوَى أَبُو أُسَامَةَ وَغَيْرُ وَاحِدٍ هَذَا الْحَدِيثَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ مَرْوَانَ عَنْ بُسْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ حَدَّثَنَا بِذَلِكَ إِسْحَقُ بْنُ مَنْصُورٍ حَدَّثَنَا أَبُو أُسَامَةَ بِهَذَا وَرَوَى هَذَا الْحَدِيثَ أَبُو الزِّنَادِ عَنْ عُرْوَةَ عَنْ بُسْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنَا بِذَلِكَ عَلِيُّ بْنُ حُجْرٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ عَنْ أَبِيهِ عَنْ عُرْوَةَ عَنْ بُسْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَهُوَ قَوْلُ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالتَّابِعِينَ وَبِهِ يَقُولُ الْأَوْزَاعِيُّ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ قَالَ مُحَمَّدٌ وَأَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ حَدِيثُ بُسْرَةَ و قَالَ أَبُو زُرْعَةَ حَدِيثُ أُمِّ حَبِيبَةَ فِي هَذَا الْبَابِ صَحِيحٌ وَهُوَ حَدِيثُ الْعَلَاءِ بْنِ الْحَارِثِ عَنْ مَكْحُولٍ عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ عَنْ أُمِّ حَبِيبَةَ و قَالَ مُحَمَّدٌ لَمْ يَسْمَعْ مَكْحُولٌ مِنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ وَرَوَى مَكْحُولٌ عَنْ رَجُلٍ عَنْ عَنْبَسَةَ غَيْرَ هَذَا الْحَدِيثِ وَكَأَنَّهُ لَمْ يَرَ هَذَا الْحَدِيثَ صَحِيحًا",
      "id": "telah menceritakan kepada kami [Ishaq bin Manshur] berkata; telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] dari [Hisyam bin Urwah] berkata; telah mengabarkan kepadaku [Bapakku] dari [Busrah binti Shafwan] bahwa Nabi shallallahu 'alaihi wasallam, beliau bersabda: \" Barangsiapa menyentuh kemaluannya maka janganlah shalat hingga ia berwudlu.\" Ia berkata; \"Dalam bab ini juga ada riwayat dari Ummu Habibah, Abu Ayyub, Abu Hurairah, Arwa binti Unais, Aisyah, Jabir, Zaid bin Khalid dan Abdullah bin 'Amru. Abu Isa berkata; \"Hadits ini riwayatnya hasan shahih.\" Ia berkata; \"Demikianlah, tidak hanya satu yang meriwayatkan hadits ini, dari Hisyam bin Urwah, dari bapaknya, dari Busrah. Dan riwayat [Abu Usamah] juga tidak hanya satu yang meriwayatkan hadits ini, dari [Hisyam bin Urwah], dari [bapaknya], dari [Marwan], dari [Busrah], dari Nabi shallallahu 'alaihi wasallam. Dan telah meriwayatkan seperti itu pula Ishaq bin Manshur, ia berkata; \"Abu Usamah menceritakan kepada kami seperti ini.\" Dan hadits ini juga diriwayatkan oleh Abu Az Zinad, dari Urwah, dari Busrah, dari Nabi shallallahu 'alaihi wasallam. Seperti itu pula yang diriwayatkan kepada kami oleh [Ali bin Hujr]. Ia berkata; \"Telah menceritakan kepada kami [Abdurrahman bin Abu Az Zinad], dari [bapaknya], dari [Urwah], dari [Busrah], dari Nabi shallallahu 'alaihi wasallam seperti itu. Dan ini adalah pendapat tidak hanya seorang, dari para sahabat Nabi shallallahu 'alaihi wasallam dan tabi'in. hal ini juga diambil oleh Al Auza'i, Syafi'i, Ahmad dan Ishaq.\" Muhammad berkata; \"Hadits yang paling shahih dalam bab ini adalah hadits Busrah.\" Dan Abu Zur'ah berkata; \"Dalam bab ini, hadits Ummu Habibah juga shahih, yaitu hadits Al 'Ala` Ibnul Harits, dari Makhul, dari 'Anbasah bin Abu Sufyan, dari Ummu Habibah.\" Muhammad berkata; \"Makhul belum pernah mendengar dari 'Anbasah bin Abu Sufyan.\" Sedangkan 'Anbasah meriwayatkan dari seorang laki-laki, dari 'Anbasah selain hadits ini, seakan-akan ia berpendapat bahwa hadits ini shahih.\"",
      "en": "Having told us [Ishaq bin Manshur] said;Has told us [Yahya bin Sa'id Al Qaththan] from [Hisham bin Urwah] said;Has reported to me [my father] from [Busrah binti shafwan] that the Prophet sallallaahu 'alaihi wasallam, he said: \"Whoever touches his cock so do not pray until he is ablution.\"He said;\"In this chapter there is also a history of Ummu Habibah, Abu Ayyub, Abu Hurairah, Arwa Binti Unais, Aisyah, Jabir, Zaid bin Khalid and Abdullah bin 'Amru. Abu Isa said;\" This hadith history Hasan Sahih. \"He said;\"Busrah.And the history of [Abu Usamah] is also not only one that narrates this hadith, from [Hisham bin Urwah], from [his father], from [Marwan], from [Busrah], from the Prophet sallallaahu 'alaihi wasallam.And has been narrated like that as well as Ishaq bin Manshur, he said;\"Abu Usamah told us like this.\"And this hadith is also narrated by Abu Az Zinad, from Urwah, from Busrah, from the Prophet sallallaahu 'alaihi wasallam.Like that also narrated to us by [Ali bin Hujr].He said;\"Has told us [Abdurrahman bin Abu Az Zinad], from [his father], from [Urwah], from [Busrah], from the Prophet sallallaahu 'alaihi wasallam like that.Muhammad said;\"The most authentic hadith in this chapter is the bush hadith.\"And Abu Zur'ah said;\"In this chapter, the Hadibah Habibah Hadith is also authentic, namely Al 'Ala' Ibnul Harits, from Makhul, from 'Anbasah bin Abu Sufyan, from Ummu Habibah.\"Muhammad said;\"Makhul has never heard of 'Anbasah bin Abu Sufyan.\"While 'Anbasah narrated from a man, from' Anbasah other than this hadith, as if he argued that this hadith was authentic. \""
    }
  },
  {
    "id": "nasai-78",
    "book": "Nasai",
    "source": "HR. Nasai, No. 78",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ وَهْبٍ عَنْ مَالِكٍ وَيُونُسَ وَعَمْرِو بْنِ الْحَارِثِ أَنَّ ابْنَ شِهَابٍ أَخْبَرَهُمْ عَنْ عَبَّادِ بْنِ زِيَادٍ عَنْ عُرْوَةَ بْنِ الْمُغِيرَةِ أَنَّهُ سَمِعَ أَبَاهُ يَقُولُسَكَبْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ تَوَضَّأَ فِي غَزْوَةِ تَبُوكَ فَمَسَحَ عَلَى الْخُفَّيْنِقَالَ أَبُو عَبْد الرَّحْمَنِ لَمْ يَذْكُرْ مَالِكٌ عُرْوَةَ بْنَ الْمُغِيرَةِ",
      "id": "Telah mengabarkan kepada kami [Sulaiman bin Daud] dan [Al Harits bin Miskin] telah dibacakan kepadanya dan aku mendengar lafazhnya dari dia, dari [Ibnu Wahab] dari [Malik] dan [Yunus] dan [Amr bin Al Harits] bahwasanya [Ibnu Syihab] Telah mengabarkan kepada mereka, dari ['Abbad bin Ziyad] dari ['Urwah bin Al Mughirah] bahwasannya dia mendengar [Bapaknya] berkata; \"Aku pernah menuangkan air untuk Rasulullah shallallahu 'alaihi wasallam ketika beliau wudlu saat perang Tabuk. Saat itu beliau mengusap kedua sepatunya.\" Abu Abdurrahman berkata; Malik tidak menyebutkan Urwah bin Al Mughirah. ",
      "en": "Has reported to us [Sulaiman bin Daud] and [Al Harits bin Poor] had been read to him and I heard his lafazh from him, from [Ibn Wahab] from [Malik] and [Yunus] and [Amr bin Al Harits] that [Ibn Syihab] had preached to them, from ['Abbad bin Ziyad][His father] said;\"I once poured water for the Prophet sallallaahu 'alayhi wasallam when he was ablution during the Tabuk War. At that time he rubbed his two shoes.\"Abu Abdurrahman said;Malik did not mention Urwah bin Al Mughirah."
    }
  },
  {
    "id": "bukhari-80",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 80",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ قَالَ حَدَّثَنِي اللَّيْثُ قَالَ حَدَّثَنِي عُقَيْلٌ عَنْ ابْنِ شِهَابٍ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ ابْنَ عُمَرَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ فَشَرِبْتُ حَتَّى إِنِّي لَأَرَى الرِّيَّ يَخْرُجُ فِي أَظْفَارِي ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ الْعِلْمَ",
      "id": "Telah menceritakan kepada kami [Sa'id bin 'Ufair] berkata, Telah menceritakan kepadaku [Al Laits] berkata, Telah menceritakan kepadaku ['Uqail] dari [Ibnu Syihab] dari [Hamzah bin Abdullah bin Umar] bahwa [Ibnu Umar] berkata: aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Ketika aku tidur, aku bermimpi diberi segelas susu lalu aku meminumnya hingga aku melihat pemandangan yang bagus keluar dari kuku-kukuku, kemudian aku berikan sisanya kepada sahabat muliaku Umar bin Al Khaththab\". Orang-orang bertanya: \"Apa ta'wilnya wahai Rasulullah?\" Beliau menjawab: \"Ilmu\". ",
      "en": "Has told us [Sa'id bin 'ufair] said, having told me [al laits] said, had told me [' uqail] from [Ibn syihab] from [Hamzah bin Abdullah bin Umar] that [Ibn Umar] said: I heard the Messenger of Allah sallallaahu 'alayhi bin, I dreamed that I was given a glass of milk.My nails, then I give the rest to Muliaku's best friend Umar bin Al Khaththab \".People asked: \"What is the ta'wil, O Messenger of Allah?\"He replied: \"Science\"."
    }
  },
  {
    "id": "muslim-81",
    "book": "Muslim",
    "source": "HR. Muslim, No. 81",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَوَلَا أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْو حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ أَنْبَأَنَا جَرِيرٌ عَنْ الْأَعْمَشِ بِهَذَا الْإِسْنَادِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالَّذِي نَفْسِي بِيَدِهِ لَا تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ وَوَكِيعٍ",
      "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] telah menceritakan kepada kami [Abu Mu'awiyah] dan [Waki'] dari [al-A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalian tidak akan masuk surga hingga kalian beriman, dan tidaklah kalian beriman hingga kalian saling menyayangi. Maukan kalian aku tunjukkan atas sesuatu yang mana apabila kalian mengerjakannya niscaya kalian akan saling menyayangi. Sebarkanlah salam di antara kalian.\" Dan telah menceritakan kepadaku [Zuhair bin Harb] telah memberitakan kepada kami [Jarir] dari [al-A'masy] dengan sanad ini. Dia berkata, \"Rasulullah shallallahu 'alaihi wasallam bersabda: \"Demi Dzat yang jiwaku berada di tangan-Nya, kalian tidak akan masuk surga hingga kalian beriman, \" sebagaimana hadits Abu Mu'awiyah dan Waki'.\"",
      "en": "Has told us [Abu Bakar bin Abu Syaibah] had told us [Abu Mu'awiyah] and [Waki '] from [al-A'masy] from [Abu Shalih] from [Abu Hurairah] he said, \"Rasulullah sallallaahu' alaihi wasallam said:\" You will not go to heaven until you believe, and you don't believe until you love each other.I will show you to something if you do it, surely you will love each other.Spread the greetings between you. \"And has told me [Zuhair bin Harb] has reported us [Jarir] from [al-A'masy] with this sanad. He said,\" Rasulullah sallallaahu 'alaihi wasallam said: \"For the sake"
    }
  },
  {
    "id": "abu-daud-82",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 82",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ حَنْبَلٍ وَمُسَدَّدٌ وَمُحَمَّدُ بْنُ عِيسَى الْمَعْنَى قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ أَبِي حَزْرَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ قَالَ ابْنُ عِيسَى فِي حَدِيثِهِ ابْنُ أَبِي بَكْرٍ ثُمَّ اتَّفَقُوا أَخُو الْقَاسِمِ بْنِ مُحَمَّدٍ قَالَكُنَّا عِنْدَ عَائِشَةَ فَجِيءَ بِطَعَامِهَا فَقَامَ الْقَاسِمُ يُصَلِّي فَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا يُصَلَّى بِحَضْرَةِ الطَّعَامِ وَلَا وَهُوَ يُدَافِعُهُ الْأَخْبَثَانِ",
      "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Hanbal] dan [Musaddad] dan [Muhammad bin Isa] dengan makna yang sama, mereka berkata; Telah menceritakan kepada kami [Yahya bin Sa'id] dari [Abu Hajrah], telah menceritakan kepada kami [Abdullah bin Muhammad], Ibnu Isa berkata; Di dalam haditsnya terdapat Ibnu Abi Bakr, mereka (ketiganya) bersepakat seraya mengatakan bahwa dia (Abdullah bin Muhammad) adalah saudara Al Qasim bin Muhammad. Dia berkata; Kami pernah bersama [Aisyah], lalu didatangkanlah makanannya, kemudian Al Qasim bangkit untuk shalat, maka Aisyah berkata; Saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Janganlah seseorang shalat ketika makanan telah dihidangkan dan jangan pula ketika menahan buang air besar dan kencing.\"",
      "en": "Has told us [Ahmad bin Muhammad bin Hanbal] and [Musaddad] and [Muhammad bin Isa] with the same meaning, they said;Has told us [Yahya bin Sa'id] from [Abu Hajrah], having told us [Abdullah bin Muhammad], Ibn Isa said;In his hadith there is Ibn Abi Bakr, they (the three) agreed while saying that he (Abdullah bin Muhammad) was the brother of Al Qasim bin Muhammad.He says;We were with [Aisyah], then the food was brought in, then Al Qasim rose for prayer, then Aisyah said;I have heard the Prophet sallallaahu 'alayhi wasallam said: \"Don't pray when food has been served and not when holding back bowel movements and urine.\""
    }
  },
  {
    "id": "tirmidzi-83",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 83",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا أَبُو أَحْمَدَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الزُّبَيْرِيُّ عَنْ سُفْيَانَ عَنْ الضَّحَّاكِ بْنِ عُثْمَانَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ رَجُلًا سَلَّمَ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَبُولُ فَلَمْ يَرُدَّ عَلَيْهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَإِنَّمَا يُكْرَهُ هَذَا عِنْدَنَا إِذَا كَانَ عَلَى الْغَائِطِ وَالْبَوْلِ وَقَدْ فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ ذَلِكَ وَهَذَا أَحَسَنُ شَيْءٍ رُوِيَ فِي هَذَا الْبَابِ قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ الْمُهَاجِرِ بْنِ قُنْفُذٍ وَعَبْدِ اللَّهِ بْنِ حَنْظَلَةَ وَعَلْقَمَةَ بْنِ الْفَغْوَاءِ وَجَابِرٍ وَالْبَرَاءِ",
      "id": "telah menceritakan kepada kami [Nashr bin Ali] dan [Muhammad bin Basysyar] keduanya berkata; telah menceritakan kepada kami [Abu Ahmad Muhammad bin Abdullah Az Zubair] dari [Sufyan] dari [Adl Dlahhak bin Utsman] dari [Nafi'] dari [Ibnu Umar] berkata; \"Ada seorang lelaki mengucapkan salam kepada Nabi shallallahu 'alaihi wasallam ketika Nabi sedang kencing, maka beliau pun tidak menjawabnya.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih, hanyasannya hal ini (menjawab salam) menjadi makruh dikalangan kami apabila sedang buang air besar atau kencing, sebagaimana yang telah ditafsirkan oleh sebagian ahli Ilmu. Dan hadits ini adalah hadits yang paling baik yang diriwayatkan dalam bab ini. Abu Isa berkata; \"Dalam bab ini terdapat juga hadits dari Al Muhajir bin Qunfudz, Abdullah bin Hanzhalah, Alqamah bin Al Afra', Jabir dan Al Barra`.\"",
      "en": "Has told us [Nashr bin Ali] and [Muhammad bin Basysyar] both said;Has told us [Abu Ahmad Muhammad bin Abdullah Az Zubair] from [Sufyan] from [Adl Dlahhak bin Uthman] from [Nafi '] from [Ibnu Umar] said;\"There was a man to say hello to the Prophet sallallaahu 'alaihi wasallam when the Prophet was urinating, so he did not answer it.\"Abu Isa said;\"This hadith is the degree of Hasan Sahih, the only thing is (answering greetings) to be makruh among us when defecating or urinating, as interpreted by some experts in science. And this hadith is the best hadith that is narrated in this chapter. Abu Isa said;\"Afra ', Jabir and Al Barra'. \""
    }
  },
  {
    "id": "nasai-84",
    "book": "Nasai",
    "source": "HR. Nasai, No. 84",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ قَالَ حَدَّثَنَا عُثْمَانُ هُوَ ابْنُ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ عَنْ شُعَيْبٍ هُوَ ابْنُ أبِي حَمْزَةَ عَنْ الزُّهْرِيِّ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ عَنْ حُمْرَانَأَنَّهُ رَأَى عُثْمَانَ دَعَا بِوَضُوءٍ فَأَفْرَغَ عَلَى يَدَيْهِ مِنْ إِنَائِهِ فَغَسَلَهَا ثَلَاثَ مَرَّاتٍ ثُمَّ أَدْخَلَ يَمِينَهُ فِي الْوَضُوءِ فَتَمَضْمَضَ وَاسْتَنْشَقَ ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثًا وَيَدَيْهِ إِلَى الْمِرْفَقَيْنِ ثَلَاثَ مَرَّاتٍ ثُمَّ مَسَحَ بِرَأْسِهِ ثُمَّ غَسَلَ كُلَّ رِجْلٍ مِنْ رِجْلَيْهِ ثَلَاثَ مَرَّاتٍ ثُمَّ قَالَ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ وُضُوئِي هَذَا ثُمَّ قَالَ مَنْ تَوَضَّأَ مِثْلَ وُضُوئِي هَذَا ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ لَا يُحَدِّثُ فِيهِمَا نَفْسَهُ بِشَيْءٍ غَفَرَ اللَّهُ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ",
      "id": "Telah mengabarkan kepada kami [Ahmad bin Muhammad bin Al Mughirah] dia berkata; telah menceritakan kepada kami [Utsman yaitu Ibnu Sa'id bin Katsir bin Dinar Al Hamshi] dari [Syu'aib yaitu Ibnu Abu Hamzah] dari [Az-Zuhri] telah mengabarkan kepadaku ['Atha bin Yazid] dari [Humran], bahwa dia melihat [Utsman bin Affan] meminta air wudlu. Lalu dituangkanlah kepada kedua tangannya dari bejananya, maka beliau membasuh kedua tangannya tiga kali, kemudian dia memasukkan tangan kanannya kedalam air wudlu. Setelah itu berkumur dan memasukkan air ke hidung, membasuh mukanya tiga kali, membasuh kedua tangannya sampai ke siku-sikunya tiga kali, mengusap kepalanya, membasuh kakinya tiga kali, kemudian berkata, \"Aku melihat Rasulullah shallallahu 'alaihi wasallam berwudlu seperti wudluku ini, kemudian shalat dua raka'at -tanpa berbicara terhadap dirinya diantara keduanya- maka Allah akan mengampuni dosa-dosanya yang telah lalu.\" ",
      "en": "Has reported to us [Ahmad bin Muhammad bin Al Mughirah] he said;Has told us [Uthman namely Ibn Sa'id bin Katsir bin Dinar Al Hamshi] from [Syu'aib, Ibn Abu Hamzah] from [Az-Zuhri] had reported me ['Atha bin Yazid] from [Humran], that he saw [Uthman bin Affan] asking for ablu water.Then poured into his hands from his jokes, so he washed his hands three times, then he put his right hand into the ablution water.After that rinse and put water into the nose, washed his face three times, washed his hands up to his elbows three times, rubbed his head, washed his legs three times, then said, \"I saw the Prophet sallallaahu 'alaihi wasallam abubler like this wudluku, then pray two rak'ats-without talking to him between the two of them."
    }
  },
  {
    "id": "ibnu-majah-85",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 85",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ حَدَّثَنَا الْأَعْمَشُ عَنْ يَزِيدَ الرِّقَاشِيِّ عَنْ غُنَيْمِ بْنِ قَيْسٍ عَنْ أَبِي مُوسَى الْأَشْعَرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَثَلُ الْقَلْبِ مَثَلُ الرِّيشَةِ تُقَلِّبُهَا الرِّيَاحُ بِفَلَاةٍ",
      "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Numair] berkata, telah menceritakan kepada kami [Asbath bin Muhammad] berkata, telah menceritakan kepada kami [Al A'masy] dari [Yazid Ar Raqasyi] dari [Ghunaim bin Qais] dari [Abu Musa Al Asy'ari] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Perumpamaan hati adalah seperti selembar bulu yang diombang-ambingkan angin di tanah yang lapang.\"",
      "en": "Has told us [Muhammad bin Abdullah bin Numair] said, having told us [Asbath bin Muhammad] said, had told us [Al A'Masy] from [Yazid Ar Raqasyi] from [Ghunaim bin Qais] from [Abu Musa Al Asy'ari] he said;Rasulullah sallallaahu 'alaihi wasallam said: \"The parable of the heart is like a feather that is tossed out of the wind in a spacious soil.\""
    }
  },
  {
    "id": "bukhari-86",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 86",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ قَالَ أَخْبَرَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ عَنْ عُقْبَةَ بْنِ الْحَارِثِأَنَّهُ تَزَوَّجَ ابْنَةً لِأَبِي إِهَابِ بْنِ عَزِيزٍ فَأَتَتْهُ امْرَأَةٌ فَقَالَتْ إِنِّي قَدْ أَرْضَعْتُ عُقْبَةَ وَالَّتِي تَزَوَّجَ فَقَالَ لَهَا عُقْبَةُ مَا أَعْلَمُ أَنَّكِ أَرْضَعْتِنِي وَلَا أَخْبَرْتِنِي فَرَكِبَ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْمَدِينَةِ فَسَأَلَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ وَقَدْ قِيلَ فَفَارَقَهَا عُقْبَةُ وَنَكَحَتْ زَوْجًا غَيْرَهُ",
      "id": "Telah menceritakan kepada kami [Muhammad bin Muqotil Abu Al Hasan] berkata, telah mengabarkan kepada kami [Abdullah] berkata, telah mengabarkan kepada kami [Umar bin Sa'id bin Abu Husain] berkata, telah menceritakan kepadaku [Abdullah bin Abu Mulaikah] dari ['Uqbah bin Al Harits]; bahwasanya dia menikahi seorang perempuan putri Ibnu Ihab bin 'Aziz. Lalu datanglah seorang perempuan dan berkata: \"Aku pernah menyusui 'Uqbah dan wanita yang dinikahinya itu\". Maka 'Uqbah berkata kepada perempuan itu: \"Aku tidak tahu kalau kamu pernah menyusuiku dan kamu tidak memberitahu aku.\" Maka 'Uqbah mengendarai kendaraannya menemui Rasul shallallahu 'alaihi wasallam di Madinah dan menyampaikan masalahnya. Maka Rasul shallallahu 'alaihi wasallam bersabda: \"harus bagaimana lagi, sedangkan dia sudah mengatakannya\". Maka 'Uqbah menceraikannya dan menikah dengan wanita yang lain. ",
      "en": "Has told us [Muhammad bin Muqotil Abu Al Hasan] said, having reported us [Abdullah] said, having reported us [Umar bin Sa'id bin Abu Husain] said, had told me [Abdullah bin Abu Mulaikah] from ['Uqbah bin Al Harits];that she married a woman Ibn Ibn Ihab bin 'Aziz.Then came a woman and said: \"I once breastfeeding 'Uqbah and the woman she married\".So 'Uqbah said to the woman: \"I don't know if you have breastfeeding me and you don't tell me.\"So 'Uqbah drives his vehicle to meet the Apostle sallallaahu' alaihi wasallam in Medina and convey the problem.So the Apostle sallallaahu 'alayhi wasallam said: \"What else must be, while he has said it\".So 'Uqbah divorced him and married another woman."
    }
  },
  {
    "id": "muslim-87",
    "book": "Muslim",
    "source": "HR. Muslim, No. 87",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ عَنْ ذَكْوَانَ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهُوَ مُؤْمِنٌ وَلَا يَسْرِقُ حِينَ يَسْرِقُ وَهُوَ مُؤْمِنٌ وَلَا يَشْرَبُ الْخَمْرَ حِينَ يَشْرَبُهَا وَهُوَ مُؤْمِنٌ وَالتَّوْبَةُ مَعْرُوضَةٌ بَعْدُحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا سُفْيَانُ عَنْ الْأَعْمَشِ عَنْ ذَكْوَانَ عَنْ أَبِي هُرَيْرَةَ رَفَعَهُ قَالَ لَا يَزْنِي الزَّانِي ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ شُعْبَةَ",
      "id": "Telah menceritakan kepada kami [Muhammad bin al-Mutsanna] telah menceritakan kepada kami [Ibnu Abu Adi] dari [Syu'bah] dari [Sulaiman] dari [Dzakwan] dari [Abu Hurairah] berkata, \"Sesungguhnya Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang pezina saat berzina dsebut sebagai mukmin, dan tidaklah seorang pencuri saatmencuri dusebut mukmin, dan tidaklah seorang yang menimum khamer saat meminumnya disebut mukmin. Sedangkan pintu taubat akan selalu terbuka.\" Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Sufyan] dari [al-A'masy] dari [Dzakwan] dari [Abu Hurairah] yang merafa'kan-Nya. Dia berkata, \"Tidaklah seorang pezina saat berzina, \" kemudian dia menyebutkan seperti hadits Syu'bah.\"",
      "en": "Has told us [Muhammad bin Al-Mutsanna] had told us [Ibn Abu Adi] from [Syu'bah] from [Sulaiman] from [Dzakwan] from [Abu Hurairah] said, \"Surely the Prophet sallallaahu 'alaihi wasallam said:\" Not a adulterer while adultery when adulteryMenimum khamer when drinking it is called a believer.Whereas the door to repentance will always be open. \"Has told us [Muhammad bin Rafi '] has told us [Abdurrazzaq] to have reported us [Sufyan] from [al-A'masy] from [Dzakwan] from [Abu Hurairah] who meafa'kan Him. He said,\""
    }
  },
  {
    "id": "abu-daud-88",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 88",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُوسَى بْنُ إِسْمَعِيلَ حَدَّثَنَا حَمَّادٌ حَدَّثَنَا سَعِيدٌ الْجُرَيْرِيُّ عَنْ أَبِي نَعَامَةَ أَنَّ عَبْدَ اللَّهِ بْنَ مُغَفَّلٍسَمِعَ ابْنَهُ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الْقَصْرَ الْأَبْيَضَ عَنْ يَمِينِ الْجَنَّةِ إِذَا دَخَلْتُهَا فَقَالَ أَيْ بُنَيَّ سَلْ اللَّهَ الْجَنَّةَ وَتَعَوَّذْ بِهِ مِنْ النَّارِ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّهُ سَيَكُونُ فِي هَذِهِ الْأُمَّةِ قَوْمٌ يَعْتَدُونَ فِي الطَّهُورِ وَالدُّعَاءِ",
      "id": "Telah menceritakan kepada kami [Musa bin Isma'il] telah menceritakan kepada kami [Hammad] telah menceritakan kepada kami [Sa'id Al Jurairi] dari [Abu Na'amah] bahwasanya [Abdullah bin Mughaffal] pernah mendengar anaknya berdoa dengan mengucapkan; \"Ya Allah, Sesungguhnya saya memohon kepadaMu istana putih di sisi kanan surga apabila saya memasukinya.\" Maka Abdullah bin Mughaffal berkata; \"Wahai anakku, mintalah surga kepada Allah dan berlindunglah kepadaNya dari neraka, sesungguhnya saya pernah mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya akan ada suatu kaum dari umat ini yang berlebih-lebihan dalam hal bersuci dan berdoa.\"",
      "en": "Having told us [Musa bin Isma'il] had told us [Hammad] had told us [Sa'id Al Jurairi] from [Abu Na'amah] that [Abdullah bin Mughaffal] had heard his child prayed by saying;\"O Allah, in fact I beg you a white palace on the right side of heaven when I enter it.\"So Abdullah bin Mughaffal said;\"O my son, ask heaven to Allah and take refuge in him from hell, in fact I have heard the Prophet sallallaahu 'alaihi wasallam said:\" Indeed there will be a people from this people who are excessive in terms of purification and praying. \""
    }
  },
  {
    "id": "tirmidzi-89",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 89",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ عَنْ زِرِّ بْنِ حُبَيْشٍ عَنْ صَفْوَانَ بْنِ عَسَّالٍ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَأْمُرُنَا إِذَا كُنَّا سَفَرًا أَنْ لَا نَنْزِعَ خِفَافَنَا ثَلَاثَةَ أَيَّامٍ وَلَيَالِيهِنَّ إِلَّا مِنْ جَنَابَةٍ وَلَكِنْ مِنْ غَائِطٍ وَبَوْلٍ وَنَوْمٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَى الْحَكَمُ بْنُ عُتَيْبَةَ وَحَمَّادٌ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ عَنْ أَبِي عَبْدِ اللَّهِ الْجَدَلِيِّ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ وَلَا يَصِحُّ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى بْنُ سَعِيدٍ قَالَ شُعْبَةُ لَمْ يَسْمَعْ إِبْرَاهِيمُ النَّخَعِيُّ مِنْ أَبِي عَبْدِ اللَّهِ الْجَدَلِيِّ حَدِيثَ الْمَسْحِ و قَالَ زَائِدَةُ عَنْ مَنْصُورٍ كُنَّا فِي حُجْرَةِ إِبْرَاهِيمَ التَّيْمِيِّ وَمَعَنَا إِبْرَاهِيمُ النَّخَعِيُّ فَحَدَّثَنَا إِبْرَاهِيمُ التَّيْمِيُّ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ أَبِي عَبْدِ اللَّهِ الْجَدَلِيِّ عَنْ خُزَيْمَةَ بْنِ ثَابِتٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْحِ عَلَى الْخُفَّيْنِ قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ أَحْسَنُ شَيْءٍ فِي هَذَا الْبَابِ حَدِيثُ صَفْوَانَ بْنِ عَسَّالٍ الْمُرَادِيِّ قَالَ أَبُو عِيسَى وَهُوَ قَوْلُ أَكْثَرِ الْعُلَمَاءِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالتَّابِعِينَ وَمَنْ بَعْدَهُمْ مِنْ الْفُقَهَاءِ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ قَالُوا يَمْسَحُ الْمُقِيمُ يَوْمًا وَلَيْلَةً وَالْمُسَافِرُ ثَلَاثَةَ أَيَّامٍ وَلَيَالِيهِنَّ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ عَنْ بَعْضِ أَهْلِ الْعِلْمِ أَنَّهُمْ لَمْ يُوَقِّتُوا فِي الْمَسْحِ عَلَى الْخُفَّيْنِ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ قَالَ أَبُو عِيسَى وَالتَّوْقِيتُ أَصَحُّ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ صَفْوَانَ بْنِ عَسَّالٍ أَيْضًا مِنْ غَيْرِ حَدِيثِ عَاصِمٍ",
      "id": "telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari ['Ashim bin Abu An Nujud] dari [Zirr bin Hubaisy] dari [Shafwan bin 'Assal] ia berkata; \" Jika kami sedang bepergian, Rasulullah shallallahu 'alaihi wasallam memerintahkan agar kami tidak membukanya selama tiga hari tiga malam kecuali ketika kami junub. Dan tetap boleh untuk mengusapkan karena buang air besar, buang air kecil dan tidur.\" Abu Isa berkata; \"Hadits ini derajatnya hasan shahih. Al Hakam bin Utbah dan Hammad meriwayatkan hadits ini dari Ibrahim An Nakha'i, dari Abu Abdullah Al Jadali, dari Khuzaimah bin Tsabit, namun ini tidak shahih.\" Ali Ibnul Madini berkata; \"Yahya bin Sa'id mengatakan bahwa Syu'bah berkata; \"Ibrahim An Nakha'i belum pernah mendengar dari Abu Abdullah Al Jadali tentang hadits mengusap khuf.\" Za'idah berkata dari Manshur, \"Kami pernah di kamar Ibrahim At Taimi, sedang waktu itu kami bersama Ibrahim An Nakha'i, lalu Ibrahim At Taimi menceritakan kepada kami dari 'Amru bin Maimun, dari Abu Abdullah Al Jadali, dari Khuzaimah bin Tsabit, dari Nabi shallallahu 'alaihi wasallam tentang hadits mengusap dua khuf.\" Muhammad bin Isma'il berkata; \"Dalam bab ini hadits yang paling baik adalah hadits riwayat Shafwan bin 'Assal Al Muradi.\" Abu Isa berkata; \"Ini adalah pendapat kebanyak ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam, tabi'in dan orang-orang setelah mereka dari kalangan fuqaha. Seperti Sufyan Ats Tsauri, Ibnul Mubarak, Syafi'i, Ahmad dan Ishaq. Mereka berkata; \"Orang yang tinggal di rumah mengusap khuf selama sehari semalam dan orang yang dalam perjalanan mengusap selama tiga hari tiga malam.\" Abu Isa berkata; \"Diriwayatkan pula dari sebagian ahli ilmu bahwa mereka tidak memberikan batasan waktu dalam mengusap sepasang khuf. Pendapat ini dipegang oleh Malik bin Anas.\" Abu Isa berkata lagi, \"Pendapat yang memberikan batasan waktu adalah lebih shahih.\" Hadits ini juga diriwayatkan oleh Shafwan bin 'Assal, selain dari hadits 'Ashim.\"",
      "en": "Having told us [Hannad] said, had told us [Abu Al Ahwash] from ['Ashim bin Abu An Nudent] from [Zirr bin Hubaisy] from [Shafwan bin' Assal] he said;\"If we are traveling, the Prophet sallallaahu 'alayhi wasallam ordered that we would not open it for three days and three nights except when we were junub. And still allowed to rub because of bowel movements, urinating and sleeping.\"Abu Isa said;\"This hadith is the degree of Hasan Sahih. Al Hakam bin Utbah and Hammad narrated this hadith from Ibrahim An Nakha'i, from Abu Abdullah Al Jadali, from Khuzaimah bin Tsabit, but this is not authentic.\"Ali Ibnul Madini said;\"Yahya bin Sa'id said that Syu'bah said;\" Ibrahim An Nakha'i had never heard from Abu Abdullah Al Jadali about the Hadith rubbing Khuf. \"Za'idah said from Manshur,\" We were in Ibrahim's room at Taimi, while at that time we were with Ibrahim An Nakha'i, then Ibrahim at TaimiKhuzaimah bin Tsabit, from the Prophet sallallaahu 'alaihi wasallam about the hadith rubbing two khuf. \"Muhammad bin Isma'il said;\" In this chapter the best hadith is the Hadith history of Shafwan bin' Assal Al Muradi.Fuqaha.Like Sufyan Ats Tsauri, Ibnul Mubarak, Syafi'i, Ahmad and Ishaq.They say;\"People who lived at home rubbed Khuf for a day and night and those on the way on the way to rub for three days and three nights.\"Abu Isa said;\"It is also narrated from some science experts that they do not provide time limits in rubbing a pair of Khuf. This opinion is held by Malik Bin Anas.\"Abu Isa said again, \"The opinion that gives time limits is more authentic.\"This hadith is also narrated by Shafwan Bin 'Assal, apart from the hadith' Ashim. \""
    }
  },
  {
    "id": "nasai-90",
    "book": "Nasai",
    "source": "HR. Nasai, No. 90",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ عَنْ زَائِدَةَ قَالَ حَدَّثَنَا خَالِدُ بْنُ عَلْقَمَةَ عَنْ عَبْدِ خَيْرٍ عَنْ عَلِيٍّأَنَّهُ دَعَا بِوَضُوءٍ فَتَمَضْمَضَ وَاسْتَنْشَقَ وَنَثَرَ بِيَدِهِ الْيُسْرَى فَفَعَلَ هَذَا ثَلَاثًا ثُمَّ قَالَ هَذَا طُهُورُ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "id": "Telah mengabarkan kepada kami [Musa bin Abdurrahman] dia berkata; telah menceritakan kepada kami [Husain bin Ali] dari [Zaidah] dia berkata; telah menceritakan kepada kami [Khalid bin 'Alqamah] dari [Abdu Khair] dari [Ali], bahwa ia pernah meminta air wudlu. Dia lalu berkumur dan menghirup air ke dalam hidung kemudian mengeluarkannya dengan tangan kirinya; dia melakukannya tiga kali, kemudian berkata, \"Beginilah cara bersuci Rasulullah shallallahu 'alaihi wasallam.\"",
      "en": "Has reported to us [Musa bin Abdurrahman] he said;Has told us [Husain bin Ali] from [Zaidah] he said;Has told us [Khalid bin 'Alqamah] from [Abdu Khair] from [Ali], that he once asked for Wudlu water.He then rinsing and breathes water into the nose then takes it out with his left hand;He did it three times, then said, \"This is how to purify the Prophet sallallaahu 'alaihi wasallam.\""
    }
  },
  {
    "id": "ibnu-majah-91",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 91",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَلِيُّ بْنُ مُحَمَّدٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا نَفَعَنِي مَالٌ قَطُّ مَا نَفَعَنِي مَالُ أَبِي بَكْرٍ فَبَكَى أَبُو بَكْرٍ وَقَالَ هَلْ أَنَا وَمَالِي إِلَّا لَكَ يَا رَسُولَ اللَّهِ",
      "id": "Telah menceritakan kepada kami [Abu Bakr bin Abu Syaibah] dan [Ali bin Muhammad], keduanya berkata; telah menceritakan kepada kami [Abu Mu'awiyah] berkata; telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Tidak ada harta yang dapat memberiku manfa'at sebagaimana harta Abu Bakar, \" maka menangislah Abu Bakar, dan berkata; \"Wahai Rasulullah, bukankah aku dan juga hartaku adalah milikmu.\"",
      "en": "Has told us [Abu Bakr bin Abu Syaibah] and [Ali bin Muhammad], both of them said;Having told us [Abu Mu'awiyah] said;had told us [al a'masy] from [Abu Shalih] from [Abu Hurairah] he said;Rasulullah sallallaahu 'alayhi wasallam said: \"There is no treasure that can give me a benefit like Abu Bakr's property,\" then cry Abu Bakr, and say;\"O Messenger of Allah, aren't me and my treasure also yours.\""
    }
  },
  {
    "id": "bukhari-92",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 92",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا عَبْدَةُ قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى قَالَ حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ إِذَا سَلَّمَ سَلَّمَ ثَلَاثًا وَإِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلَاثًا",
      "id": "Telah menceritakan kepada kami [Abdah] berkata, Telah menceritakan kepada kami [Abdushshamad] berkata, Telah menceritakan kepada kami [Abdullah bin Al Mutsanna] berkata; [Tsumamah bin Abdullah] telah menceritakan kepada kami dari [Anas] dari Nabi shallallahu 'alaihi wasallam, bahwa Nabi shallallahu 'alaihi wasallam apabila memberi salam, diucapkannya tiga kali dan bila berbicara dengan satu kalimat diulangnya tiga kali. ",
      "en": "Having told us [Abdah] said, having told us [Abdushshamad] said, had told us [Abdullah bin Al Mutsanna] saying;[Tsumamah bin Abdullah] has told us from [Anas] from the Prophet sallallaahu 'alaihi wasallam, that the Prophet sallallaahu' alaihi wasallam when he greeting, he said three times and when he spoke with one sentence he repeated three times."
    }
  },
  {
    "id": "muslim-93",
    "book": "Muslim",
    "source": "HR. Muslim, No. 93",
    "narrator": "N/A",
    "text": {
      "arab": "و حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا أَبِي حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ عَنْ ابْنِ بُرَيْدَةَ عَنْ يَحْيَى بْنِ يَعْمَرَ أَنَّ أَبَا الْأَسْوَدِ حَدَّثَهُ عَنْ أَبِي ذَرٍّأَنَّهُ سَمِعَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَيْسَ مِنْ رَجُلٍ ادَّعَى لِغَيْرِ أَبِيهِ وَهُوَ يَعْلَمُهُ إِلَّا كَفَرَ وَمَنْ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنْ النَّارِ وَمَنْ دَعَا رَجُلًا بِالْكُفْرِ أَوْ قَالَ عَدُوَّ اللَّهِ وَلَيْسَ كَذَلِكَ إِلَّا حَارَ عَلَيْهِ",
      "id": "Dan telah menceritakan kepadaku [Zuhair bin Harb] telah menceritakan kepada kami [Abd ash-Shamad bin Abdul Warits] telah menceritakan kepada kami [bapakku] telah menceritakan kepada kami [Husian al-Mu'allim] dari [Ibnu Buraidah] dari [Yahya bin Ya'mar] bahwa [Abu al-Aswad] telah menceritakan kepadanya dari [Abu Dzar] bahwa dia mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah seorang laki-laki yang mengklaim orang lain sebagai bapaknya, padahal ia telah mengetahuinya (bahwa dia bukan bapaknya), maka ia telah kafir. Barangsiapa mengaku sesuatu yang bukan miliknya maka ia bukan dari golongan kami, dan hendaklah dia menempati tempat duduknya dari neraka. Dan barangsiapa memanggil seseorang dengan kekufuan, atau berkata, 'Wahai musuh Allah' padahal tidak demikian, kecuali perkataan tersebut akan kembali kepadanya.\"",
      "en": "And has told me [Zuhair bin Harb] has told us [Abd Ash-Shamad bin Abdul Warits] had told us [my father] had told us [Husian al-Mu'allim] from [Ibn Buraidah] from [Yahya bin Ya'mar] that [Abu al-Aswad] had told him from [Abu Dzar]\"It is not a man who claims other people as his father, even though he has known him (that he is not his father), so he has been infidel. Whoever admitted something that was not his property, he was not from our group, and he should occupy his seat from hell."
    }
  },
  {
    "id": "abu-daud-94",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 94",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي رَزِينٍ وَأَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ أَحَدُكُمْ مِنْ اللَّيْلِ فَلَا يَغْمِسْ يَدَهُ فِي الْإِنَاءِ حَتَّى يَغْسِلَهَا ثَلَاثَ مَرَّاتٍ فَإِنَّهُ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُحَدَّثَنَا مُسَدَّدٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي بِهَذَا الْحَدِيثِ قَالَ مَرَّتَيْنِ أَوْ ثَلَاثًا وَلَمْ يَذْكُرْ أَبَا رَزِينٍ",
      "id": "Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Razin] dan [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila salah seorang dari kalian bangun di malam hari, maka janganlah dia mencelupkan tangannya ke dalam bejana hingga membasuhnya tiga kali terlebih dahulu, karena sesungguhnya dia tidak tahu di mana posisi tangannya semalam.\" Telah menceritakan kepada kami [Musaddad] telah menceritakan kepada kami [Isa bin Yunus] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, yakni dengan hadits ini, dia mengatakannya dua atau tiga kali dan tidak menyebutkan Abu Razin. ",
      "en": "Having told us [Musaddad] had told us [Abu Mu'awiyah] from [Al A'masy] from [Abu Razin] and [Abu Shalih] from [Abu Hurairah] he said;Rasulullah sallallaahu 'alayhi wasallam said: \"If one of you wakes up at night, then he should not dip his hand into the vessel until washing it three times first, because in fact he did not know where his hand was last night.\"Having told us [Musaddad] had told us [Isa bin Yunus] from [Al A'masy] from [Abu Shalih] from [Abu Hurairah] from the Prophet sallallaahu 'alaihi wasallam, namely with this hadith, he said it two or three times and did not mention Abu Razin."
    }
  },
  {
    "id": "tirmidzi-95",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 95",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ هُوَ الْقُرَشِيُّ عَنْ أَبِي عُبَيْدَةَ بْنِ مُحَمَّدِ بْنِ عَمَّارِ بْنِ يَاسِرٍ قَالَسَأَلْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ عَنْ الْمَسْحِ عَلَى الْخُفَّيْنِ فَقَالَ السُّنَّةُ يَا ابْنَ أَخِي قَالَ وَسَأَلْتُهُ عَنْ الْمَسْحِ عَلَى الْعِمَامَةِ فَقَالَ أَمِسَّ الشَّعَرَ الْمَاءَ",
      "id": "telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Bisyr bin Al Mufaddlal] dari [Abdurrahman bin Ishaq Al Qurasyi], dari [Abu Ubaidah bin Muhammad bin 'Ammar bin Yasir] ia berkata; \"Aku pernah bertanya kepada [Jabir bin Abdullah] tentang mengusap kedua khuf, lalu dia menjawab, \"Itu adalah sunnah wahai anak saudaraku.\" berkata; Dan aku juga bertanya kepadanya tentang mengusap Imamah, maka ia menjawab, \"Usaplah rambut dengan air.\"",
      "en": "Having told us [Qutaibah bin Sa'id] said, had told us [Bisyr bin Al Mufaddlal] from [Abdurrahman bin Ishaq Al Qurasyi], from [Abu Ubaidah bin Muhammad bin 'Ammar bin Yasir] he said;\"I once asked [Jabir bin Abdullah] about rubbing the two Khuf, then he answered,\" it is the sunnah, O my brother's child. \"Said; and I also asked him about rubbing his Imamat, so he answered,\" Wipe hair with water. \""
    }
  },
  {
    "id": "nasai-96",
    "book": "Nasai",
    "source": "HR. Nasai, No. 96",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ وَاللَّفْظُ لَهُ عَنْ ابْنِ الْقَاسِمِ قَالَ حَدَّثَنِي مَالِكٌ عَنْ عَمْرِو بْنِ يَحْيَى الْمَازِنِيِّ عَنْ أَبِيهِأَنَّهُ قَالَ لِعَبْدِ اللَّهِ بْنِ زَيْدِ بْنِ عَاصِمٍ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَدُّ عَمْرِو بْنِ يَحْيَى هَلْ تَسْتَطِيعُ أَنْ تُرِيَنِي كَيْفَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ قَالَ عَبْدُ اللَّهِ بْنُ زَيْدٍ نَعَمْ فَدَعَا بِوَضُوءٍ فَأَفْرَغَ عَلَى يَدَيْهِ فَغَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ ثُمَّ تَمَضْمَضَ وَاسْتَنْشَقَ ثَلَاثًا ثُمَّ غَسَلَ وَجْهَهُ ثَلَاثًا ثُمَّ غَسَلَ يَدَيْهِ مَرَّتَيْنِ مَرَّتَيْنِ إِلَى الْمِرْفَقَيْنِ ثُمَّ مَسَحَ رَأْسَهُ بِيَدَيْهِ فَأَقْبَلَ بِهِمَا وَأَدْبَرَ بَدَأَ بِمُقَدَّمِ رَأْسِهِ ثُمَّ ذَهَبَ بِهِمَا إِلَى قَفَاهُ ثُمَّ رَدَّهُمَا حَتَّى رَجَعَ إِلَى الْمَكَانِ الَّذِي بَدَأَ مِنْهُ ثُمَّ غَسَلَ رِجْلَيْهِ",
      "id": "Telah mengabarkan kepada kami [Muhammad bin Salamah] dan [Al Harits bin Miskin] telah di bacakan kepadanya dan saya mendengar lafazhnya dari dia, dari [Ibnu Qasim] dia berkata; telah menceritakan kepadaku [Malik] dari ['Amru bin Yahya Al Mazini] dari [Bapaknya] bahwa dia berkata kepada [Abdullah bin Zaid bin 'Ashim] - sahabat Rasulullah shallallahu 'alaihi wasallam, dan kakeknya Amru bin Yahya-, \"Bisakah engkau memperlihatkan kepadaku cara Rasulullah shallallahu 'alaihi wasallam berwudlu?\" Abdullah bin Zaid berkata, \"Ya.\" Lalu ia meminta air wudlu, kemudian menuangkan air kedua tangannya dan membasuhnya dua kali-dua kali. Kemudian berkumur dan memasukkan air ke dalam hidungnya tiga kali, membasuh mukanya tiga kali, membasuh kedua tangannya dua kali sampai kedua sikunya, mengusap kepalanya dengan kedua tangannya. Ia jalankan kedua tangannya ke depan lalu ke belakang, ia mulai dari ujung kepalanya lalu ditarik ke belakang sampai tengkuknya, lantas mengembalikannya ke tempat semula, kemudian membasuh kedua kakinya.\"",
      "en": "Has reported to us [Muhammad bin Salamah] and [Al Harits Bin Poor] had been read to him and I heard his lafazh from him, from [Ibnu Qasim] he said;Have told me [Malik] from ['Amru bin Yahya Al Mazini] from [his father] that he said to [Abdullah bin Zaid bin' Ashim] - Friends of the Prophet sallallaahu 'alaihi wasallam, and his grandfather Amru bin Yahya-, \"Can you show me the way the Prophet's Prophet'Abdullah bin Zaid said, \"Yes.\"Then he asked for Wudlu water, then poured the water of both hands and washed it twice or two times.Then rinse and put water into his nose three times, washed his face three times, washed his hands twice to his two elbows, rubbing his head with both hands.He runs his hands forward then back, he starts from the end of his head and then pulled back to the nape of his neck, then returns it to its original place, then washed his legs. \""
    }
  },
  {
    "id": "ibnu-majah-97",
    "book": "Ibnu-majah",
    "source": "HR. Ibnu Majah, No. 97",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا أَبُو شُعَيْبٍ صَالِحُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ حَدَّثَنَا عَبْدُ الْقُدُّوسِ بْنُ بَكْرِ بْنِ خُنَيْسٍ حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ عَنْ عَوْنِ بْنِ أَبِي جُحَيْفَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبُو بَكْرٍ وَعُمَرُ سَيِّدَا كُهُولِ أَهْلِ الْجَنَّةِ مِنْ الْأَوَّلِينَ وَالْآخِرِينَ إِلَّا النَّبِيِّينَ وَالْمُرْسَلِينَ",
      "id": "Telah menceritakan kepada kami [Abu Syu'aib Shalih bin Al Haitsam Al Wasithi] berkata, telah menceritakan kepada kami [Abdul Qudus bin Bakr bin Khunais] berkata, telah menceritakan kepada kami [Malik bin Mighwal] dari ['Aun bin Abu Juhaifah] dari [Bapaknya] ia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \" Abu Bakar dan Umar merupakan pemimpin surga bagi yang sebaya baik dari golongan terdahulu maupun yang terakhir, kecuali para Nabi dan Rasul.\"",
      "en": "Having told us [Abu Syu'aib Shalih bin Al Haitsam Al Wasithi] said, had told us [Abdul Qudus bin Bakr Bin Khunais] said, had told us [Malik bin Mighwal] from ['Aun bin Abu Juhaifah] from [his father] he said;Rasulullah sallallaahu 'alayhi wasallam said: \"Abu Bakr and Umar are the leader of heaven for the same age both from the previous and last group, except the prophets and apostles.\""
    }
  },
  {
    "id": "bukhari-98",
    "book": "Bukhari",
    "source": "HR. Bukhari, No. 98",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ قَالَ حَدَّثَنِي مَالِكٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ اللَّهَ لَا يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنْ الْعِبَادِ وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ حَتَّى إِذَا لَمْ يُبْقِ عَالِمًا اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالًا فَسُئِلُوا فَأَفْتَوْا بِغَيْرِ عِلْمٍ فَضَلُّوا وَأَضَلُّواقَالَ الْفِرَبْرِيُّ حَدَّثَنَا عَبَّاسٌ قَالَ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامٍ نَحْوَهُ",
      "id": "Telah menceritakan kepada kami [Isma'il bin Abu Uwais] berkata, telah menceritakan kepadaku [Malik] dari [Hisyam bin 'Urwah] dari [bapaknya] dari [Abdullah bin 'Amru bin Al 'Ash] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah tidaklah mencabut ilmu sekaligus mencabutnya dari hamba, akan tetapi Allah mencabut ilmu dengan cara mewafatkan para ulama hingga bila sudah tidak tersisa ulama maka manusia akan mengangkat pemimpin dari kalangan orang-orang bodoh, ketika mereka ditanya mereka berfatwa tanpa ilmu, mereka sesat dan menyesatkan\". Berkata Al Firabri Telah menceritakan kepada kami 'Abbas berkata, Telah menceritakan kepada kami Qutaibah Telah menceritakan kepada kami Jarir dari Hisyam seperti ini juga. ",
      "en": "Having told us [Isma'il bin Abu Uwais] said, had told me [Malik] from [Hisham bin 'Urwah] from [his father] from [Abdullah bin' Amru bin Al 'Ash] said;I heard the Prophet sallallaahu 'alaihi wasallam said: \"Indeed, Allah did not revoke knowledge and at the same time withdraw it from the servant, but God revoked knowledge by utilizing the scholars so that when there was no ulama then humans would lift leaders from the fools, when they were asked they were unfamiliar without knowledge, they were heretical and misleading\".Said Al Firabri had told us' Abbas said, having told us Qutaibah had told us Jarir from Hisham like this too."
    }
  },
  {
    "id": "muslim-99",
    "book": "Muslim",
    "source": "HR. Muslim, No. 99",
    "narrator": "N/A",
    "text": {
      "arab": "و حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو بَكْرِ بْنُ خَلَّادٍ الْبَاهِلِيُّ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ وَاقِدِ بْنِ مُحَمَّدِ بْنِ زَيْدٍ أَنَّهُ سَمِعَ أَبَاهُ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ فِي حَجَّةِ الْوَدَاعِ وَيْحَكُمْ أَوْ قَالَ وَيْلَكُمْ لَا تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ قَالَ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ أَنَّ أَبَاهُ حَدَّثَهُ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ شُعْبَةَ عَنْ وَاقِدٍ",
      "id": "Dan telah menceritakan kepada kami [Abu Bakar bin Abu Syaibah] dan [Abu Bakar bin Khallad al-Bahili] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Waqid bin Muhammad bin Zaid] bahwa dia mendengar [bapaknya] menceritakan dari [Abdullah bin Umar] dari Nabi shallallahu 'alaihi wasallam, bahwa beliau shallallahu 'alaihi wasallam bersabda saat haji Wada': \"Celakalah kalian, \" atau beliau berkata, \"Neraka Wail untuk kalian, janganlah kalian kembali kafir sesudah (kematian) ku, sebagian kalian memenggal leher sebagian yang lain.\" Dan telah menceritakan kepada kami [Harmalah bin Yahya] telah mengabarkan kepada kami [Abdullah bin Wahab] dia berkata, telah menceritakan kepadaku [Umar bin Muhammad] bahwa [bapaknya] menceritakan kepadanya dari [Ibnu Umar] dari Nabi shallallahu 'alaihi wasallam, seperti hadits Syu'bah, dari Waqid.\"",
      "en": "And has told us [Abu Bakar bin Abu Syaibah] and [Abu Bakar bin Khalrad al-Bahili] Both of them said, had told us [Muhammad bin Ja'far] had told us [Syu'bah] from [Waqid bin Muhammad bin Zaid] that he heard [his father] told from [Abdullah bin Umar] from the Prophet 'Shalallaahu'Hajj Wada ': \"Woe to you guys,\" or he said, \"Hell wail for you, do not go back to my infidel after (death), some of you cut off the neck of some others.\"And has told us [Harmalah bin Yahya] Has reported to us [Abdullah bin Wahab] he said, had told me [Umar bin Muhammad] that [his father] told him from [Ibn Umar] from the Prophet sallallaahu 'alaihi wasallam, like a Syu'bah hadith, from Waqid. \""
    }
  },
  {
    "id": "abu-daud-100",
    "book": "Abu-daud",
    "source": "HR. Abu Daud, No. 100",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الطُّوسِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا فِطْرٌ عَنْ أَبِي فَرْوَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَالَرَأَيْتُ عَلِيًّا رَضِيَ اللَّهُ عَنْهُ تَوَضَّأَ فَغَسَلَ وَجْهَهُ ثَلَاثًا وَغَسَلَ ذِرَاعَيْهِ ثَلَاثًا وَمَسَحَ بِرَأْسِهِ وَاحِدَةً ثُمَّ قَالَ هَكَذَا تَوَضَّأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub Ath Thusi] telah menceritakan kepada kami [Ubaidullah bin Musa] telah menceritakan kepada kami [Fithr] dari [Abu Farwah] dari [Abdurrahman bin Abi Laila], dia berkata; Saya pernah melihat [Ali radliallahu 'anhu] berwudhu, dia membasuh wajahnya tiga kali, membasuh kedua lengannya tiga kali, dan mengusap kepalanya satu kali, kemudian berkata; Beginilah Rasulullah shallallahu 'alaihi wasallam berwudhu. ",
      "en": "Has told us [Ziyad bin Ayyub Ath Thusi] had told us [Ubaidullah bin Musa] had told us [Fithr] from [Abu Farwah] from [Abdurrahman bin Abi Laila], he said;I once saw [Ali Radliallahu 'anhu] ablution, he washed his face three times, washed his arms three times, and rubbed his head once, then said;This is the Prophet sallallaahu 'alaihi wasallam ablution."
    }
  },
  {
    "id": "tirmidzi-1",
    "book": "Tirmidzi",
    "source": "HR. Tirmidzi, No. 1",
    "narrator": "N/A",
    "text": {
      "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكِ بْنِ حَرْبٍ ح و حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ إِسْرَائِيلَ عَنْ سِمَاكٍ عَنْ مُصْعَبِ بْنِ سَعْدٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تُقْبَلُ صَلَاةٌ بِغَيْرِ طُهُورٍ وَلَا صَدَقَةٌ مِنْ غُلُولٍقَالَ هَنَّادٌ فِي حَدِيثِهِ إِلَّا بِطُهُورٍ قَالَ أَبُو عِيسَى هَذَا الْحَدِيثُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ وَفِي الْبَاب عَنْ أَبِي الْمَلِيحِ عَنْ أَبِيهِ وَأَبِي هُرَيْرَةَ وَأَنَسٍ وَأَبُو الْمَلِيحِ بْنُ أُسَامَةَ اسْمُهُ عَامِرٌ وَيُقَالُ زَيْدُ بْنُ أُسَامَةَ بْنِ عُمَيْرٍ الْهُذَلِيُّ",
      "id": "telah menceritakan kepada kami [Qutaibah bin Sa'id] berkata, telah menceritakan kepada kami [Abu Awanah] dari [Simak bin Harb], dan telah menceritakan kepada kami [Hannad] berkata, telah menceritakan kepada kami [Waki'] dari [Israil] dari [Simak] dari [Mush'ab bin Sa'd] dari [Ibnu Umar] dari Nabi Shallahu 'alaihi wa Sallam, beliau bersabda: \" Tidak akan diterima shalat yang dilakukan tanpa bersuci, dan tidak akan diterima sedekah yang berasal dari harta curian.\" Hannad menyebutkan dalam haditsnya, \"tidak suci.\" Abu Isa berkata; \"Hadits ini adalah yang paling shahih dan paling baik dalam bab ini.\" Dalam bab tersebut juga ada hadits dari Abu Al Malih dari Bapaknya dan Abu Hurairah dan Anas. Dan Abu Al Malih bin Usamah namanya adalah Amir, disebut juga Zaid bin Usamah bin Umair Al Hudzali.\"",
      "en": "Has told us [Qutaibah bin Sa'id] said, had told us [Abu Awanah] from [SIMAK bin Harb], and had told us [Hannad] said, he had told us [Waki '] from [Israel] from [SIMAK] from [Mush'ab bin Sa'd] from [Ibn Umar] from the Prophet'purification, and will not be received by alms coming from stolen property. \"Hannad mentioned in his hadith, \"Not Suci.\"Abu Isa said;\"This hadith is the most authentic and best in this chapter.\"In the chapter there is also a hadith from Abu Al Malih from his father and Abu Hurairah and Anas.And Abu Al Malih bin Usamah's name is Amir, also called Zaid bin Usamah bin Umair Al Hudzali. \""
    }
  },
  {
    "id": "nasai-2",
    "book": "Nasai",
    "source": "HR. Nasai, No. 2",
    "narrator": "N/A",
    "text": {
      "arab": "أَخْبَرَنَا إِسْحَقُ بْنُ إِبْرَاهِيمَ وَقُتَيْبَةُ بْنُ سَعِيدٍ عَنْ جَرِيرٍ عَنْ مَنْصُورٍ عَنْ أَبِي وَائِلٍ عَنْ حُذَيْفَةَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ مِنْ اللَّيْلِ يَشُوصُ فَاهُ بِالسِّوَاكِ",
      "id": "Telah mengabarkan kepada kami [Ishaq bin Ibrahim] dan [Qutaibah bin Said] dari [Jarir] dari [Manshur] dari [Abu Wail] dari [Hudzaifah] berkata: \" Rasulullah shallallahu 'alaihi wasallam apabila hendak melaksanakan shalat lail beliau menggosok mulutnya dengan siwak.\"",
      "en": "Has reported to us [Ishaq bin Ibrahim] and [Qutaibah bin Said] from [Jarir] from [Manshur] from [Abu Wail] from [Hudzaifah] said: \"Rasulullah sallallaahu 'alaihi wasallam if he wanted to perform lail prayer he rubbed his mouth with siwak.\""
    }
  }
]